{
  "1.1": "1.1   SCOPE  This Standard sets out the minimum safety requirements related to the use of generating  sets for the supply of electricity at low voltage, that is, not  exceeding 1000 V a.c or 1500 V  d.c.  The Standard applies to electricity generating sets that are dr iven by internal combustion  engines, and forms any of the following:  (a) Normal supply source for electrical installations.  (b) Alternative supply source for electrical installations.  (c) Electrical supply source for the connection of electrical appli ances and portable tools.  (d) Supply sources that operate in parallel with the normal supply i n  t h e  e l e c t r i c a l   installation.  This Standard does not—  (i) apply to uninterruptible power supplies; or  (ii) apply to other renewable energy generation systems, such a s, the following:  (A) Inverters.  (B) Photovoltaic arrays.  (C) Water or wind driven turbines.  NOTE: While intended to be applied to low voltage generating se ts driven by internal combustion  engines, the electrical principles could be applied to other ty pes of energy sources.",
  "1.2": "1.2   APPLICATION  In addition to being in accordance  with the requirements of AS/NZS 3000 and the  additional requirements of this Standard, the generating set installation may be required to  comply with requirements of electricity distributors and other relevant regulatory  authorities. It is, therefore, recommended that these authoriti es be consulted prior to the  installation of equipment.  Section 2 outlines general requirements for the installation of  generating sets to an  electrical installation. Sections 3 and 4 introduce additional requirements for permanently  connected and plug and socket ou tlet connected generating sets respectively.  Appendix A specifies the fault current path when the generating set is fixed wired to an  electrical installation.  Appendix B specifies a New-Zealand-only guidance for the connec tion of portable  generating sets when directly supplying portable tools connecte d to the generating set by  plugs and sockets.   Appendix C specifies a New Zealand-only provision for the conne ction of a dedicated  wiring system within an electrical installation.  NZ NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  5  AS/NZS 3010:2017   COPYRIGHT  Appendix D sets out the requirements and recommendations for the performance and  construction of transportable generating sets up to 25 kW.  Requirements for the design, installation and operation of emergency power supplies in  hospitals are given in AS/NZS 3009.  Requirements for the design, installation and operation of unin terruptible power supplies  are given in AS 62040 (series).  Requirements for renewable energy  s y s t e m s  a r e  g i v e n  i n  A S / N Z S  4777 (series),  AS/NZS 4509 (series) and AS/NZS 5033.  Requirements for transportable structures are provided in AS/NZ S 3001.  Requirements for shows and carnivals are provided in AS/NZS 300 2.  Requirements for marinas and boa ts are provided in AS/NZS 3004.   Requirements for construction a nd demolition sites are provided  in AS/NZS 3012.  Attention is drawn to the fact that some regulatory authorities  have requirements for  limitation of noise levels, pollution emissions and for fuel sy stems.",
  "1.3": "1.3   REFERENCED DOCUMENTS  The following documents are referred to in this Standard:  AS   1019 Internal combustion engines—Spark emission control devices   1319 Safety signs for the occupational environment  1668 The use of ventilation and airconditioning in buildings",
  "1.4": "1.4   DEFINITIONS  For the purposes of this Standard, the definitions given in AS/ NZS 3000 and those below  apply.",
  "1.5": "1.5   SYMBOLS  All symbols contained in Figures 2.1 to D1 are defined in Table  2.1.    Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  10  COPYRIGHT  SECTION 2   GENERAL REQUIREMENTS FOR  THE INSTALLATION OF GENERATING SETS",
  "2.1": "2.1   GENERAL",
  "2.2": "2.2   LOCATION  Generating sets shall not be opera ted in locations where exhaus t gases, smoke or fumes  could reach dangerous concentrations or enter either directly or indirectly any enclosed  areas occupied by persons.  In tunnelling operations, reduced low voltage diesel engine gen erating sets fitted with an  exhaust conditioning system or  appropriate ventilation systems, may be used.  In addition, generating sets shall not be installed—  (a) in damp situations or exposed t o the weather unless suitably pr otected;   (b) in hazardous areas, unless the equipment and method of installa tion is in accordance  with AS/NZS 3000 and AS/NZS 60079 (series) and the requirements  of any relevant  regulatory authority; or  (c) in locations that would provide a fire hazard for the fuel tank (s) and associated  fittings provided for the generator set.",
  "2.3": "2.3   MECHANICAL AND THERMAL PROTECTION",
  "2.4": "2.4   CONTROL OF GENERATING SET",
  "2.5": "2.5   EARTHING ARRANGEMENTS  When the multiple earth neutral system (MEN) is to be employed,  the following connection  principles shall apply:  (a) The MEN connection shall be made at the main switchboard. This will require  disconnection or removal of the alternator winding neutral to f rame links within the  generating set where that generating set switchboard is not nom inated as the main  switchboard.  (b) Where a generating set is connected to an electrical installati on as either the primary  source supply or alternative s ource of supply to the normal pow er supply, the  alternator winding shall have no internal connection to the ear thing system of the  generating set.  The only connection between the neutral conductor of the supply  system and the  earthing arrangement is the MEN link located within the main sw itchboard.  (c) Where the normal power supply is the MEN system of supply, the incoming neutral  conductor of the supply system shall not be switched prior to t he MEN link.   (d) In Australia, neutral and earth c onductors shall not operate in  parallel, except as  specified below.  When the earth neutral system is to be employed and, when operating under generator  or transformer supply, the generator neutral and earthing condu ctors shall be installed  such that—  (i) generator neutral and earth conductors are individually suitabl e for the  maximum calculated fault current to be carried by each conducto r;  (ii) the nominal size of generator earthing conductors be in accordance with the  requirements of AS/NZS 3000; and  (iii)  the current-carrying capacity of generator neutral conductors b e in accordance  with the requirements of AS/NZS 3000.  (e) Where a MEN connection or link is located at a main switchboard of an electrical  installation to which a generating set is connected, the electr ical installation earth  electrode shall be connected to the main switchboard in accorda nce with  AS/NZS 3000 requirements. An earth electrode shall not be direc tly connected to the  generating set.  (f) The changeover device shall be selected so as to maintain the f unction(s) of and  prevent damage to the electrical installation being supplied.  NOTE: Examples of functions to be maintained include the overla pping of neutrals, the  operation of residual current devices or the continued operatio n of uninterruptible power  supplies.  (g) In New Zealand, a generating set supplying an installation shall be connected only to  the main switchboard of the electrical installation.  New Zealand only exceptions :  The generating set may be connected to a distribution switchboard provided—  (i) the generating set is arranged to cease s upply of electricity in the event that the  supply to that distribution switchboard is interrupted; and  (ii) the supply to the distribution switchboar d from any other source is disconnected, a  MEN earthing arrangement is established, and a protective system to control earth  potential rise is provided.  A NZ NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  15 AS/NZS 3010:2017   COPYRIGHT",
  "2.6": "2.6   ELECTRICAL  INSTALLATION",
  "2.7": "2.7   ALTERNATIVE SUPPLY (STANDBY)",
  "2.8": "2.8   EARTHING AND BOND ING REQUIREMENTS",
  "2.9": "2.9   GENERATOR SWITCHBOARDS  All generator switchboards shall be—  (a) installed in accordance with the requirements of AS/NZS 3000; a nd  (b) constructed in accordance with AS/NZS 3439 or AS/NZS 61439 (ser ies).",
  "2.10": "2.10   LIGHTNING PROTECTION SYSTEMS  Depending on the geographical location, it may be necessary to protect equipment against  lightning or excessive overvoltage . Where employed, lightning or overvoltage protection  shall be located as close as pr acticable to the equipment it pr otects.  NOTE: Information on the protection of equipment against lightn ing is contained in  AS/NZS 3000.",
  "2.11": "2.11   GENERATING SETS CONNECTED  AS NORMAL SUPPLY TO A MAIN  SWITCHBOARD IN A PERMANENT ELECTRICAL INSTALLATION",
  "2.12": "2.12   GENERATING SETS CONNECTED  TO AN ELECTRICAL INSTALLATION  CONNECTED AS AN ALTERNATIVE SUPPLY",
  "3.1": "3.1   GENERAL  This Section gives particular r equirements for generating sets that are permanently  connected to electrical installations, specific equipment or services. These provisions shall  be applied in addition to the general requirements for generati ng sets given in Section 2 of  this Standard.",
  "3.2": "3.2   LOCATION",
  "3.3": "3.3   GUARDING OF LIVE PARTS",
  "3.4": "3.4   TRANSFORMERS  The secondary circuits of instrument transformers shall be effe ctively earthed except where  functional requirements do not permit earthing of such circuits .  Current transformers shall have provision for short-circuiting the secondary winding.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  46  COPYRIGHT",
  "3.5": "3.5   GENERATING SETS SUPPLYING  SAFETY AND ESSE NTIAL SERVICES",
  "4.1": "4.1   GENERAL  This Section specifies additional requirements for generating sets that are connected to an  electrical installation by means of a detachable connection [e. g. flexible cable (or cord)  with plug and cord connector fittings].   Such connections are generally of a temporary nature where an independent or alternative  supply is required and where—  (a) the installation of a permanently connected generating set is n ot justified; and  (b) the connection of the generating set is expected to be carried out by non-qualified  persons.  The additional requirements shall be applied to the general req uirements for generating sets  given in Section 2 of this Standa rd when connected by installat ion wiring to the appliance  inlet connector.  NOTES:    1 An example of connecting a generating set to an electrical inst allation main switchboard by a  detachable connection are shown in Figure 4.2 for three-phase and Figure 4.3 for   single-phase.  2 Other earthing systems   Alternatives to MEN and segregated ear thing systems may be  permitted, provided that the requirements of Part 1 of AS/NZS 3 000 are satisfied, e.g. TN-S  earthing.  This Section does not apply to generating sets used for the dir ect supply to portable tools  and appliances using the socket outlet(s) fitted to the generat ing set, see Appendix B for  guidance.",
  "4.2": "4.2   CONNECTION TO AN ELECTRICAL INSTALLATION",
  "4.3": "4.3   EARTHING AND BONDING",
  "4.4": "4.4   CONNECTION OF A PORTABLE GENERATING SET TO  A DEDICATED  WIRING SYSTEM—NEW ZEALAND ONLY  In New Zealand only, for the conne ction of a portable generatin g set to a dedicated wiring  system contained in an electrical installation, see Appendix C for details.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  55 AS/NZS 3010:2017   COPYRIGHT To load via protection devices GENERATING SET N - BAR E - BAR MEN link* MAIN SWITCHBOARD N L1 EE N N E L2 L3 L1 Appliance inlet Socket outlet L2 L3 L3 L2 L1 L2L1 L3 No neutral earth connection at generator set Main switch includes overcurrent protection Cord connector Plug     FIGURE  4.1   TYPICAL ARRANGEMEN T FOR A SINGLE GENERATING SET CONNECTED VIA SOCKET AND LEAD AS THE PRIMARY  SUPPLY TO A MAIN SWITCHBOARD W HICH HAS A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  56  COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices Manual changeover device † PORTABLE GENERATING SET N - BAR E - BAR MEN link MAIN SWITCHBOARD * Includes overcurrent protection rated to suit the generator input socket and  the current carrying capacity of the cable. † Changeover device shall include an off position where no other main switch  is installed for the normal supply. Mains supply OFF Generator supply N N N N E E L1 FIXED ELECTRICAL INSTALLATION EE Generator supply main switch* N N Generator Isolating device (may include circuit protection) No Neutral earth connection at generator set E L2 L1 L3 L2L1NE L3 L2L1N L3 5 pin Appliance Inlet 5 pin Socket- Outlet L2 L3 N L1 L2 L3 L1 L2 L3 Cord connector Plug     FIGURE  4.2   TYPICAL THREE POLE/FOUR POLE MANUAL CHANGEOVER AR RANGEMENT FOR A THREE-PHASE PORTABLE  GENERATING SET WITH THREE POLE L OCAL ISOLATION INSTALLED AS AN ALTERNATIVE SUPPLY, CONNECTED VIA SOCKET  AND LEAD TO A SWITCHBOARD WITH A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  57 AS/NZS 3010:2017   COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L1NE L1N N Manual Changeover device † PORTABLE GENERATING SET Generator Isolating device (may include circuit protection) N - BAR E - BAR MEN link MAIN SWITCHBOARD * Includes overcurrent protection rated to suit the generator input socket and  the current carrying capacity of the cable. † Changeover device shall include an off position where no other main switch  is installed for the normal supply. No Neutral earth connection at generator set 3 pin Socket- Outlet 3 pin Appliance-Inlet Mains supply OFF Generator supply N N N N N E E L1 L1 FIXED ELECTRICAL INSTALLATION E EE Generator supply main switch*     FIGURE  4.3   TYPICAL ONE POLE/TWO  POLE MANUAL CHANGEOVER ARRAN GEMENT FOR A SINGLE-PHASE PORTABLE  GENERATING SET WITH TWO POLE L OCAL ISOLATION IN STALLED AS AN AL TERNATIVE SUPPLY, CONN ECTED VIA SOCKET AND  LEAD TO A SWITCHBOARD WI TH A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  58  COPYRIGHT  APPENDIX   A  EARTHING REQUIREMENTS FOR GENERATING SETS CONNECTED TO  FIXED ELECTRICAL INSTALLATIONS  (Normative)  A1   GENERAL  This Appendix specifies the earthing connections required for generating sets connected to  an electrical installation as an alternative source of supply.  This Appendix explains the reas ons why an earth electrode is no t required or recommended  to be connected to the generator set.  A2   EARTHING OF GENERATING SETS CONNECTED TO AN ELECTRICAL  INSTALLATION BY INSTALLATION WIRING  A2.1   System of supply  Where an electrical installation is arranged to operate from mu ltiple sources of supply   (such as occurs when normally supplied by an electricity distri butor’s network, or  alternatively from a generating set output), the system of supply configuration connected to  the installation loading shall be the same system of supply, e. g. MEN, irrespective of the  supply source.  This means that the connection to earth of the neutral and eart hing connections of the  generating set shall use the same  earthing and neutral bonding connection points in the  electrical installation.   A2.2   Earth electrode  As the electrical installation main switchboard will have an ea rthing system with an earth  electrode in accordance with the requirements of AS/NZS 3000, t he installation of an  additional earth electrode for exclusive use by the generating set is not required.  A2.3   Earth bonding of neutral connection  The bonding of the generating set neutral connection to earth is dependent on the system of  supply required MEN. The connection of the generating set neutr al to the neutral busbar of  the main switchboard MEN is the only connection required.  Figure A1 details the output conn ections required and shows the path of earth fault current  (dotted line) under earth fault conditions located near the load when the generating set is  supplying the load.   On the occurrence of an earth fault near the load; earth fault current flows through the  generating set active overcurrent  protection device → changeove r device → final subcircuit  protective device → control switc h of the load → the earth faul t → final subcircuit earth  conductor → MEN link → generating set neutral conductor to the overcurrent device in the  generating set.   The earth fault current flow would be interrupted by the tripping of the generating set  overcurrent protection or final subcircuit protection.  On the occurrence of a fault between the live conductors, fault current will flow in the live  conductors only and trip the overc urrent device in the generating set.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  59 AS/NZS 3010:2017   COPYRIGHT  Changeover device ISOLATED OUTPUT GENERATOR SET Overcurrent protection MAIN SWITCHBOARD To mains supply via main switch and protective devices NA EN A N Bar E Bar MEN G EE Load Final sub  circuit protection Control switch Earth fault Frame Earth fault current Earth fault current path   FIGURE  A1   TYPICAL EARTH FAULT PATH FOR GENERATING SETS CONNE CTED TO  FIXED ELECTRICAL INSTALLATIONS  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  60  COPYRIGHT  APPENDIX   B  RECOMMENDATIONS FOR PORTABLE GENERATING SETS SUPPLYING  ELECTRICAL EQUIPMENT (NEW ZEALAND ONLY)  (Informative)  B1   GENERAL  This Appendix provides information on portable or semi-portable  generating sets and the  equipotential bonding connections t hat are required for connect ion of a generating set to  electrical appliances, electrical equipment or portable tools b y means of detachable plug  and socket outlet connections.  This Appendix does not detail the use of terminals on the generating set as the means of  connection between the generating set and directly connected el ectrical appliances,  electrical equipment or portable tools, as this form of connect ion would require connection  by licensed electrical workers only.  This Appendix also covers the use of reduced low voltage (RLV) to supply electrical tools  operating at 110 V supply at voltages no greater than 55 V (sin gle-phase) or 63.5 V   (three-phase) to earth when the generating set is being used to  power portable tools in  tunnelling locations. Details for r educed low voltage generatin g sets are contained in  Paragraph B5.  B2   PORTABLE GENERATING  SET CONFIGURATIONS  B2.1   System of supply  The system of supply provided by the generating set configurati on should be one of the  following:  (a) Isolated output—single-phase or multi-phase (two-phase or three -phase).  (b) RCD protected output—single-phase or multi-phase (two-phase or three-phase).  (c) Isolated output with enhanced personal protection by use of an insulation monitoring  device (IMD) in accordance with IEC 61557-8.  (d) Isolated output provided by a generator set with an electronic inverter module fitted.  (e) Reduced low voltage (RLV) generating sets.  B2.2   Earthing and equipotential bonding  When a generating set output is arranged to directly supply electrical equipment, such as  electrical appliances and portable tools, the earthing connections of the electrical equipment  and the generating set are arranged to form a common equipotent ial bonding system.   This equipotential bonding arrangement ensures that the correct  operation of overcurrent,  and residual current devices if any, under earth fault conditio ns and that all earth fault  leakage currents are returned to the generating set output conn ections.   The equipotential bonding system additionally provides touch vo ltage control between the  conductive surfaces of the generating set and any electrical equipment fittings being  supplied by the generating set.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  61 AS/NZS 3010:2017   COPYRIGHT  B2.3   Bonding of output winding to generating set frame  B2.3.1    Isolated supply  The generating set output winding i s  i s o l a t e d  f r o m  t h e  f r a m e  o f the generating set to  provide electrical separation (isolated) supply to AS/NZS 3000 requirements.  Figure B1 single-phase and Figure B2 three-phase shows the inte rnal wiring of the  generating sets.  Figure B3 details the output connections and details the fault current paths under the fault  conditions shown.  PORTABLE GENERATING SET Equipotential bond L1 L1 L1 N N N * Rated to suit generator socket rating and cable current carrying capacity Overload protection device*   FIGURE  B1   ISOLATED OUTPUT SIN GLE-PHASE GENERATING SET  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  62  COPYRIGHT  ISOLATED OUTPUT THREE PHASE GENERATING SET  CONFORMING WITH APPENDIX D Neutral to  frame link   not fitted Overload and socket outlet isolator  Frame Frame 3 phase + N + E  socket outlet   FIGURE  B2   ISOLATED OUTPUT THREE-PHASE GEN ERATING SET    LoadControl switch Overcurrent protection Frame Plug and socket connection Class I fitting Earth fault 1 Earth fault 2 L1 L2 EB Between live conductors fault G Separated (Isolated)  output  generator set Earth fault current path with earth fault 1 + earth fault 2   FIGURE  B3   SEPARATED (ISOLATED) SUPPLY EARTH FAU LT CURRENT PATHS  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  63 AS/NZS 3010:2017   COPYRIGHT  On the occurrence of earth fault 1 only, or, earth fault 2 only , no fault current will flow, but  one side of the generator output will be connected to the external conductive part of the  Class I equipment connected to the generating set. As the gener ator output is isolated with  respect to the equipotential bonding system, there is no return  path to the generating set  output and no earth fault current flows.  On the simultaneous occurrence of earth fault 1 and earth fault  2 together, fault current  flows through the earth faults 1 and 2 and would trip the overc urrent device in the  generating set. Figure B3 shows the path of earth fault current  under fault conditions.   On the occurrence of a fault between the live conductors only ( see Figure B3), fault current  will flow in the live conductors only and trip the overcurrent protection device in the  generating set.  If an earth electrode is connected to the generating set frame,  this does not form part of a  low impedance earth fault current loop and hence the provision of this connection to the  mass of earth is not recommended or required. The main earth fault loop is comprised of the  equipotential bonding system and the live conductors.   B2.3.2    RCD protected supply  A neutral to frame connection is fitted on RCD protected output  generating sets only, to  provide the correct operation of  an in-built RCD fitted for per sonal safety purposes.  The RCD Type fitted should correctly operate on the output waveform of the generating set.   The RCD should operate in all liv e conductors, including the neutral connection.  In New Zealand only, the RCD should be of a type for which trip ping is ensured for  residual alternating current and residual pulsating direct current.  A typical generating set wiring is given in Figure B4.  PORTABLE GENERATING SET Equipotential bond L1 L1L1 N NN Neutral earth bond upstream of RCD to equipotential bond * Rated to suit generator socket rating and cable current carrying capacity Overload protection device*RCD   FIGURE  B4   RCD PROTECTED SINGLE-PHASE GENERATING SET  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  64  COPYRIGHT  B2.3.3    RCD protected generators  When a RCBO (or RCCB + MCB) is used to detect earth fault or earth leakage current  conditions in the equipotential bonding system, the star point of three-phase generators or  one side of single-phase generators should be connected to the equipotential bonding  system to provide a return path of earth leakage currents to a point upstream of the RCBO  in order to operate or trip the RCBO when the earth leakage current rises above the RCBO  residual current rating.  On the occurrence of a fault between live conductors (see Figur e B5), fault current will  flow in the live conductors and trip the overcurrent section of  the RCBO (or MCB) in the  generating set.  NOTE: Figure B5 details the connections and the path of earth f ault current (dotted line) under  fault conditions.    Load Control switch Frame Plug and socket connection Class I fitting Earth fault A N EB Between live conductors fault G RCBO Overcurrent and earth leakage detection Neutral to frame link Earth fault current RCD protected generating set   FIGURE  B5   RCD PROTECTED SU PPLY EARTH FAULT CURRENT PATH  B2.3.4    Enhanced personal safety supply  The fitting of an insulation monitoring device (IMD) in accordance with IEC 61557-8 is  required to provide enhanced personal safety and should be connected and installed to the  manufacturer’s instructions.  The IMD should be located in the generating set or be contained in a detachable outlet box  or switchboard.  A typical IMD connection is shown in Figure B6, the IMD should control the output from  the generating set by use of a contactor or shunt trip coil fit ted to the generating set  overcurrent protection MCB.  The generating set output should be  isolated from the frame of the generating set to provide  electrical separation (isolated)  supply to AS/NZS 3000 requirem ents.   When an IMD is fitted, the generating set should be permanently  marked ‘ Insulation  monitoring device fitted. Maximum lead length permitted is 500 m’. If the IMD  manufacturer’s instructions specify a different maximum length other than 500 m, that  maximum length should be used.  An IMD fitted in an isolated output generator or a portable soc ket outlet assembly are  shown in Figures B6 and B7 respectively. The connections shown for the IMD are typical  only. The IMD wiring connections to be used  should be those det ailed in the manufacturer’s  instructions.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  65 AS/NZS 3010:2017   COPYRIGHT  B2.3.5    Insulation monitor device (IM D) protected generators operation  When the generating set is running and a output supply is avail able, the IMD device  continuously monitors the insulation resistance between the gen erating set isolated output  live conductors and the equipotential bonding connections of th e generating set, connecting  cables and the load connected to the generating set output.   If the insulation resistance drops below a pre-set value due to  insulation failure, the  generating set output should automatically disconnect the suppl y to the load.  Isolation/current limiting MCBs maximum rating is the current rating of socket outlet Socket outlet 1 Socket outlet X MCB shunt  Trip unit Frame Test/reset Input protection fuses 6 A Overcurrent protection MCB G Insulation Monitoring Device (IMD) to IEC 61557-8 Test/reset SupplySensing NOTE: IMD wiring is typical only, use IMD manufacturers instructions for actual wiring.   FIGURE  B6   ISOLATED OUTPUT GENER ATOR WITH BUIL T-IN INSULATION   MONITORING DEVICE  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  66  COPYRIGHT    Supply must come from an isolated output generator set 3 pin plug and flexible cord connection cable Overcurrent protection for  connection cable and plug MCB Isolation/current limiting MCBs maximum rating is the current rating of socket outlet Socket outlet 1 Socket outlet X MCB shunt  Trip unit Test/reset 6 A fuses Insulation Monitoring Device (IMD) to IEC 61557-8 Test/reset SupplySensing NOTE: IMD wiring is typical only, use IMD manufacturers instructions for actual wiring.   FIGURE  B7   PORTABLE SOCKET OUTLE T ASSEMBLY WITH INSULATION  MONITORING DEVICE  B2.3.6    Isolated output provided by an electronic inverter module  For generating sets fitted with an electronic inverter module, the output is isolated from the  inverter output and frame of the generating set to provide electrical separation (isolated)  supply to AS/NZS 3000 requirements.  NOTE: See Figure B9 for typical d etails of this t ype of generat ing set.  On the occurrence of earth fault in the generating set in the l oad connected, the earth fault  current clearance will be as detailed for an isolated output ge nerating set detailed in  Paragraph B2.3.1.  B2.4   Generating set output connections  B2.4.1    Socket outlet types  The following socket outle t types are to be used:  (a) AS/NZS 3112 (3-pin flat pin) f or single-phase up to 15 A.  (b) IEC 60309 or AS/NZS 3123 (round pins) for single-phase 15 A and  above.  (c) IEC 60309 or AS/NZS 3123 (round pi ns) for three or two-phase + N.  (d) AS/NZS 3120 (3-pin flat pin) f or single-phase up to 15 A.  When cord extension socket, cord extension set and socket outle t types exceeding the  current ratings available for the above listed Standards are re quired, the detachable  connection fittings should confor m with other Australian, Austr alian/New Zealand or  international Standards requirements.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  67 AS/NZS 3010:2017   COPYRIGHT  For single-phase generating sets only, with a rated output up 4  kW, the output connection  should be made only by socket ou tlets in accordance with AS/NZS  3112 or AS/NZS 3120.  B2.4.2    Socket outlet control switching  The circuit-breaker provided for generating set overcurrent pro tection may be used for the  control for a maximum of two adjacent socket outlets.  If three or more socket outlets are provided on the generating set, or, are contained in a  switchboard fixed or adjacent to the generating set, the following requirements apply:  (a) All socket outlets should be individually controlled by an adja cent control switch.  (b) All switches or overcurrent devices should operate in all live poles (including the  neutral conductor).   (c) The rating of the overcurrent device should not exceed the rati ng of the smallest  rating socket outlet.  (d) The designated earthing terminals of all socket outlets should be connected to the  equipotential bonding conductor and the generating set frame to AS/NZS 3000  requirements for a separated (isolated) supply or RCD protected  supply.  (e) For an attached switchboard only, the total loading of the input to switchboard should  be limited by a switchboard mounted circuit-breaker; the maximum current rating  should be the lesser of the plug rating or the current rating o f the connecting cord to  the supply source.  B3   LIMITATIONS FOR THE SUPPLY TO MULTIPLE ITEMS OF ELECTRICAL   EQUIPMENT FROM A GENERATING SET  B3.1   Isolated supply  The provisions of AS/NZS 3000 for separated (isolated) supply apply to the supply  arrangements of multiple items of electrical equipment when operating from an isolated  output supply from a generating set.  B3.2   RCD protected supply  The 30 mA RCD provided for the generating set supply output wil l provide earth leakage  protection for all equipment connected to the generating set. T here are no limitations to the  number of Class I and Class II electrical equipment that can be  supplied, other than a limit  imposed by the sum of the leakage currents from all operating e lectrical equipment.  B3.3   IMD protected supply   When the generating set output is available the IMD provides co ntinuous monitoring of the  insulation resistance between live parts and equipotential bond ing of the generator set and  the connected loading will detect any insulation failure and th en automatically disconnect  the supply.  There are no limitations to the number of Class I and Class II electrical equipment that can  be supplied, other than a limit imposed by the sum of the insul ation resistance from all  electrical equipment when connected in parallel, and the maximum length of 500 m or the  IMD manufacturer’s maximum cord  length recommendation, whicheve r is the lesser, for the  extension cords connecting the generating set and the connected load.  B3.4   Electronic inverter type supply  The output of an electronic inverter supply has the same limita tions as for Paragraph B3.1.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  68  COPYRIGHT  B3.5   Externally connected multiple socket outlet connections  B3.5.1    Using a distribution switchboard  With portable or semi-portable generating sets a distribution b oard or switchboard may be  used to provide additional socket outlets; each socket outlet s hould have overcurrent  protection in all live conductors, including the neutral connec tion. The overcurrent  protection rating should not exceed the rating of the socket ou tlet it is protecting.  NOTE: Figure B8 gives a typical example of a distribution outle t box or switchboard.  Isolation/current  limiting  MCBs maximum rating  is the current  rating of socket  outlet Socket outlet 1 Socket outlet X Overcurrent  protection MCB DISTRIBUTION SWITCHBOARD ISOLATED OUTPUT GENERATING SET Isolating switch G Frame   FIGURE  B8   GENERATIN G SET WITH DISTRIBUTION SWITCHBOARD  B3.5.2    Use of portable socket outlet assembly (PSOA)  A PSOA in accordance with AS/NZS 3012 or AS/NZS 3190 may be used for the provision  of multiple socket outlets when plug connected to portable gene rating sets with an isolated  output or RCD protected system of supply.   B4   ADDITIONAL PROVISIONS FOR GENERATING SETS WITH AN  ELECTRONIC INVERTER MODULE  B4.1   General  An electronic inverter module capable of providing a constant frequency sine wave with a  closed voltage controlled output with a very low harmonic conte n t  m a y  b e  u s e d  i n  t h e   supply for the operation of computer equipment and other electronic equipment. This allows  for some variations of the requirements detailed above in this appendix to be made for this  type of generating set.  NOTE: See Paragraphs B4.2 to B4.4 for further information.  B4.2   Engine  In periods of light loading, without loads containing motors, t he engine speed may be  reduced to lower the a.c. power input to the inverter module. I n periods of high loading and  when motor starting currents are needed, the engine should run at the normal speed.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  69 AS/NZS 3010:2017   COPYRIGHT  B4.3   Engine coupled generator  The engine coupled generator provides for an a.c. supply to the input of the inverter  module, the engine speed is able to be varied and hence the inp ut frequency into the  inverter module will also vary, but the generating set output frequency will be fixed by the  inverter module output.  The engine coupled mounted generator may also provide an ELV in put to the inverter  module for ELV battery charging.  B4.4   Inverter module  The LV and ELV outputs from the inverter modules may be provided with in-built  electronic overcurrent protection. The fitting of external overcurrent protection devices is  required and may be used as the output isolation switch.  The LV and the ELV inputs and outputs from the inverter module should be isolated from  each other.  NOTE: A typical arrangement  is shown in Figure B9.  Variable  speed engine  A.C. &  D.C. generators Inverter & electronic  overland module Engine  controls ELV DC LV AC Explanatory only Frame Engine run Overcurrent protection/isolater   FIGURE  B9   GENERATOR SET  WITH INVERTER MODULE  B5   REDUCED LOW VOLTAGE GENERATING SETS  B5.1   Use of reduced low voltage generating sets  Generating sets supplying 110 V a .c. tools should conform with Paragraph B5.  B5.2   Output supply configuration  The output supply configuration should be a maximum of 110 V a. c. at 50 Hz with a centre  tapped output winding that should be connected to the generatin g  s e t  f r a m e ,  t o  f o r m  a   single-phase output supply in which no live part can exceed 55 V with respect to the engine  frame.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  70  COPYRIGHT  B5.3   Output overcurrent protection  The single-phase socket outlet overcurrent protection should be  provided by a two pole  MCB in the unearthed connections from the generator, the rating  should not exceed the  maximum rating of the generator  set output. Figure B10 gives de tails of a typical generating  set.  B5.4   Socket outlet type  The single-phase socket outlet type should be IEC 60309 with the socket outlet keyway  position in the 110 V 50 Hz suppl y position and should be coloured ‘Yellow’. The earth  terminal of the socket outlet should be bonded to the generatin g set frame.  B5.5   Electrical performance  The single-phase electrical performance, voltage regulation sho uld conform with  Paragraph D6.1. With the exception that the output voltage shou ld be 110 V with a centre  tap output winding connection to the generating set engine bonding system so that no live  part exceeds reduced low voltage.    REDUCED LOW VOLTAGE 110 VOLTS GENERATING SET COMPLYING WITH APPENDIX D Overcurrent protection & socket outlet isolator G Frame L1 L2 IEC 60309 110 V  socket outlet to  be labelled  “REDUCED LOW  VOLTAGE 110 VOLT  EQUIPMENT  ONLY” 110 Volt winding with centre tap connected to frame   FIGURE  B10   REDUCED  LOW VOLTAGE SINGLE-PHASE GENERATING SET W ITH  110 V IEC 60309 SOCKET OUTLET  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  71 AS/NZS 3010:2017   COPYRIGHT  B5.6   Three-phase supply  The principles of Paragraphs B5.2 to B5.4 also apply to three-p hase sets, excepting that  overcurrent protection should be four pole (three-phase + N) and socket outlet should be   three-phase + N + E to IEC 60309 for 110 V 50 Hz  supply and sh ould be coloured  ‘Yellow’. The maximum voltage f rom an active conductor to the g enerating set frame is",
  "1668.2": "1668.2 Part 2: Mechanical ventilation in buildings  1940 The storage and handling of f lammable and combustible liqu ids  2221 Methods for measurement of airborne sound emitted by compr essor units including primemovers and by pneumatic tools and machines",
  "2221.1": "2221.1 Part 1: Engineering method for measurement of airborne sound emitted by compressor/primemover units intended for outdoor use  2676 Guide to the installation, maintenance, testing and replacement of secondary batteries in buildings (series)  3011 Electrical installations—Secondary batteries installed in buildings (series)  4594 Internal combustion engines—Performance",
  "4594.1": "4594.1 Part 1: Standard reference conditions, declarations of power, fuel and lubricating oil consumptions, and test methods",
  "4594.4": "4594.4 Part 4: Engines for land, rail-traction and marine use—S peed governing",
  "4594.5": "4594.5 Part 5: Engines for land, rail-traction and marine use—T orsional vibrations  60034 Rotating electrical machines",
  "60034.1": "60034.1 Part 1: Rating and performance (IEC 60034-1, Ed. 11(200 4) MOD)  60529 Degrees of protection provided by enclosures (IP Code)  62040 Uninterruptible power systems (UPS) (series)  AS/NZS   1768 Lightning protection  3000 Electrical installations (known as the Australian/New Zeal and Wiring Rules)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  6   COPYRIGHT  AS/NZS   3007 Electrical installation—Surf ace mines and associated proce ssing plant— General requirements for equipment and ancillaries (series)  3009 Electrical installations—Emergency power supplies in hospi tals  3012 Electrical installations—Construction and demolition sites   3100 Approval and test specification—General requirements for e lectrical equipment 3112 Approval and test specification—Plugs and socket-outlets  3120 Approval and test specification—Cord extension sockets  3123 Approval and test specification—Plugs, socket-outlets and couplers for general industrial application  3133 Approval and test specification—Air-break switches  3190 Approval and test specification—Residual current devices ( current-operated earth-leakage devices)  3439 Low-voltage switchgear and controlgear assemblies (series)   3584 Diesel engine systems f or underground coal mines",
  "3584.1": "3584.1 Part 1: Fire protected—Heavy duty  3820 Essential safety requirements for electrical equipment  3947 Low-voltage switc hgear and controlgear",
  "3947.6.1": "3947.6.1 Part 6.1: Multiple functi on equipment—Automatic transfer switching  equipment  4024 Safety of machinery",
  "4024.1601": "4024.1601 Part 1601: Design of controls, interlocks and guardin g—Guards—General requirements for the design and construction of fixed movable guards  4509 Stand-alone power systems (series)  4777 Grid connection of energy systems via inverters (series)  5033 Installation and safety requ irements for photovoltaic (PV)  arrays  60079 Explosive atmospheres (series)  60269 Low-voltage fuses (series)  60947 Low-voltage switchgear and controlgear (series)  60898 Electrical accessories—Circuit- breakers for overcurrent protection for household and similar installations",
  "60898.1": "60898.1 Part 1: Circuit-breakers for a.c. operation (IEC 60898- 1, Ed. 1.2 (2003)  MOD)  61008 Residual current operated circuit- breakers without integral overcurrent protection for household and similar uses (RCCBs)",
  "61008.1": "61008.1 Part 1: General rules (IEC 61008-1, Ed. 3.2 (2013) MOD)   61009 Residual current operated circuit- breakers with integral overcurrent protection for household and similar uses (RCBOs)",
  "61009.1": "61009.1 Part 1: General rules (IEC 61009-1, Ed. 3.2 (2013) MOD)   61439 Low voltage switchgear and c ontrolgear assemblies (series )  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  7  AS/NZS 3010:2017   COPYRIGHT  AS/NZS CISPR  12 Vehicles, boats and internal combustion engines—Radio disturbance characteristics—Limits and methods of measurement for the protection of off- board receivers  14 Electromagnetic compatibility—Requirements for household app liances, electric tools and similar apparatus",
  "14.1": "14.1 Part 1: Emission  IEC   60309 Plugs, socket-outlets and couplers for industrial purpose s (series)  60364 Low-voltage electrical installations (series)  61557 Electrical safety in low voltage distribution systems up to 1 000 V a.c. and 1 500 V d.c.—Equipment for testing, measuring or monitoring of protective measures  61557-8 Part 8: Insulation monito ring devices for IT systems  ISO   8528 Reciprocating internal combus tion engine driven alternating current generating sets  8528-1 Part 1: Application,  ratings and performance  8528-8 Part 8: Requirements and tests for low-power generating sets",
  "1.4.1": "1.4.1   Alternative supply (standby)  A supply system intended to maintain the functioning of an elec trical installation or a part  or parts thereof, in case of inte rruption of the normal supply.",
  "1.4.2": "1.4.2   Changeover devices  Consist of switchgear that provi de load switching between the n ormal supply and the output  of a generating set connected to an electrical installation.  The switchgear is interlocked to  prevent the simultaneous conne ction of the normal supply  and the generating set output.  Typical switchgear arrangement may be a—  (a) one manual switch with multiple contacts, or, two or more manua l switches ganged  together on a common operating shaft;   (b) mechanically interlocked pair of contactors; or   (c) mechanically interlocked pair of circuit-breakers (with or with out overcurrent  protection).  The operation of the changeover device may be manually or electrically operated.",
  "1.4.3": "1.4.3   Closed transition changeover device  A device that permits the transfer of the generating set output to the normal supply without  interruption of the supply to the load when transferring the lo ad from the generator supply  to the normal supply.  The closed transition changeover device operates in a ‘make bef ore break’ mode when the  normal supply and the generating set output are synchronized an d then operates in parallel  only for a very short duration.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  8   COPYRIGHT  The duration of the parallel connection is dependent on the connected load, the type of  loading and the ability of the normal supply to deliver a high step increase in loading.  NOTE: The installation and use of a closed transition changeove r device system in an electrical  installation is subject to a formal agreement with the electric ity distributor.",
  "1.4.4": "1.4.4   Detachable connection  A means of connecting a generating set to an electrical install ation by an assembly  consisting of a plug, flexible cable (or cord) and cord connector.",
  "1.4.5": "1.4.5   Essential services (client)  The portion(s) of an electrical installation associated with li fe preserving equipment, airport  safety equipment, airport traffic control and other electrical equipment the owner/occupier  believes to be essential to the safe operation of the premises.",
  "1.4.6": "1.4.6   Generating set  An alternator, d.c. generator or combination thereof, including  an internal combustion  engine and associated switchg ear and control equipment.",
  "1.4.7": "1.4.7   TN-S earthing system  A system with separate protective earth and neutral conductors f r o m  t h e  t r a n s f o r m e r  o r   generator to the consuming device, which are not connected together at any point after the  neutral and earth connection at t he transformer or generator.",
  "1.4.8": "1.4.8   Normal supply  The source of supply that the electrical installation is suppli ed from under normal  conditions of operation (mains supply) and excludes any alterna tive supply(s).",
  "1.4.9": "1.4.9   Residual current circuit-breaker with overload (RCBO)  A combination of both a residual current circuit-breaker and overload protection provided  by the one device.",
  "1.4.10": "1.4.10   Reduced low voltage (RLV)  A supply voltage giving additional protection against electric shock such as the following:  (a) A single-phase system in which—  (i) the nominal line-to-line voltage  does not exceed 110 V a.c.;   (ii) the nominal line-to-earth voltage does not exceed 55 V a.c.; an d  (iii)  all exposed conductive parts are connected to the protective co nductor.  or  (b) A three-phase system in which—  (i) the nominal line-to-line voltage  does not exceed 110 V a.c.;   (ii) the nominal line-to-earth voltage does not exceed 63.5 V a.c.; and  (iii)  all exposed conductive parts are connected to the protective co nductor.",
  "1.4.11": "1.4.11   Safety services  A system or component that operates to identify an emergency, or is intended to operate  during an emergency, and is p rimarily associated with—  (a) the safety of person evacuating a building;  (b) fire-fighting operations; or  (c) fire suppression systems.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  9  AS/NZS 3010:2017   COPYRIGHT",
  "1.4.12": "1.4.12   Shall  Indicates a statement is mandatory.",
  "1.4.13": "1.4.13   Should  Indicates a recommendation.",
  "1.4.14": "1.4.14   Normative  A term used to describe an element of a Standard to which it is  necessary to conform in  order to be able to claim c onformance with the Standard.  NOTE: Normative elements may  include the following:  (a) Notes to Figures and Tables.   (b) Text.  (c) Appendices.",
  "1.4.15": "1.4.15   Informative  For information and guidance only.  NOTE: Informative elements may include the following:  (a) Notes to clauses.  (b) Appendices.",
  "2.1.1": "2.1.1   Scope of Section  This Section specifies general requirements for the following:  (a) Location.  (b) Mechanical and thermal protection.  (c) Control.  (d) Earthing arrangements.  (e) Electrical installations and connection of generating sets.  Additional requirements, relevant to permanently connected gene rating sets and the use of a  detachable connection for portable generating sets, are given i n Sections 3 and 4  respectively.",
  "2.1.2": "2.1.2   Rating classifications  Generating sets are assigned output power rating classifications based on the following  descriptions of the intended application:  (a) Standby    Maximum output rating is available from the generating set o perating at a  variable load for the duration of  the normal mains power interruption. There is no  sustained overload capability.  (b) Prime    Maximum output rating is availa ble from the generating set o perating at a  variable load for an unlimited time. There is 10% overload capa bility for short  periods and infrequent operations.   (c) Continuous    Maximum output rating is available from the generating set operating at  constant load for an unlimited time. There is no sustained over load capability.  NOTE: Definitions for these ratings are based on Standards such  as AS 4594.1 and ISO 8528-1  but may be further qualified in manufacturer’s recommendations.",
  "2.1.3": "2.1.3   Selection of generating set rating  The selection of the generating set rating is dependent on char acteristics of the connected  load, the alternator type and alternator voltage control system .  Electrical issues that determine the selection of generating se t minimum output rating and  alternator type are as follows:  (a) Issues regarding induction motor loading include:  (i) Load inertia   A high inertia load requires higher starting current and dur ation.  (ii) Type of motor starter used for each motor   Due to the limited maximum  starting current available from a generating set at start up or  when running on  load, this may require use of a reduced current starter.  (iii)  The number of motor(s) starting simultaneously   If a large motor and a number  of smaller motors, starting the large motor first and then arra nging to start the  smaller motors after the large motor is up to full speed adds inertia to the whole  system, reduces the peak kilovolt-ampere required.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  11 AS/NZS 3010:2017   COPYRIGHT  (iv) Maximum voltage dip on the generating set output when motors are starting   If  the voltage dip is excessive and of long duration, this may affect the motor  starting time and the starting current drawn. In some cases, an excessive voltage  dip may release the motor starter contactor(s) and stop or prev ent starting of the  motors.  (b) Non-linear loading, for example uninterruptable power supplies (UPSs), variable  speed drives and rectifiers with a battery connected. The abili ty of a generator to  supply a non-linear load is dependent on the type of equipment being supplied and the  generating set alternator voltage control system.  (c) Load power factor. To ensure stable output voltage control of t he generating set, the  power factor of the operating load should not have a leading va lue when operating  from generating set output.  NOTE: It may be necessary to remove from service any power fact or correction systems when  the electrical installation is being supplied by a generating s et output, this action being to  prevent the electrical installati on power factor having a leadi ng value.   (d) Absorbing regenerative loading. Generating sets have no ability  to absorb any  regenerated energy that may be produced by a load. Accordingly,  w h e r e  a   regenerating load is supplied by a generating set, it is important to ensure that the  regenerative energy is able to be absorbed by other loads supplied by the installation.  The recommendation of the generating set manufacturer or suppli er should be sought when  selecting the generating rating. If available, use of a generat ing set software design package  available from generating set manufacturers is an alternative.",
  "2.1.4": "2.1.4   Generating set system of supply  Where an electrical installation is arranged to operate from mu ltiple sources of supply (such  as occurs when normally supplied by an electricity distributor’ s network, or alternatively  from a generating set output) the system of supply configuratio n connected to the  installation loading shall be t he same system of supply, e.g. M EN, irrespective of the supply  source.",
  "2.3.1": "2.3.1   Protection from mechanical damage  All components of a generating set, including mechanical parts,  fuel systems, wiring,  switches, instruments and controls, shall have adequate protection against mechanical  damage.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  12  COPYRIGHT",
  "2.3.2": "2.3.2   Protection from moving parts  All moving parts of a generating set that may cause injury to p ersons shall be either  positioned or protected by barriers or guards to prevent accide ntal personal contact when  running.   NOTES:    1 Regulatory authorities may have a dditional requirements for the  guarding of machinery.  2 Guidance on the protection of moving parts by guarding is provi ded in AS/NZS 4024.1601.",
  "2.3.3": "2.3.3   Protection against thermal effects  All parts of a generating set that operate at temperatures in e xcess of 120°C shall be  protected by barriers, guards or positioned to prevent accidental personal contact when  running.  NOTE: Guidance on temperature limits for electrical equipment is given in AS/NZS 3000.",
  "2.3.4": "2.3.4   Protection against fuel leakage  Any tanks or filling facilities associated with flammable fuels  shall not be—  (a) installed in the vicinity of high temperature surfaces or equip ment that may emit arcs,  sparks or hot particles; or  (b) located in such a position that spilled or leaking fuel could f all on such high  temperature surfaces or equipment.  NOTES:     1 Attention is drawn to additional requirements that may be speci fied by relevant Regulatory  Authorities. These may include the specific location of the fue l tank(s), the standard used for  the construction of the fuel tank, the need for secondary conta inment of the fuel tank and  associated pipework. Certificati on of the completed fuel system  installation may also be  required.  2 In Australia, refer to AS 1940 for additional requirements affe cting the storage and handling  of flammable and combustible fuels.  3 In New Zealand, the WorkSafe New Zealand (http://www.worksafe.g ovt.nz) has additional  requirements controlling the storage and handling of flammable and combustible fuels  associated with g enerating sets.",
  "2.4.1": "2.4.1   General  Adequate means shall be provided to control—  (a) the sequence of operations necessary for the safe starting, run ning and shutting down  of the generating set;   (b) the voltage and frequency of the generating set output supply;   (c) the speed of the prime mover; and  (d) the load changeover device, if it  is required to be automatical ly operated by contactor  coils, motor(s) or solenoids.",
  "2.4.2": "2.4.2   Prime mover isolating devices  Every prime mover shall be provided with an isolating device, w hich may be an engine  shutdown device, to prevent the starting of the generating set engine when inspection,  repair or maintenance is being carried out.  NOTE: An emergency shutdown devi ce may also be necessary under certain conditions.  Examples include two stroke diesel engines.  NZ A Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  13 AS/NZS 3010:2017   COPYRIGHT",
  "2.4.2.1": "2.4.2.1    Operation  The isolating device when in the ‘off’ or ‘isolated’ position shall prevent the generating set  engine being started by any au tomatic control device or remote control switch.  Where a switch located in a control or starting circuit is used  for this purpose, it shall  disconnect all live conductors of the circuit.  Electronic equipment or devices shall not be used as an isolati on device.",
  "2.4.2.2": "2.4.2.2    Location  The isolating device shall be readily accessible to maintenance  or other authorized  personnel and be—  (a) installed adjacent to or on the generating set so that a person  operating the device has  a clear view of any person working on the machine; and  (b) provided with a means of securing the device in the isolated or  open position that  requires a deliberate action to engage or disengage it.",
  "2.4.3": "2.4.3   Synchronization  Where generating sets are to be synchronized with an electricit y distributor’s network, the  requirements for synchronization shall be obtained from the electricity distributor.  Automatic controls shall be provi ded to ensure that the output voltage and frequency of a  generating set is synchronized with—  (a) the normal supply when connected during transfer or for extende d parallel operation;  or  (b) the output of other generating sets when connected to a multiple generating set  installation.  Synchronization check controls shall be installed for each connection or changeover device  where parallel operation is to occur, to prevent the closure of  the changeover device across  unsynchronized sources of supply.   NOTES:    1 For most installations, a formal agreement with the electricity  distributor is required to permit  operation of a generating set output in parallel with an electr icity distributor’s network.  2 For interlocking, see Clause 2.7.3.",
  "2.4.4": "2.4.4   Starting batteries and battery charging  Batteries associated with prime movers shall be suitable for co ntinuous float charging and  the generating set starter motor current required.  The charging of batteries is to be achieved by one or both of t he following:  (a) The generating set starter battery generator when it is running .  (b) A battery charger operating from a power supply when the genera ting set is running  or when it is stationary.  NOTES:    1 Suitable batteries include the flooded lead-acid and valve regu lated lead-acid sealed types that  are suitable for constant float charging and are able to supply  the engine starter motor current  required.  2 Attention is drawn to the additional requirements for batteries  for emergency supply systems  in other Australian/New Zealand Standards.  3 Attention is drawn to the provis ions of the AS 2676 (series) an d AS 3011 (series) for the  installation and maintenance of batteries.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  14  COPYRIGHT",
  "2.6.1": "2.6.1   General requirements",
  "2.6.1.1": "2.6.1.1    General  The electrical installation shall be in accordance with the app ropriate requirements of  AS/NZS 3000 and the additional re quirements of this Standard.  For installations with multiple generating sets, a generator se t switchboard for each  generating set or a common gene rator switchboard for a group of  generating sets may be  used to group the generating set controls and if required, the changeover device(s) and the  synchronization controls and associated switchgear installed wi thin the common  switchboard.",
  "2.6.1.2": "2.6.1.2    Isolation from the normal supply system  Where the generating set is not the normal supply source, all g enerating sets shall be  connected to the electrical installation in such a manner that they remain isolated from the  normal supply system.  Where it is intended that a generating set will operate in parallel with the normal supply,  formal written approval from the electricity distributor shall be obtained.  NOTE: Requirements for operating a generating set in parallel w ith the normal supply from an  electricity distributor are outside the scope of this Standard.",
  "2.6.1.3": "2.6.1.3    Generating set neutral conductor  A generating set neutral conductor is regarded as a live conduc tor and is required to be  isolated when work is being carried out on the generator alternator.  NOTE: Attention is drawn to the need for the neutral conductor and the neutral pole of any  isolating device or changeover device to have adequate current rating to be in accordance with  AS/NZS 3000 requirements for neutral connections.",
  "2.6.2": "2.6.2   Overcurrent protection  All outgoing circuits from a ge nerating set shall be provided w ith overcurrent protection at  the generating set, except where an alternative position, or th e omission of overcurrent  protective devices, is permitted by AS/NZS 3000.  NOTES:    1 A generating set has limited fault output current available und er fault conditions to operate  overcurrent protection devices, the fault current available bei ng dependant on the alternator  type and the alternator voltage regulator and the mechanical po wer available from the engine  of the generating set.  2 Suitable overcurrent protection devices for alternator or gener ator overcurrent protection are  made by some, but not all manufacturers. Reference to the overc urrent and alternator data is  required for the correct selecti on of a suitable overcurrent pr otective device.  Exception :  Wiring systems connecting generating sets to their associated switchboards need not be  provided with short-circuit protection provided that the wiring systems are installed in such  a way as to reduce the risk of a short-circuit to a minimum. Methods that can achieve this  are wiring systems installed within the same fire-rated generator room (2 h minimum)  utilizing—  (a) insulated and sheathed cable(s) insta lled within a dedicate d conduit duct or pipe;  (b) insulated and sheathed cabl e(s) installed on a dedicated cable tray or an area of a  cable tray segregated from other cables by barriers; or  (c) busway or busbar systems, including joints and switchboard busbars, having  insulation up to the first protective device.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  16  COPYRIGHT",
  "2.6.3": "2.6.3   Generator output isolator  Each generating set shall be provided with an isolating switch operating in all live  conductors, that is installed adjacent to, or on, the generating set so that a person working  on the generating set has a clear view of the isolating device,  and may be combined with  overcurrent protection required by Clause 2.6.3.  Exception 1:  The isolating switch may be located in the generator switchboard.  Exception 2:  Where the generating set is the so le source of supply, the isolating switch shall not operate  in the neutral conductor.",
  "2.7.1": "2.7.1   General   Where a generating set is to operate as an alternative supply ( standby) system in the case of  failure of the normal supply, one or more changeover device sha ll be provided complying  with the requirements of C lauses 2.7.1 to 2.7.13.  Unless otherwise authorized, the changeover device shall be des igned to prevent back feed  of the generating set output into the electricity distributor’s  network.  An inverter or regenerative supply source shall not be connecte d downstream of the  generating set changeover device.  Exception: Where suitable control systems pre vents backfeed to the generator the above  provision does not apply.  NOTES:    1 A generating set cannot absorb energy imported from external so urces into the generating set.  2 Automatic transfer switches in accordance with the relevant req uirements of  AS/NZS 3947.6.1 or AS/NZS 60947.6.1 may conform with these requ irements.",
  "2.7.2": "2.7.2   Operation  The operation of changeover devices  shall be such that the oper ation of the changeover  device does not inadvertently or intentionally breach the integ rity of the neutral conductor  with reference to the MEN connection contained either within th e installation’s main  switchboard or the switchboard to which the generator is connec ted, as follows.  (a) General   Changeover devices shall interrupt one source of supply before connecting  the other source of supply.  Exception: When a closed transition changeover  device is fitted, the interruption of  one source of supply before the connectio n of another source of supply is not  required.  (b) Active  switching    Changeover devices shall ope rate in all active conductors.  (c) Neutral switching    Where the MEN system of earth ing is used, changeover devices   shall not disconnect the neutral conductor of the incoming normal supply at the main  switchboard where the MEN  link is provided.  A switched neutral pole of a mechanical changeover device shall  b r e a k  n o t  b e f o r e ,   and shall make not after, the other poles. If a changeover devi ce pole having an  appropriate short-circuit breaking and making capacity is used as a neutral pole, then  all poles, including the neutral pole, shall operate substantially together.  (d) Earthing conductor switching    Changeover devices shall not operate in any earthing  conductor.  NOTE: Examples of changeover arrangements are shown in Figures 2.1 and 2.2.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  17 AS/NZS 3010:2017   COPYRIGHT",
  "2.7.3": "2.7.3   Interlocking  Changeover devices shall incorporate a mechanical interlock to prevent the simultaneous  connection of the generating set system and the normal supply system, unless the following  exception applies.  NOTE: The use of electrical interlocking in addition to mechani cal interlocking is not a  requirement of this Standard, but is recommended. In the case o f electrically operated changeover  devices, the controls for the generating set and the operation of the changeover device may  provide limited electrical interlocking.   Exception: Where closed transition changeov er arrangements are permitted, then a  changeover device without a mechanical interl ock is allowable. The closed transition  changeover device shall be installed to  the manufacturer’s instructions.   Where the normal supply is from the distributor, the use of a c losed transition changeover  device(s) shall require a formal agreement with that electricit y distributor.",
  "2.7.4": "2.7.4   Changeover device with intermediate ‘off’ position  A permanently connected changeover device having an intermediat e ‘off’ position may be  used in place of a main switch or a switch controlling submains , or final subcircuits or an  individual final subcircuit, suc h that the supply to the load m ay be obtained from either of  two sources and is able to be isolated from both. Such a device  may also be connected as in  Clause 2.7.5 (see Figure 2.1).  A manual transfer switch (MTS) used as a main switch shall have  operating handles or  controls associated with the MTS that enables the main switch t o be manually operated,  single action and mechanical. The MTS shall consist of a handle , lever, push buttons or  similar device.  Electronic touch screens, programmable control systems or the l ike shall not be used as a  means of operating the MTS wh ere used as a main switch.  NOTE: Changeover devices having an intermediate ‘off’ position would typically be used for  manually operated switches only.",
  "2.7.5": "2.7.5   Changeover device without an intermediate ‘off’ positio n  A permanently connected changeover device having no intermediat e ‘off’ position shall be  connected in one of the following ways, such that supply to the  load may be obtained from  either of the two sources of supply:  (a) Supply side of a main switch [see Figure 2.2(a)].  (b) Supply side of switch(es) controlling a submain(s) or final subcircuit(s) [see  Figure 2.2(b)].  (c) Supply side of a switch controlling an individual final subcircuit [see Figure 2.2(c)].  NOTE: Figures 2.1 and 2.2 are only intended to show the locatio n of changeover devices relevant  to other switchgear for the purpose of this Clause.",
  "2.7.6": "2.7.6   Rating  Changeover devices shall have a voltage rating of at least the maximum out-of-phase  voltage between contacts connected to the different sources of supply.  Changeover devices shall have a m inimum current and fault duty rating to cater for the—  (a) maximum load current that is able to flow under both the normal and alternative  supply (generating set) operating conditions; and  (b) maximum fault duty available when operating on the normal or alternative supply.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  18  COPYRIGHT",
  "2.7.7": "2.7.7   Access  Changeover devices should be accessible only to authorized pers ons. If manual operation is  required, the operating means shall be not more than 2 m above the ground, floor or  platform.",
  "2.7.8": "2.7.8   Identification  Changeover devices shall be permanently marked in English to in dicate the purpose and  switching positions of the device. Terminals of changeover devi ces shall also be provided  with marking to indicate the sources of supply.  Where the operation of a changeover device automatically brings  into service an alternative  supply, the purpose of the device shall be permanently marked a ccordingly.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  19 AS/NZS 3010:2017   COPYRIGHT  (c) Ahead of a switch controlling individual circuit Generator main switch and circuit isolating device Generating set Generating set Generating set Normal supply Normal supply Normal supply Grid inverter supply † (when installed) Grid inverter supply † (when installed) Installation main switch* To electrical installation (a) Ahead of general installation main switch MAIN SWITCH BOARD MAIN SWITCH BOARD MAIN SWITCH BOARD Submains or final subcircuits Circuits to be supplied by normal supply only Individual final subcircuits to be supplied by normal supply and generator supply (b) Main switch generator and switch controlling submain(s) or final subcircuits C C G G G Main switch co-generation supply Main switch co-generation supply Main switch* normal supply Main switch* normal supply Centre OFF position Centre OFF position Centre OFF position Manual changeover device Generator main switch and circuit isolating device Manual changeover device Generator main switch and circuit isolating device Manual changeover device * May also be a circuit  breaker † Grid connect inverter  systems such as solar,  wind and/or water   NOTES:   1 These configurations shall be followed to ensure any grid con nect inverter supply is not backfeeding into  generator while generator is  supplying the installation.  2 Manual changeover device is th e generator main switch and can  be the normal supply main switch.  3 See Clause 2.7.2.  FIGURE  2.1   TYPICAL LOCATION OF  MANUAL CHANGEOVER DEVICE WITH  AN  INTERMEDIATE ‘OFF’ POSITION LOCA TED IN THE MAIN SWITCHBOARD  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  20  COPYRIGHT  (c) Ahead of a switch controlling individual circuit Generating set Generating set Generating set Normal supply Normal supply Normal supply Grid inverter supply † (when installed) Grid inverter supply † (when installed) To electrical installation (a) Ahead of general installation main switch MAIN SWITCH BOARD MAIN SWITCH BOARD MAIN SWITCH BOARD Submains or final subcircuits Circuits to be supplied by normal supply only Individual final subcircuits to be supplied by normal supply and generator supply (b) Ahead of switch(es) controling submain(s) or final subcircuits C C G G G Main switch grid inverter supply Main switch co-generation supply Main switch normal supply Main switch normal supply Main switch generator Main switch generator Main switch normal supply Switch* Switch* Automatic changeover device Automatic changeover device Switch* Automatic changeover device * May also be a circuit  breaker or switch fuse † Grid connect inverter  systems such as solar,  wind and/or water NOTE: Co-generation not permitted  with this arrangement   NOTES:   1 These configurations shall be followed to ensure any grid con nect inverter supply is not backfeeding into  generator while generator is  supplying the installation.  2 See Clause 2.7.2.  FIGURE  2.2   TYPICAL LOCATION OF AUTOMATIC CHANGEOVER DEVICE WITHOUT  AN INTERMEDIATE ‘OFF’ POSITION LOCATED WITHIN THE MAIN SWITCHBO ARD  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  21 AS/NZS 3010:2017   COPYRIGHT",
  "2.7.9": "2.7.9   Automatic changeover to normal supply  Where an automatic changeover de vice is provided, it shall operate to transfer loads back to  the normal supply after the voltage and frequency of the normal supply have been  maintained at normal levels on all phases for a specified period, except that in the case of  failure of the generating set supply, the transfer shall occur without delay, provided a  normal supply is available.  An automatic transfer switch (ATS) used as a main switch shall have operating handles or  controls associated with the ATS that enables the main switch t o be manually operated,  single action, mechanical and shall consist of a handle, lever,  push buttons or similar  device.   Electronic touch screens, programmable control systems or the l ike shall not be used as a  means of operating the ATS wh ere used as a main switch.  NOTES:    1 Where the automatic changeover device provides the control for a high reliability site, the  transfer of the loading from the  generator supply to normal supply may be prevented until a  switching break in the supply to the load can be arranged to su it operational requirements,  except in the case of the failure  of the generating set supply,  the transfer should occur without  delay, provided a normal supply is available.  2 The specified period is usually  controlled by an adjustable del ay of between 1 min and  30 min—typically the del ay selected is 15 min.  3 A further delay period prior to shutting down the generating set engine may be necessary to  allow adequate cool-down of particular engines types.",
  "2.7.10": "2.7.10   Changeover device in the generator neutral  Requirements for changeover device in the generator neutral sha ll conform with  Clause 2.7.10.1 for Australia and Clause 2.7.10.2 for New Zeala nd.",
  "2.7.10.1": "2.7.10.1    In Australia  In Australia only, a changeover device switching contact in the  generator set neutral  connection is not the recommended connection method for generat ing sets that are  permanently connected to any switchboard. However, when a changeover device is fitted in  a generating neutral connection, the neutral connection shall n ot disconnect the connection  to the main switchboard MEN link connection (see Figures 2.3 to  2.9).",
  "2.7.10.2": "2.7.10.2    In New Zealand  In New Zealand only, the following arrangements apply:  (a) Switchboards with a MEN link fitted   A changeover device with a neutral switching  contact in the generator set neutral shall not be provided for generating sets that are  permanently connected to a switchboard containing a MEN link.  The connections for generating sets that are able to be permane ntly connected to a  switchboard with a MEN link fitted are detailed in Figures 2.3 and 2.4.  (b) Switchboards with no MEN link fitted    If it is not practical or feasible to connect a  generating set to a switchboard with a MEN link fitted due to s ite conditions or  layout, the generating set output  permanent connection shall be  made to a  switchboard that does not contain a MEN link or connection. The connections  required are detailed in Figures 2.15 and 2.16.  NOTES:    1 The generating set output neutral connection arrangements conve rt the system of supply of  the generating set output, IT system of supply, to one that is the same system of supply when  the essential load when operating from a normal power supply, M EN.   NZ A Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  22  COPYRIGHT  2 A four pole/four pole changeover device is used to switch the n eutral connection of the  normal supply section of the changeover device in the neutral c onnections to the essential  load, the neutral contact being closed when the normal supply i s connected to the essential  load of the switchboard.  3 The generator set output section of the changeover device neutr al connection is used to switch  the generating set output neutral, the contact being closed whe n the generating set is  supplying the essential loading connected to that switchboard. This provides a local MEN  connection to the switchboard when the generating set is supply ing the connected load.  4 A 100 mA RCD should be provided in the generating set active an d neutral connections to the  switchboard to provide earth fault and earth potential rise (EPR) protection for the generating  set output.  5 The generator output neutral connection is connected to the sup ply system IT to MEN  conversion neutral and earth busbars linked together, the earth  b u s b a r  i s  c o n n e c t e d  t o  t h e   generating set earth electrode and the switchboard earth bar to  provide a MEN configuration.  The neutral and earth busbars used for system of supply convers ion are to be permanently  labelled ‘ For generating set connections only ’. The connection of the distribution switchboard  submain or final subcircuit neutral and earth connections is no t permitted.  This method of connection generating sets to an electrical inst allation is not recommended  if connection to a switchboard containing a MEN link is practical, see Figures 2.3, 2.4, 2.7  and 2.9.",
  "2.7.11": "2.7.11   Three pole/three po le changeover devices  A three pole/three pole changeover device may be used to connec t a generating set at a  switchboard with a MEN link.  Where a three pole/three pole or a single pole changeover devic e is used, the generating set  neutral and earth conductors sha ll be connected as shown in Fig ures 2.10 to 2.16.",
  "2.7.12": "2.7.12   Three pole/four pole changeover devices  A three pole/four pole changeover device may be used to connect  a generating set at a  switchboard without a MEN link fitted.  Where a three pole/four pole changeover device is used, the generating set neutral  conductor may be switched.  NOTE: This changeover device configuration should not be used f or new installations, but may  exist in existing generating set installations.",
  "2.7.13": "2.7.13   Four pole/four pole changeover device  When a four pole/four pole changeover device is used in a main switchboard, the normal  supply neutral conductor to the s witchboard shall not be switched prior to MEN link.  A four pole/four pole changeover device may be used to connect a generating set at a  switchboard without a MEN link fitted (distribution switchboard ).  Where a four pole/four pole ch angeover device is used, the inco ming submain and  generating set neutral conductors may be switched.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  23 AS/NZS 3010:2017   COPYRIGHT  TABLE   2.1  KEY TO SYMBOLS IN FIGURES  Symbol Description EE or Earth electrode E Earth conductor E-BAR Earth bar L1, L2, L3 Active (phase) conductors N Neutral conductor N-BAR Neutral bar Interlock MTS Manual transfer switch Termination Multiphase conductors Contact Contact - load break Circuit breaker Chassis or frame Contact - contactor Generator C Co-generation = solar, wind, water Isolating switch G   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  24  COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L2L1NE L3 L2L1N L3 N N Automatic changeover device † GENERATING SET Generator isolating device* N - BAR E - BAR MEN link No neutral earth connection at generator set N N E Main switch generator * May include overcurrent protection † Synchronisation and control equipment not shown MAIN SWITCHBOARD E E E L2 L3 L1 EE     NOTE:  See Clause 2.7.11.  FIGURE  2.3   TYPICAL THREE POLE/THREE POLE AUTOMATIC CHANGEOVER ARRANGEMENT FOR A SINGLE   THREE-PHASE GENERATING SET WITH FOUR POLE LOCAL ISOLATION PERMA NENTLY INSTALLED AS AN   ALTERNATIVE SUPPLY CONNECTED TO  A SWITCHBOARD WITH A MEN LINK I NSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  25 AS/NZS 3010:2017   COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L1NE L1N N Automatic changeover device † GENERATING SET Generator isolating device* N - BAR E - BAR MEN link MAIN SWITCHBOARD Main switch generator * May include overcurrent protection † Synchronisation and control equipment not shown No neutral earth connection at generator set E E E N N N L1 L1 E EE     NOTE:  See Clause 2.7.11.  FIGURE  2.4   TYPICAL ONE POLE/ON E POLE AUTOMATIC CHANGEOVER AR RANGEMENT FOR A SINGLE-PHASE GENERATING  SET WITH TWO POLE LOCAL ISOLATION PERMANENTLY INSTALLED AS AN A LTERNATIVE SUPPLY, CONNECTED TO A  SWITCHBOARD WITH A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  26  COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L2L1NE L3 L2L1N L3 N N Automatic changeover device † GENERATING SET Generator isolating device* N - BAR E - BAR N - BAR E - BAR MEN link MAIN SWITCHBOARD DISTRIBUTION SWITCHBOARD Main switch generator * May include overcurrent protection † Synchronisation and control equipment not shown E E E E N N N Main isolating device distribution board* E EE L2 L1 L3 Australia ONLY No neutral earth connection at generator set     NOTE:  See Clause 2.7.11.  FIGURE  2.5   TYPICAL THREE POLE/THREE POLE AUTOMATIC CHANGEOVE R ARRANGEMENT FOR A SINGLE THREE-PHASE  GENERATING SET WITH FOUR POLE LOC AL ISOLATION PERMANENTLY INSTA LLED AS AN ALTERNATIVE SUPPLY, CONNECTED  TO A SWITCHBOARD WITHOU T A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  27 AS/NZS 3010:2017   COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L1N E L1N NN Automatic changeover device † GENERATING SET Generator isolating device* N - BAR E - BAR MEN link MAIN SWITCHBOARD Main switch generator * May include overcurrent protection † Synchronisation and control equipment not shown No neutral earth connection at generator set DISTRIBUTION BOARD N - BAR E - BAR N N EE Main isolating device distribution board* EE L1 Australia ONLY     NOTE:  See Clause 2.7.11.  FIGURE  2.6   TYPICAL ONE POLE/ON E POLE AUTOMATIC CHANGEOVER AR RANGEMENT FOR A SINGLE-PHASE GENERATING  SET WITH TWO POLE LOCAL ISOLATION PERMANENTLY INSTALLED AS AN A LTERNATIVE SUPPLY, CONNECTED TO A  SWITCHBOARD WITHOUT  A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  28  COPYRIGHT  Normal supply via main switch(es) and/or overcurrent protection To load via protection devices L2L1NEL 3 L2L1N L3 Automatic changeover device † N - BAR E - BAR MEN link N L2 L1L3 N L3 L2 L1 L3 L2 L1 L3 L2 L1 GENERATOR SWITCHBOARD GENERATORS Generator supply overload protection (Where required) E MAIN SWITCHBOARD No neutral earth connection at generator sets * May include overcurrent protection where installed either at Generator, Generator Switchboard or both Main switch generator N N E E E Generator isolating device* E Generator isolating device* Generator isolating device* N E N E With or without dividing wall GENERATOR ROOM(S)     NOTE:  See Clause 2.7.11.  FIGURE  2.7   TYPICAL THREE POLE/THREE POLE AUTOMATIC CHANGEOVE R ARRANGEMENT FOR MULTIPLE THREE-PHASE  GENERATOR SET INSTALLATION WITH FOUR POLE LOCAL ISOLATION PERMA NENTLY INSTALLED AS AN ALTERNATIVE SUPPLY  CONNECTED TO A MAIN SWITCHBOA RD WITH A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  29 AS/NZS 3010:2017   COPYRIGHT  To load via protection devices L2L1NE L3 Automatic changeover device † L2 L1L3 N L3 L2 L1 L3 L2 L1 L3 L2 L1 GENERATOR SWITCHBOARD GENERATORS Generator supply overload protection (Where required) E MAIN SWITCHBOARD Normal supply via main switch(es) and/or overcurrent protection L2L1N L3 N - BAR E - BAR MEN link DISTRIBUTION SWITCHBOARD N - BAR E - BAR Generator isolating device* Main switch generator * May include overcurrent protection where installed either at Generator, Generator Switchboard or both † Synchronisation and control equipment not shown N N N E E E EE Main isolation switch distribution board* Generator isolating device* Generator isolating device* N E N E N E GENERATOR ROOM(S) With or without dividing wall No neutral earth connection at generator sets Australia ONLY     NOTE:  See Clause 2.7.11.  FIGURE  2.8   TYPICAL THREE POLE/THREE POLE AUTOMATIC CHANGEOVE R ARRANGEMENT FOR MU LTIPLE THREE-PHASE  GENERATOR SET INSTALLATION WITH FOUR POLE LOCAL ISOLATION PERMA NENTLY INSTALLED AS AN ALTERNATIVE SUPPLY  CONNECTED TO A DISTRIBUTION SWI TCHBOARD WITHOUT A MEN LINK INST ALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  30  COPYRIGHT  N L3 L2 L1 GENERATORSMAIN SWITCHBOARD Normal supply via main switch(es) and/or overcurrent protection L2L1N L3 N - BAR E - BAR MEN link DISTRIBUTION BOARD 1 N L3 L2 L1 * May include overcurrent protection where installed † Synchronisation and control equipment not shown Main switch generator Automatic changeover device † E To load via protection devices L2L1NEL 3 No neutral earth connection at generator sets Main isolating device distribution board Main isolating device distribution board Main isolating device distribution board Generator isolating device* EE N L3 L2 L1 DISTRIBUTION BOARD 2 N L3 L2 L1 Main switch generator Automatic changeover device † E To load via protection devices L2L1NEL 3 No neutral earth connection at generator sets Generator isolating device* N L3 L2 L1 DISTRIBUTION BOARD 3 N L3 L2 L1 Main switch generator Automatic changeover device † E To load via protection devices L2L1NEL 3 No neutral earth connection at generator sets Generator isolating device*     NOTE:  See Clause 2.7.11.  FIGURE  2.9   TYPICAL THREE POLE/THREE POLE AUTOMATIC CHANGEOVE R ARRANGEMENT FOR MULTIPLE   THREE-PHASE GENERATOR SET INSTALLATION WITH FOUR POLE LOCAL ISOLATION PERMANENTLY INSTALLED AS AN  ALTERNATIVE SUPPLY CONNECTED TO  A SEPARATE DISTRIBUTION SWITCHB OARD WITHOUT A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  31 AS/NZS 3010:2017   COPYRIGHT",
  "2.8.1": "2.8.1   General  The generating set earthing and earth bonding arrangements shal l be as follows for   neutral-earth connected generators (for other earthing systems,  see Clause 2.11.3):  (a) The neutral to frame link in the generating set shall be permanently removed.  (b) An earth cable in accordance with AS/NZS 3000 requirements for the main earthing  conductor shall be installed from the electrical installation t o the generating set and  connected to the generating set earth bonding connection and th e main switchboard  earth bar.  (c) An electrical installation earth electrode and main earthing conductor in accordance  with AS/NZS 3000 requirements shall be provided for the electrical installation and  connected to the main switchboard.",
  "2.8.2": "2.8.2   Earthing and bonding alterations to existing installati ons  All alterations to an existing ge nerator installation shall be as provided in the requirements  of alterations and repairs (see Clause 1.9.3) of AS/NZS 3000, u nless exceptions 1, 2 or 3  applies.  Exception 1:   Neutral-earth connection located within generators.  Where an existing electrical installation is supplied by more than one generator in parallel  and the installation has neutral-earth connections existing within the generators and not at  the main switchboard location.  Provided the alteration work is limited to no more than 35% of the total generation  capacity, it is permissible to upgrade the generator installati on (carry out the alterations)  maintaining the neutral-earth connection within the generators and a permanent label  indicating any neutral-earth link in place shall be fixed to ea ch switchboard supplied by the  generators in the following form:  CAUTION: NEUTRAL-EARTH CONNECTIONS ARE LOCATED AT THE  GENERATING SETS  Exception 2: Existing installations with mo re than two generators connected in parallel  utilizing three pole/four pole changeover devices.  Exception 3: Where an existing electrical installation is supplied by more than one  generator in parallel and the installation has a three pole/four pole changeover device and  no neutral or earthing conductors are connected  in parallel the existing three pole/four  pole changeover device can remain in service.  Where an existing electrical installation is supplied by more t han one generator connected  in parallel and the electrical installation has the neutral-ear th connection existing within the  generators and not at the main switchboard location.  Provided the alteration is limite d to no more than 35% of the existing generation capacity, it  is permissible to upgrade supply (carry out the alteration or additions) with the neutral-earth  connection remaining within the generating sets.  A permanent label indicating the neutral-earth arrangements in use shall be placed on each  switchboard supplied by the generators in the following form:  CAUTION: INSTALLATION NEUTRAL -EARTH CONNECTION LOCATED  WITHIN GENERATING SETS  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  32  COPYRIGHT",
  "2.8.3": "2.8.3   Generating set bonding system  The following parts of the generating set shall be electrically  bonded together to form the  generating set bonding system:  (a) The ‘star’ point or neutral connection of a multiple-phase output isolated winding.  (b) One output connection of a singl e-phase isolated output winding .   The output winding connection to the generating set bonding sys tem shall be by  means of a permanently labelled removable link mounted adjacent to the generating  set a.c. output connections.  (c) The engine frame.  (d) The generator or alternator frame. All exposed conductive parts  enclosing electrical  equipment or wiring.  (e) The ‘earth’ terminals of any socket outlets fitted.  (f) The frame connection (marked    or ‘ FRAME ’).  When the generating set is permanently connected to a switchboa rd by installation wiring in  an electrical installation, the generating set neutral to frame  link shall be permanently  removed.",
  "2.8.4": "2.8.4   Generating set windings",
  "2.8.4.1": "2.8.4.1    Multi-phase and single-phase three wire centre-tapped generating sets  The following points of the generating set windings shall be co nnected to the electrical  installation switchboard neutral bar:  (a) The neutral or star point of a three-phase winding.  (b) The neutral point of a two-phase winding.  No point of the output winding shall be connected to the genera ting set bonding system.  Exception:   In New Zealand only, when the generating set output is connected by  installation wiring to a switchboard without a MEN link, the generating set output neutral  connection is to be made to the neutral bus bar used for the system of supply conversion.",
  "2.8.4.2": "2.8.4.2    Single-phase portable generating sets  One output connection of a single-phase isolated output winding  shall be connected to the  electrical installation switchboard neutral bar.  Exception:   In New Zealand only, when the generating set output is connected by  installation wiring to a switchboard without a MEN link, the generating set output neutral  connection is to be made to the neutral bus bar used for the system of supply conversion.  The generating set [see Clause 2.5(b)] shall be earthed by connection to the earthing system  of the electrical installation.  Connection of the generating set to the mass of earth shall not  b e  m a d e  b y  m e a n s  o f  a   separate earth electrode.  Appendix A details the reasons that connection of the generator  set bonding system of  portable generating sets to the general mass of earth is not re quired or recommended.  NZ NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  33 AS/NZS 3010:2017   COPYRIGHT",
  "2.8.5": "2.8.5   Connection of generating set windings  The following points, as applicable, shall be connected to the relevant neutral conductor of  the electrical installation and not be directly connected to th e generating set bonding  system:  (a) The generating set winding connec tions referred to in Clause 2. 5(b).  (b) One side of an otherwise unpolarized single-phase generating se t winding.  Alternatively, the generating set windings referred to in Items  (a) and (b) above may be  arranged through a protection system in a manner that ensures t he disconnection of the  electrical installation in the event of an earth fault.",
  "2.8.6": "2.8.6   Arrangement of equipment  Switchboards for the control of a generating set or its outgoing circuits, in addition to  conforming with AS/NZS 3000, sha ll be equipped with such instru ments, relays and control  equipment as may be necessary for safe and correct operation. A ll starting and shutdown  devices, isolating switches, changeover devices and other devic es that may require reading  or adjustment, shall be accessible.",
  "2.8.7": "2.8.7   Rating  Switches, circuit-breakers, fuses, contactors, reclosers and ot her switchgear shall be  selected with appropriate regard to the rated values of voltage , service duty and continuous  and in-rush current of the circuits on which they are installed .  All protective devices shall be capable of safely interrupting the prospective short-circuit  current at the point where the devices are installed.  All switchgear used to break load current shall be marked with the rated breaking and  making current capacity of the device. Switches that are not ra ted to interrupt the full-load  current of the circuit shall be interlocked with load-breaking devices to prevent the  possibility of the switches being opened under load.",
  "2.8.8": "2.8.8   Provisions for securing isolating devices  Where isolating devices are installed, means shall be provided to secure the device in the  open position.  Where the accidental opening of devices may cause a hazard, sim ilar means of securing are  recommended for retaining the de vice in the closed position.  NOTE: This recommendation may apply to manual changeover switch es or some switches  associated with the security o f supply to safety services.",
  "2.8.9": "2.8.9   Indication of switch position  Where any equipment or circuit that operates at greater than ex tra low voltage could be  required to be worked on while activated, an isolating switch s hall be provided in each  unearthed conductor supplying the equipment. Such switches shal l be of the visible break  type or be marked or provided with a device to indicate clearly whether the switch is open  or closed. In addition means sha ll be provided for securing the  device in the open position.  Where withdrawable switchgear equipment is used, the fully with drawn position of the  switchgear, where clearly indicated, constitutes a visible brea k for this purpose.  NOTE: Provision of protective earthing of equipment during repa ir or maintenance is  recommended.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  34  COPYRIGHT",
  "2.11.1": "2.11.1   Generating set  The generating set and associated equipment shall be installed to the applicable provisions  of this Standard.  Attention is drawn to the additi onal requirements for a generating set that is providing a  normal supply and is continuously running for extended periods.  The reduced intervals of  engine maintenance, increased fuel storage supply arrangements,  high exhaust piping  temperatures and enhanced engine  cooling arrangements are typic al additional requirements  to cater for extended peri ods of continuous operation.",
  "2.11.2": "2.11.2   System of supply for generating set and main switchboa rd",
  "2.11.2.1": "2.11.2.1    Overcurrent protection  The generating set shall be provi ded with output overcurrent pr otection in accordance with  AS/NZS 3000 and Clause 2.6.3 of this Standard.",
  "2.11.2.2": "2.11.2.2    Connection to the electrical installation  The connection of the generating set output to the electrical installation shall be by the use  of the electrical installation c onsumer mains installed to AS/N ZS 3000 requirements from  the generating set output terminal s to the electrical installat ion main switchboard.",
  "2.11.2.3": "2.11.2.3    Earthing and equipotential bond connections  The generating set output shall be arranged as an isolated supp ly and any neutral to earth  bonding within the generating set is to be permanently removed.   A protective earthing conductor shall be run from the generatin g set frame connection to the  main earthing terminal/connection or bar of the electrical inst allation main switchboard.  The protective earthing conductor size shall be in accordance with Section 5 requirements  of AS/NZS 3000.  The neutral to earth connection shall be made in the electrical  installation at the main  switchboard.  An earthing conductor, deemed to be the main earthing conductor , shall be taken from the  main earthing terminal/connection or bar in the main switchboar d to an earth electrode in  accordance with Section 5 requirements of AS/NZS 3000.  NOTE: The main switchboard may form part of the generating set.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  35 AS/NZS 3010:2017   COPYRIGHT",
  "2.11.2.4": "2.11.2.4    Unsuitable electrical equipment  A grid-connected inverter or re-generative load is not suitable  for connection to this type of  electrical installation.  NOTE: A generating set output cannot be identified as a grid su pply, nor can it absorb the energy  exported from a grid-connected inverter or regenerative load.",
  "2.11.2.5": "2.11.2.5    Connection details  The supply and protective earthing connections are shown in Fig ure 2.10.",
  "2.11.3": "2.11.3   Other systems of supply  Alternative systems of supply are permitted, and shall be in ac cordance with AS/NZS 3000.  NOTE: The detailed requirements for other systems of supply are  outside the scope of this  Standard.",
  "2.12.1": "2.12.1   General  The generating set and associated switchboards shall be installed to the applicable  provisions of this Standard.  NOTE: Typical applications being for construction and demolitio n sites (refer to AS/NZS 3012),  and shows and carnivals (refer to AS/NZS 3002).",
  "2.12.2": "2.12.2   System of supply for the generating set and switchboar ds",
  "2.12.2.1": "2.12.2.1    Overcurrent protection  The generating set shall be provi ded with output overcurrent pr otection on the generating  set in accordance with AS/NZS 3000 and Clause 2.6.3 of this Sta ndard.",
  "2.12.2.2": "2.12.2.2    Connection to switchboards  The requirements for connections  to switchboards are shown in F igures 2.3 to 2.9 and  Figures 2.13, 2.15 and 2.16.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  36  COPYRIGHT  To load via protection devices L2L1 L3 N N GENERATING SET Generator overcurrent protection device* N - BAR E - BAR Earth neutral connection No neutral earth bond at generator set E MAIN SWITCHBOARD L2 L1 L3 EE Main switch   NOTE:  See Clause 2.11.1.2.  FIGURE  2.10   TYPICAL ARRANGEM ENT FOR A SINGLE T HREE-PHASE GEN ERATING  SET INSTALLED AS SITE SUPPLY TO THE MAIN SWITCHBOARD WITH A MEN  LINK  INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  37 AS/NZS 3010:2017   COPYRIGHT  N - BAR E-BAR Generator MEN N N L3 L2 L1 L3 L2 L1 L3 L2 L1 N E To remote distribution board L3 L2 L1 N E To remote distribution board L3 L2 L1 N E EE To remote distribution board GENERATOR WITH INTEGRAL MAIN SWITCHBOARD MAIN SWITCH No neutral earth connection permitted at the generator set.   NOTE:  See Clause 2.11.1.2.  FIGURE  2.11   TYPICAL ARRANGEM ENT FOR A SINGLE T HREE-PHASE GEN ERATING  SET AND INTEGRAL SWITCHBOARD IN STALLED AS SITE SU PPLY WITH SUBM AINS  TO OTHER SITE STRUCTURES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  38  COPYRIGHT  N - BAR E-BAR MEN link* N E L3 L2 L1 L3 L2 L1 N L3 L2 L1 N E To remote distribution board L3 L2 L1 N E To remote distribution board L3 L2 L1 N E EE To remote distribution board MAIN SWITCHBOARD MAIN SWITCH GENERATOR Generator overcurrent protectiondevice* No neutral earth connection at generator set     NOTE:  See Clause 2.11.1.2.  FIGURE  2.12   TYPICAL ARRANGEM ENT FOR A SINGLE T HREE-PHASE GENERATING SET INSTALLED AS SITE SUPPLY TO  AN EXTERNAL MAIN SWITCHBOARD WI TH A MEN LINK INST ALLED AND SUBM AINS TO OTHER SITE STRUCTURES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  39 AS/NZS 3010:2017   COPYRIGHT  To load via protection devices L2L1NE L3 L2L1N L3 NN Automatic changeover device † GENERATING SET Generator isolating device* N - BAR E - BAR N - BAR E - BAR MAIN SWITCHBOARD TN-S SUPPLY DISTRIBUTION SWITCHBOARD Earth electrode Main switch generator † Synchronisation and control equipment not shown E E E E N N Main isolating device distribution board* E EE L2 L1 L3 Normal supply via main switch(es) and/or overcurrent protection Australia ONLY       FIGURE  2.13   TYPICAL FOUR POLE/FOUR POLE AU TOMATIC CHANGEOVER  ARRANGEMENT FOR A SINGLE THREE-PHASE  GENERATING SET WITH FOUR POLE LOC AL ISOLATION PERMANENTLY INSTA LLED AS AN ALTERNATIVE SUPPL Y, CONNECTED TO A  SWITCHBOARD WITH A TN-S EARTHING SYSTEM  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  40  COPYRIGHT  NOTES TO FIGURE 2.13:  1 For guidance on the sizing of  the neutral and earth conductor s, see Clause 2.11.  2 The generator and normal supply should both be isolated when undertaking repair or maintenance of the  main switchboard.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  41 AS/NZS 3010:2017   COPYRIGHT  N - BAR E-BAR N L3 L2 L1 L3 L2 L1 L1 L2 L3 N N L3 L2 L1 N E E To remote distribution board L3 L2 L1 N E To remote distribution board L3 L2 L1 N E To remote distribution board GENERATOR WITH INTEGRAL MAIN SWITCHBOARD Main switch Main switch STANDBY GENERATOR Generator isolating device* Note: Neutral earth connection at generator set Changeover device † Neutral-earth bond at generator set Generator     NOTES:   1 See Clause 2.12.2.  2 For this application, earth el ectrodes are not r equired as th ey serve no benefit. See Appendix A.  FIGURE  2.14   TYPICAL FOUR POLE/FOUR POLE AU TOMATIC CHANGEOVER ARRANGEMENT FOR A PRIMARY   THREE-PHASE GENERATING SET IN STALLED AS SITE SUPPLY AND A SECONDARY THREE-PHASE GENERATING SET  INSTALLED AS ALTERNATIVE SUPPLY A TN-S EARTHING SYSTEM  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  42  COPYRIGHT  EE EE Generating set NL 1 L 2 L 3 NL 1 L 2 L 3 N E E E N N L1 L2 L3 NL 1 L 2 L 3 4 Pole/4 Pole changeover device N - BAR N - BAR E - BAR E - BAR MEN link MAIN SWITCHBOARD DISTRIBUTION SWITCHBOARD Incoming mains isolator TN-C-S system of supply from main switchboard Normal supply via main switch and overcurrent protection Main switchboard TN-C incoming with TN-C to TN-C-S conversion 100 mA RCD* Generating set overcurrent/isolator IT system of supply Generating set N to frame link is not fitted This area for IT to TN-C-S system of supply conversion Protective earths to essential and normal supply load final sub circuits To normal supply only load via protective devices TN-C-S system of supply To essential load via protective devices TN-C-S system of supply New Zealand ONLY *Provides protection against earth fault and EPR    NOTES:   1 Provides protection agains t earth fault and EPR.  2 See Clause 2.7.10.2.  FIGURE  2.15   TYPICAL FOUR POLE/FOUR POLE CHANGEOVER ARRANGEME NT FOR A THREE-PHASE GENERATOR W ITHOUT N TO  FRAME LINK FITTED WITH FOUR POLE ISOLATOR PERMANENTLY AS AN ALT ERNATIVE SUPPLY, CONNECTED TO A SWITCHBOARD  WITHOUT A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  43 AS/NZS 3010:2017   COPYRIGHT L1 N E N Incoming mains isolatorN N E EE N - BAR E - BAR MEN link EE Generating set Normal supply via main switch and overcurrent protection MAIN SWITCHBOARD DISTRIBUTION SWITCHBOARD 2 Pole/2 Pole changeover device 100 mA RCD* Generating set overcurrent/isolator TN-C-S system of supply from main switchboard N - BAR E - BAR NL 1 NL 1 NL 1 Generating set N to frame link is not fitted This area for IT to TN-C-S system of supply conversion Main switchboard TN-C incoming with TN-C to TN-C-S conversion Protective earths to essential and normal supply load final sub circuits To normal supply only load via protective devices TN-C-S system of supply To essential load via protective devices TN-C-S system of supply New Zealand ONLY *Provides protection against earth fault and EPR      NZ NOTES:   1 Provides protection agains t earth fault and EPR.  2 See Clause 2.7.10.2.  FIGURE  2.16   TYPICAL TWO POLE/TWO  POLE CHANGEOVER ARRANGEMENT  FOR A SINGLE-PHASE GE NERATOR WITHOUT  N TO FRAME LINK FITTED WITH T WO POLE ISOLATOR PERMANENTLY AS AN ALTERNATIVE SUPPLY, CONNECTED TO A  SWITCHBOARD WITHOUT  A MEN LINK INSTALLED  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  44  COPYRIGHT  SECTION 3   ADDITIONAL REQUIREMENTS  FOR PERMANENTLY CONNECTED  GENERATING SETS",
  "3.2.1": "3.2.1   General  Permanently connected generating sets shall be located and inst alled in accordance with  Clause 2.2 and, in addition, means shall be provided to prevent  the entrance of, or  interference by, unauthorized persons by the erection of suitab le fences, screens, partitions,  walls or similar barriers. Such barriers shall not impede the a ccess required for authorized  persons for maintenance, testing or inspection as provided in Clause 3.2.2.  This shall not preclude the installation of a generating set in an enclosure or room with  other equipment for which access is similarly restricted to aut horized persons.",
  "3.2.2": "3.2.2   Access space for generating sets  Adequate space shall be provided around a generating set on all  sides where persons are to  pass, to enable all equipment to be safely and effectively repaired, operated and adjusted.  NOTE: Attention is drawn to additional requirements that may be  specified by relevant regulatory  authorities.",
  "3.2.3": "3.2.3   Exit from generating set area",
  "3.2.3.1": "3.2.3.1    General  Where a permanently connected generating set is installed in a room or enclosure the  requirements of Clauses 3.2.3.2 to 3.2.3.4 shall apply.",
  "3.2.3.2": "3.2.3.2    Number of openings  At least one door or opening shall be provided to enable a pers on to leave the vicinity of a  generating set. However, where any generating set—  (a) has a rated output exceeding 100 kVA; or  (b) is driven by a petrol engine,   not less than two openings or door ways, spaced well apart, shall be provided.",
  "3.2.3.3": "3.2.3.3    Opening and locking of doors  All barriers or doors provided to prevent the entry of unauthor ized persons to any room or  enclosure containing a generating set shall open outwards away from the generating set  without the use, on the generating set side of the door, of a key or tool.",
  "3.2.3.4": "3.2.3.4    Size of doors and openings  Doors and openings providing entrance to and exit from a genera ting set area shall have a  height of not less than 2.2 m from the floor or walked on surfa ce and a width of not less  than 0.9 m.  NOTE: Larger openings may be required to enable entry of a full y assembled generating set.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  45 AS/NZS 3010:2017   COPYRIGHT",
  "3.2.4": "3.2.4   Ventilation  Any room or enclosure containing a permanently connected genera ting set shall have  adequate ventilation to provide—  (a) removal of engine combustion air, removal of heat radiated from the engine,  generating set mounted radiator, exhaust system and output gene rator to the  generating set manufacturer’s i nstructions or recommendations; and  (b) removal of dangerous concentrati ons of toxic and explosive fume s and gasses.  NOTE: AS 1668.2 gives guidance fo r contaminant control in build ings using ventilation.  In rooms or enclosures that require the use of electric fan(s) for provision of cooling air for  a generating set, provide for the  continued operation of such f an(s) immediately after the  shutdown of engine to remove the  heat radiating from the engine  and exhaust system until  the room temperature is equa l to the ambient conditions.",
  "3.2.5": "3.2.5   Noise containment   Any room or enclosure containing a permanently connected generating set, and the exhaust  system, shall be arranged so that when the generating set is ru nning at a maximum loading,  the noise emitted shall be less than the maximum limits specifi ed by any relevant authority",
  "3.2.6": "3.2.6   Lighting   Adequate lighting shall be provided to enable—  (a) all equipment and controls to be effectively and safely operate d; and  (b) in the case of generator set failure, adequate lighting shall b e provided to allow  repairs to be made to any equipment requiring repair.",
  "3.3.1": "3.3.1   General  In addition to conforming with the general requirements of Clause 2.5, the requirements of  Clauses 3.3.2 and 3.3.3 shall a pply to permanently connected ge nerating sets.",
  "3.3.2": "3.3.2   Walked on surfaces  Walked on surfaces that are located above exposed live parts sh all have no openings.  Kickboards at least 0.15 m high and handrails shall be provided at all edges of the walked  on surfaces.",
  "3.3.3": "3.3.3   Outdoor locations  Exposed live parts in outdoor locations shall be enclosed by se curity fences or walls not  less than 2.5 m high and provided with danger notices in accord ance with the provisions for  outdoor substations in AS 1319.",
  "3.5.1": "3.5.1   General  Generating sets providing supply to safety and essential services to ensure the continuation  of the electrical supply to safety and essential services such as fire and smoke control  equipment, evacuation equipment and lifts, as outlined in AS/NZ S 3000, life preserving  equipment, airport safety equipm ent, airport traffic control an d other essential services shall  conform with the additional requirements of Clauses 3.5.2 to 3. 5.7 and AS/NZS 3000.  NOTE: See Figures 3.1 to 3.4 for typical arrangements.",
  "3.5.2": "3.5.2   Type   The generating set supplying the safety and essential services,  its auxiliaries and associated  equipment shall conform with the following requirements:  (a) Where required, be capable of maintaining an adequate supply fo r a period sufficient  to enable the evacuation of all persons to an area of safety.  (b) Be provided with sufficient fuel for the running of the generat ing set for a minimum  of 2 h.  (c) Be provided with protection ensu ring fire resistance for a mini mum of 2 h.  (d) Be permanently connected to the electrical installation.  (e) Not be adversely affected by the failure of the normal supply.  (f) Not be used for purposes other than the supply of safety or ess ential services except  as permitted in Clause 3.5.5.  NOTE: The consequences of an extended loss of normal supply may  also have to be taken into  consideration.",
  "3.5.3": "3.5.3   Overcurrent protection  Overcurrent protective devices shall be selected and installed to avoid an overcurrent in one  circuit impairing the correct operation of other circuits. The reliability of supply, including  discrimination of overcurrent p rotective devices, shall be in a ccordance with AS/NZS 3000.",
  "3.5.4": "3.5.4   Paralleling sources of supply  Sources of supply not intended to be connected and operated in parallel shall be prevented  from being so connected (e.g. by switching or mechanical or ele ctrical interlocks).",
  "3.5.5": "3.5.5   Supply of other than saf ety services or essential servi ces  A single generating set shall not be used for purposes other th an the supply of essential or  safety services in accordance with  Clause 3.5.1 unless suitable precautions are taken to  ensure that the supply to the essential or safety services will  not be affected by the  additional loading under any conditions of operation.  Where more than one emergency supply system provides a source o f supply, such sources  may be used for the supply of other than emergency systems or s afety services provided  that, in the event of failure of one source, the supply remaini ng available will be sufficient  for the operation of all emergency systems or safety services.  NOTE: This requirement generally necessitates the automatic loa d-shedding of circuits not  supplying emergency syst ems or safety services.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  47 AS/NZS 3010:2017   COPYRIGHT",
  "3.5.6": "3.5.6   Automatic changeover to an emergency essential or suppl y system   Where an alternative supply is provided, an automatic changeove r switch shall be installed  on the main switchboard to allow supply for the alternative system to be connected to the  safety services.  T h e  t i m e  t a k e n  f o r  a u t o m a t i c  c h angeover to an emergency supply system shall not be  greater than that permitted by saf ety considerations for the ty pe of load supplied.  Changeover times are classified as follows:  (a) No break    An automatic supply that can ensure a continuous supply with in specified  conditions during the period of t ransition, e.g. as regards var iations in voltage and  frequency.  (b) Short break    An automatic supply available within 1 s.  (c) Medium break    An automatic supply available within 30 s.  (d) Long break    An automatic supply available in more than 30 s.  NOTE: Where no break in supply can  be tolerated, it is not unco mmon for the generating set to be  run continuously as the normal supply and the electricity distr ibution system used as the  alternative supply system. As stated in Clause 1.1, such forms of supply are not covered in this  Standard except for minimum requirements that affect safety.",
  "3.5.7": "3.5.7   Switchgear  With the exception of any alarm devices, all switchgear and con trol gear controlling the  output of a generating set or the remote control of a generatin g set providing supply for  essential or safety services, shall be clearly and permanently identified and grouped in  locations accessible only to authorized persons.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  48  COPYRIGHT  3-Phase normal supply Main switch(es) safety services To general load via protection devices * Overcurrent device. † Safety services short circuit protection only. ‡ Locking arrangement refer AS/NZS 3000. § Synchronisation and control equipment not shown. Switch* Switch † Main switch normal supply* GENERATOR Generator Main switch generator Main switch generator safety services supply ‡ Main switch normal supply safety services † MAIN SWITCHBOARD Normal loads, contactors or circuit breakers Safety services, contactors or non-auto circuit breakers G Automatic changeover device § Automatic changeover device §   NOTES:   1 Switchboard internal separation  requirements in accordance with AS/NZS 3000.  2 See Clause 3.5.1.  FIGURE  3.1   TYPICAL ARRANGEMENTS F OR NORMAL AND GENERATOR SUP PLY  INCLUDING LOCATION OF AUTO MATIC CHANGEOVER DEVICE FOR AN  INSTALLATION CONT AINING SAFETY SERVICES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  49 AS/NZS 3010:2017   COPYRIGHT  Normal supply Main switch(es) safety services To general load via protection devices Switch* Main switch normal supply* GENERATOR Generator Main switch generator ‡ Main switch generator safety services supply ‡ Main switch normal safety services supply † MAIN SWITCHBOARD Normal loads, contactors or circuit breakers Safety services, contactors or non-auto circuit breakers G Automatic changeover device § Automatic changeover device § * Overcurrent device. † Safety services short circuit protection only. ‡ Locking arrangement refer AS/NZS 3000. § Synchronisation and control equipment not shown.   NOTES:   1 Switchboard internal separation  requirements in accordance with AS/NZS 3000.  2 See Clause 3.5.1.  FIGURE  3.2   TYPICAL ARRANGEMENTS F OR NORMAL AND GENERATOR SUP PLY  INCLUDING LOCATION OF AUTO MATIC CHANGEOVER DEVICE FOR AN  INSTALLATION CONT AINING SAFETY SERVICES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  50  COPYRIGHT  Normal supply Main switch(es) safety services To general load via protection devices Main switch normal supply* GENERATOR Main switch generator safety services supply ‡ Main switch normal safety services supply † MAIN SWITCHBOARD Safety services, contactors or non-auto circuit breakers Automatic changeover device § Switch* Generator G * Overcurrent device. † Safety services short circuit protection only. ‡ Locking arrangement refer AS/NZS 3000. § Synchronisation and control equipment not shown.   NOTES:   1 Switchboard internal separation  requirements in accordance with AS/NZS 3000.  2 See Clause 3.5.1.  FIGURE  3.3   TYPICAL ARRANGEMENT S FOR NORMAL SUPPLY TO ALL SER VICES  AND GENERATOR SUPPLY TO SAFETY SER VICES ONLY INCLUDING LOCATION  OF  AUTOMATIC CHANGEOVER DEVICE FOR AN INSTALLA TION CONTAINING SAFE TY  SERVICES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  51 AS/NZS 3010:2017   COPYRIGHT  Normal supply Main switch(es) safety servicesTo general load via protection devices Switch † Main switch normal supply* GENERATOR Generating MAIN SWITCHBOARD G Safety services, contactors or non-auto circuit breakers Main switch generator † Automatic changeover device § * Overcurrent device. † Safety services short circuit protection only. ‡ Locking arrangement refer AS/NZS 3000. § Synchronisation and control equipment not shown.   NOTES:   1 Switchboard internal separation  requirements in accordance with AS/NZS 3000.  2 See Clause 3.5.1.  FIGURE  3.4   TYPICAL ARRANGEMENTS FOR NORMAL SUPPLY AND GENERA TOR  SUPPLY TO ALL SERVICES INCL UDING LOCATION OF AUTOMATIC CHANGEOV ER  DEVICE FOR AN INSTALLATION C ONTAINING SAFETY SERVICES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  52  COPYRIGHT  SECTION 4   ADDITIONAL REQUIREMENTS  FOR PORTABLE GENERATORS",
  "4.2.1": "4.2.1   General  Where a generating set is connected to an electrical installati on through a detachable  connection, the connection arra ngement shall provide the connec tions of the corresponding  active, neutral, protective earthing and bonding conductors of the isolated output generating  set to the electrical installation.",
  "4.2.2": "4.2.2   Connection to an installation  Where a generating set is to be connected to an electrical inst allation by detachable  connection, the arrangement sha ll provide facilities for connec tion of the corresponding  active, neutral, protective earthing and bonding conductors of the generating set and the  electrical installation respectively.",
  "4.2.3": "4.2.3   Connection  The cord extension socket, cord extension set and socket outlet types used for low voltage  socket outlet connections shall be as follows:  (a) Single-phase—  (i) AS/NZS 3112 (3-pin flat pin) up to 15 A;   (ii) AS/NZS 3120 (3-pin flat pin) up to 15 A;  (iii)  AS/NZS 3123 (round pins) above 15 A; or  (iv) IEC 60309 (round pins) above 15 A.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  53 AS/NZS 3010:2017   COPYRIGHT  (b) Three-phase—  (i) AS/NZS 3123 (round pins) above 15 A; or  (ii) IEC 60309 (round pins) above 15 A.  When cord extension socket, cord extension set and socket outle t types exceeding the  current ratings available for the above listed Standards are re quired, the detachable  connection fittings should confor m with other Australian, Austr alian/New Zealand or  international Standards requirements.",
  "4.3.1": "4.3.1   General  The earthing and equipotential bonding requirements for plug an d socket outlet connected  generating sets shall be in accordance with Clause 2.8.  Attention is drawn to the provisions of Clause 2.8 which require the generating set bonding  system to be connected to the exposed conductive parts of any generating set and to the  earthing system of the electrical installation.",
  "4.3.2": "4.3.2   Connection of generating set windings",
  "4.3.2.1": "4.3.2.1    Multi-phase and single-phase generating sets  The active or actives of the generating set windings shall be connected to the active  conductor(s) of the switchboard of the electrical installation in accordance with  Clause 2.8.4.  The neutral of the generating set windings shall be connected t o the neutral conductor of the  switchboard of the electrical ins tallation in accordance with C lause 2.8.1.  The generating set frame and the alternator frame shall be conn ected together to form a  common equipotential bonding system and shall be connected to t he earth bar of the  switchboard of the electrical installation.",
  "4.3.2.2": "4.3.2.2    Earth electrode  The connection of the portable generating set equipotential bonding system to the  switchboard earthing system provides the protective earthing re quirement as detailed in  AS/NZS 3000.  The connection of a portable generating set equipotential bondi n g  s y s t e m  t o  t h e  g e n e r a l   mass of earth through a separate earth electrode is not a gener al requirement of this  Standard.  NOTE: In New Zealand, when connecting a generator supply at a s witchboard without a neutral  earth connection, an earth elect rode is required in accordance with Clause 2.7.10.2 (b).  Appendix A explains why the connection of the generator equipot ential bonding system to  the general mass of the earth is not permitted other than via a n electrical installation’s earth  electrode in accordance with AS/NZS 3000.",
  "4.3.2.3": "4.3.2.3    Current limiting of the incoming supply  Each incoming supply to the installation from a generating set shall be protected by a  separate overcurrent protection device located within the elect rical installation and,  operating in all live (active and neutral) conductors.  The operating setting of the protection device shall not exceed  the rating of either the  supply conductors or the inlet fittings.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  54  COPYRIGHT",
  "4.3.2.4": "4.3.2.4    Enclosure of live parts  The electrical installation supply inlet and the generator socket outlet connection shall not  expose live parts to direct contact while disconnected or in th e normal process of cord  extension set insertion or withdrawal.  The neutral pin of the electri cal installation supply inlet is considered to be a live part and  shall be isolated from the main switchboard neutral connection by the changeover device  when in the normal supply or ‘off’ positions.  NOTE: See Figures 4.1 to 4.3.",
  "4.3.2.5": "4.3.2.5    Marking  Any inlet connection fitting provided for the connection of a g enerating set shall be  permanently marked to indicate its purpose.  The marking shall include the following wording:  ISOLATED output generating set only.  RCD protected and centre tapped generating sets shall not be connected.",
  "4.3.2.6": "4.3.2.6    Control of socket outlets  Any single- or multi-phase socket outlet installed on the gener ating set shall be provided  with an isolating device that operates in all active conductors .  NOTE: See Figures 4.1 to 4.3.",
  "63.5": "63.5 V and between the active (phase) conductors the maximum vo ltage should not exceed  110 V.  B5.7   Engine recommendations for tunnelling applications  B5.7.1    Type  The type used should be a compression ignition diesel engine. T he safety requirements  should be accordance with AS/NZS 3584.1. The use of any other o f engine type is not  permitted.  B5.7.2    Exhaust gas conditioning/catalytic converter  The exhaust system should be fitted with exhaust gas conditioni ng. A catalytic converter  should be fitted if possible.  B6   PROVISION OF AN EARTH ELECTRODE FOR THE PORTABLE  GENERATING SETS  The provision of an earth electrode for the generating set is n ot a requirement of this  Standard.  The equipotential bonding connections of the generating set output, connecting leads and  the earth connections of the electrical equipment connected, ensures that all earth fault  currents will operate or trip the overcurrent or earth leakage devices fitted to the generating  set to automatically disconnect the supply.  If an earth electrode is connected to the generating set frame,  this does not form part of a  low impedance earth fault current  loop and then the provision of this connection to the mass  of earth is not recommended or required. The main earth fault l oop is comprised of the  equipotential bonding system and the live conductors.    Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  72  COPYRIGHT  APPENDIX   C  DEDICATED WIRING IN AN ELECTRICAL INSTALLATION FOR  CONNECTION OF A PORTABLE GENERATING SET (NEW ZEALAND ONLY)  (Normative)  C1   CONNECTION OF THE DEDICATED W IRING SYSTEM TO A GENERATING  SET  C1.1   Design  The dedicated wiring system for the distribution of a portable generating set output within  an electrical installation shall conform with the following:  (a) The system shall be single-phase.  (b) The dedicated wiring system shall have a maximum rating of 3.5 kW (15 A at 230 V).  (c) The generating set when connected to the dedicated wiring system shall be located in  a well-ventilated position to allo w safe escape of engine exhau st fumes and to provide  adequate cooling of the gen erating set when running.  (d) The generating set connection to the dedicated wiring system by a supply lead shall  be by one of the following:  (i) When a detachable supply lead is to be used for the connection of the dedicated  wiring system to a generating set output, a labelled 10 A or 15  A appliance inlet  in accordance with AS/NZS 3112 shall be used. The appliance inl et shall have a  minimum degree of protection of IP24.  (ii) When a permanently connected flexible supply lead is to be used  for the  connection of the dedicated wiring system to a generating set o utput, a  permanent connecting facility (e.g. a junction box) mounted on the building  shall be provided for the connec tion of the flexible supply lea d to the  installation wiring of the installation. The flexible supply le ad shall be fitted  with a 10 A or 15 A 3-pin plug  in accordance with AS/NZS 3112.  The flexible supply lead shall be securely anchored at the poin t of connection to  the building dedicated wiring system and a suitable means for t he storage of the  flexible supply lead when not in use shall be provided.  (e) The flexible supply lead used for connecting the generating set  and the dedicated  wiring system shall be protected from overcurrent by a two pole MCB (for both active  and neutral conductors) with a r ating of the inlet plug rating or the flexible supply  lead current rating, whichever is the lesser value.   (f) The dedicated wiring system shall include a facility for isolation of the inlet fitting  from the rest of the system.  NOTE: This function may be performed by the overcurrent protect ion device.  The connection device shall be suitably protected to provide a minimum degree of  protection of IP24.  NOTE: The generating set overcurrent protection system provides  the overcurrent protection  of the generating set only. It may not provide system overcurre nt protection for the dedicated  wiring system, which will require a setting suitable for that s ystem.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  73 AS/NZS 3010:2017   COPYRIGHT  (g) The dedicated wiring system in the building structure shall be completely isolated  (active, neutral and earth) from any other installation wiring in the structure,  including any switchboard enclosure, flush boxes provided for t he fixing of socket  outlets and any connection to the earthing system of the electr ical installation.  All cables shall be physically separated to AS/NZS 3000 requirements, as required for  a different electrical installation, by a minimum distance of 2 5 mm.  (h) The dedicated installation wiring system shall be connected to a limited number of  permanently marked double pole switched 10 A socket outlets (fo r both active and  neutral conductors) in accordance with AS/NZS 3112, connected for operation from a  portable generating set output.  (i) The wiring connections shall conform with Figure C1.  NOTES:    1 The total isolation of the dedicated wiring system is to provide isolation from the earthing  system of the electrical installation and to prevent any possib ility of back feeding of the  portable generating set output into the electricity distributor s supply system connected to any  switchboard of the electrical installation.  2 The total isolation of the dedicated wiring system enables any configuration of portable  generating set conform with Paragraph B2.1 requirements, except ing a reduced low voltage  generating set, to be used.  C2   VERIFICATION  To confirm that the requirements of this Appendix have been met , after completion and  before use, the dedicated wiring system shall be—  (a) inspected, as far as practical; and  (b) tested as detailed in Section 8 of AS/NZS 3000:2007, and the fo llowing additional  requirements:  (i) Equipotential earth bonding continuity.  (ii) Correct labelling ‘ GENERATING SET POWER ONLY ’ on the appliance inlet,  overcurrent device and all socket outlets.  (iii)  All dedicated wiring is at least 25 mm away from other electric al installation  cabling.  (iv) All dedicated wiring does not enter any electrical installation  switchboard  enclosure, flush boxes or socket outlet fittings that are conne cted to other  sources of normal power.  (v) All switching devices and the overcurrent device operate in all  live poles  (active and neutral).  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  74  COPYRIGHT  AC Generator  Portable generator set with overcurrent protection located outside building. Isolated winding generated set shown, but can be RCD protected or IMD  protected types.NOTES: 1. All wiring for portable generator set output inside the electrical installation to be segregated from electrical installatio n wiring to  AS/NZS 3000 requirements of a different electrical installation.  2. No wiring shall pass through any switchboard enclosure of the electrical installation and includes any flush boxes for the mounting  of the electrical fittings in the electrical installation. Inlet plug mounted on building exterior marked “Generator power only” A AN N E E Extension cord 10 A double pole switched socket outlets marked “Generator power only” 2 Pole MCB maximum rating is not greater than current  rating of connecting plug or flexible supply cord rating. MCB to be marked ‘Generator power only” Flexible cord and 3 pin plug for connection to generator set socket outlet. Provide enclosure for cord storage when not in use. Option 1 Option 2 2 Pole MCB maximum rating is not greater than current  rating of inlet plug and located adjacent to the inlet plug New Zealand ONLY   FIGURE  C1   DEDICATED  WIRING SYSTEM IN ELECTRICAL INSTALLATION  FOR CONNECTION OF A PORTABLE  GENERATING SET  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  75 AS/NZS 3010:2017   COPYRIGHT  APPENDIX   D  REQUIREMENTS FOR THE CONSTRUCTION OF SELF-CONTAINED  TRANSPORTABLE GENERATING SETS UP TO 25 KW  (Normative)  D1   SCOPE  This Appendix sets out the requirements for the construction of  self-contained transportable  electricity generating sets driven by internal combustion engin es and intended to provide a  50 Hz a.c. supply, of low voltage, single-phase, two- or three-phase, with a maximum  output up to 25 kW.  They may be portable, semi-portable, transportable, or mobile.  The generating sets are typically standard manufactured sets an d are often selected from a  commercial catalogue or leaflet.  This Appendix does not apply to generating sets intended solely  for charging batteries at  ELV.  For electrical safety requirements, this Standard shall be read in conjunction with  AS/NZS 3000, AS/NZS 3100 and AS/NZS 3820.  NOTES:    1 A generating set may include a separate extra-low voltage d.c. output, e.g. 12 V, for battery- charging purposes.  2 The terms ‘extra-low voltage’ and ‘low voltage’ are as defined in AS/NZS 3000 and  AS/NZS 3100.  3 Generating sets conforming with this Appendix are not normally suitable for operation in  parallel with other sets or with reticulated supply because of the lack of controls and  instrumentation suitable for controlling generating sets running in parallel with the normal  supply.  D2   SERVICE CONDITIONS  A generating set shall be suitable for use under the following service conditions:  (a) Ambient temperature :  (i) Maximum 40°C.  (ii) Minimum 15°C.  (b) Altitude   Up to 1000 m above sea level.  (c) Protection against the weather    Either—  (i) for undercover or weather-protected usage—having no inherent pr otection  against rain; or  (ii) for outdoor use—without further protection from the weather (se e  Paragraph D7.3.)  (d) Fuels and lubricants    Use readily available fuels and lubricants.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  76  COPYRIGHT  D3   SAFETY  D3.1   Electrical safety  D3.1.1    Design, construction and materials  The design, construction, materials, equipment and components u sed, and the workmanship  involved, shall be in accordance with the requirements of AS/NZ S 3100.  D3.1.2    Identification of conductors  Conductors shall be identified as specified in AS/NZS 3100. Con d u c t o r s  w h i c h  a r e   connected, directly or indirectly, to the frame (see Paragraph D3.1.9) shall be considered to  be earthing conductors.  D3.1.3    Overload protection  Overload protection shall be by means of circuit-breaker(s) or fuse(s), by inherent circuit  regulation, by stalling the engi ne (for generating sets up to 1 5 kW), or by other suitable  means.  Where circuit-breakers are used , they shall be in accordance wi th AS/NZS 60898.  Fuses holders shall be in accordance with AS/NZS 3100 and the f use links with  AS/NZS 60269.  NOTE: Small generating sets have very limited overcurrent capab ility in excess of the full load  rating, checking the generator (alternator) and protective devi ce manufacturer’s information will  be necessary to select the correct current rating and type of p rotective device to provide adequate  protection.  When an electronic module device (EMD) is used to provide a sta ble voltage and frequency  output, the electronic module device may be used for overload p rotection in addition to any  external overcurrent devices.  D3.1.4    Switching in output circuits  Switching in output circuits shall be provided by either—  (a) a main switch; or  (b) individual all live pole (active( s) and neutral) switches for each socket outlet.  A circuit-breaker shall be acceptable as a main switch.  The outlet individual switch on socket outlets shall be in acco rdance with the requirements  of AS/NZS 3133 or AS/NZS 60947 (series).  Exception: The main switch in the output circu it may be used as a common switch instead  of individual socket outlet switches for up to two adjacent socket outlets.  D3.1.5    Arrangement of live parts, conductors and cables  Live parts shall be arranged in accordance with AS/NZS 3100 req uirements.   Where a low voltage output and an extra-low voltage output are available simultaneously,  accessible extra-low voltage wiring, e.g. battery charging circ uits derived from the  generator, shall be separated by double insulation from the low voltage circuits, refer to  AS/NZS 3100 for details.  Conductors and cables shall be protected as specified in AS/NZS  3100. All unsupported  conductors shall be str anded and no strand shall exceed 0.67 mm  (nominal) diameter.  D3.1.6    Joints and connections  Joints and connections shall be  in accordance with AS/NZS 3100 requirements.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  77 AS/NZS 3010:2017   COPYRIGHT  D3.1.7    Guarding and insulation of live parts  All live parts, including any ‘neutral’ parts, shall be guarded  and insulated in accordance  with AS/NZS 3100 requirements.  D3.1.8    Equipotential bonding (earthing) facilities  The following parts shall be in effective electrical contact wi th each other:  (a) The engine frame.  (b) The generator frame.  (c) All external metal enclosing electrical equipment or wiring.  (d) The ‘earth’ terminals of all socket outlets.  (e) The main frame terminal (marked    or ‘ FRAME ’).  (f) The main winding, as specified in Paragraph D3.1.9.  (g) The ‘earth’ connection of any electronic circuitry that may nee d to be connected to  the above items.  The connections shall be in accordance with AS/NZS 3100 require ments.  D3.1.9    Connections between main winding(s) and frame  Single-phase connections between main winding(s) and the frame shall be as follows:  (a) Single-phase winding (isolated output) —the winding shall not be connected to the  frame.  (b) Single-phase winding (RCD protected) —using a 30 mA RCD in accordance with  AS/NZS 3190, AS/NZS 61008.1 or AS/NZS 61009, or a combination s ocket outlet  RCD in accordance with AS/NZS 3190.   The RCD shall be of a type that operates correctly on the outpu t supply of the  generating set.  The input neutral terminal of the RCD shall be connected to the  earth terminal of the  frame, see Figure B4.   I n  N e w  Z e a la n d ,  t h e  R C D  t y p e  s h a l l  b e  o f  a  t yp e  f o r  w h i c h  t r i p ping is ensured for  residual alternating current and residual pulsating direct current.  NOTE: This should be the only connection between the winding an d the frame.  (c) Single-phase winding (isolated output) fitted with an insulation monitoring device   An insulation monitoring device (IMD) in accordance with IEC 61 557-8 shall be  fitted to control the overcurrent protective device fitted with  an undervoltage coil, or,  to control a series contactor.  In the event of the insulation resistance of the generator and/ or the load connected  falling below a pre-set minimum resistance the IMD shall remove  the supply from the  load connected to the generating set.  The IMD shall be installed to t he manufacturer’s instructions.  (d) Single-phase output with an inverter module    The output of the electronic inverter  module output shall not be connected to the frame.  (e) Two-phase winding    The neutral or centre-tap connection shall not be connected to  the frame via a removable connection or link, when used to supp ly an electrical  installation connected by installation wiring or a plug and soc ket arrangement.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  78  COPYRIGHT  The winding connections permitted are—  (i) two-phase 120° electrical (open delta) 230 V phase-to-neutral 4 00 V between  phases; or   (ii) two-phase centre-tapped (180° electrical) 230 V phase-to-neutra l 460 V  between phases, see Figure D1.  NOTE: The two-phase centre tappe d (180° electrical) is the syst em of supply used for  single earth wire return distribution systems.  ISOLATED OUTPUT TWO PHASE (180 DEG. ELECT.) GENERATING SET COMPLYING WITH APPENDIX D Overcurrent protection & socket outlet isolator Two phase (180 deg  elect) G Frame L1 N L2 Socket outlet to be labelled  “2 phase + Neutral and earth only”   FIGURE  D1   ISOLATED OUTPUT TWO -PHASE (180° ELECTRICAL) GENERA TING SET  WITH TWO-PHASE + N SOCKET OUTLET FOR USE IN SWER DISTRIBUTION A REAS  (f) Three-phase windings (star-connected).  (g) Three-phase winding (isolated winding)    The star point or neutral connection shall  not be connected to the frame.  (h) Three-phase winding connected to a four pole (three-phase + N) —30 mA RCD in  accordance with AS/NZS 3190, AS/NZS 61008 or AS/NZS 61009.  The input neutral terminal of the RCD shall be connected to the  earth terminal of the  generating set frame, see Figure B2.  The RCD shall be of a type that operates correctly on the outpu t supply of the  generating set.  I n  N e w  Z e a la n d ,  t h e  R C D  t y p e  s h a l l  b e  o f  a  t yp e  f o r  w h i c h  t r i p ping is ensured for  residual alternating current and residual pulsating direct current.  NOTE: This should be the only connection between the winding an d the frame.  NZ Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  79 AS/NZS 3010:2017   COPYRIGHT  (i) Three-phase winding (isolated winding)    and connected to a three-phase IMD in  accordance with IEC 61557-8 shall be fitted to control the over current protective  device fitted with a shunt trip coil, or, to control a series c ontactor.   In the event of the insulation resistance of the generator and/ or the load connected falling  below a pre-set minimum resistance shall remove the supply from the load connected to the  generating set.  The IMD shall be installed to the manufacturer’s instructions.  NOTES:    1 It is considered that, in the absence of 30 mA RCD or IMD prote ction, a single-phase winding  is safer when isolated from the generator set frame, subject to  the limitation on the number of  Class I appliances or tools on a common generator output with a  separated (isolated) output as  detailed in AS/NZS 3000.  In the event of a single earth fault to frame, see Paragraph B2 .3.1 for details of the clearance  of an earth fault condition.  2 Where a RCD is fitted, the connection between winding or RCD ne utral input terminal and  the generator set frame is required to permit correct operation  of the RCD.  If the RCD device were subsequently removed, it is likely (and recommended) that the  winding-to the generator set frame connection should also be re moved.  The fitting of an RCD is unsuitable for connection of the gener ator set to a fixed MEN  electrical installation (where the  neutral and earth are connec ted together on the load side of  the RCD because the RCD would trip on load due to the division of load current between the  neutral and earth conductors to the electrical installation.  3 A removable generator set connection or link is specified in Note 2 above, so that it may be  easily removed (by an appropriately licensed person) when the s et is to be connected to a  MEN electrical installation.  D3.1.10    Limiting temperatures of electrical parts  The temperatures of insulating materials shall not exceed the r elevant values specified in  AS/NZS 3100. (See also Paragraph D6.3 concerning the generator.) The temperatures of  conductors shall not exceed the relevant values specified in AS /NZS 3100.  D3.1.11    Output socket outlets  Output shall be by—  (a) socket outlet(s) in accordance with AS/NZS 3112, (3-pin flat pi n) 10 A or 15 A,   single-phase only; and  (b) for generating sets over 2.5 kW, single-phase and multi-phase, AS/NZS 3123 or  IEC 60309 (round pins) greater than 15 A.  Extra-low voltage socket outlets shall be in accordance with AS /NZS 3112, and shall be of  a type that does not permit AS/NZS 3112 low voltage plugs to enter the extra-low voltage  socket outlet and vice versa.  D3.1.12    Cord extension sets  Where a single-phase cord extension set rated at 10 A, 15 A, or  20 A is provided with a  generating set, they shall be in accordance with AS/NZS 3199. T he flexible cord shall be  ordinary duty or heavy duty i n accordance with AS/NZS 3191.  D3.2   Mechanical safety  D3.2.1    Protection from external damage  All components of a generating set, including mechanical parts,  fuel systems, wiring,  switches, instruments, and cont rols shall be adequately protected against mechanical  damage likely to occur in normal use.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  80  COPYRIGHT  D3.2.2    Protection against moving parts  All moving parts that may cause injury to persons shall be encl osed by guards to prevent  inadvertent personal contact with such parts. A crank handle, if provided, shall be arranged  to disengage when the engine starts.  D3.2.3    Protection against disintegration of rotating parts  External rotating parts, e.g. the flywheel, shall not disintegr ate at runaway speed of the  generating set.  D3.2.4    Accessibility of controls  Switch(es) or control(s) for stopping and starting the engine s hall be readily accessible and  their mode of operation obvious a nd be permanently labelled.  Any automatic-start or remote-start arrangement shall be capabl e of being disabled and kept  in that state for purposes of inspection and maintenance of the generating set.  D3.2.5    Direction of rotation  Where the driving shaft or flywh eel is accessible or where cran k handle starting is  provided, the direction of rota tion shall be marked on a suitab le adjacent surface in an  obvious and permanent manner.  D3.3   Thermal safety—Protection against hot parts  All parts that in normal operation reach temperatures in excess  of 120°C, e.g. the engine,  the muffler, the exhaust, the cooling system and the cooling sy stem vent, shall be arranged  to prevent inadvertent persona l contact with such parts.  D4   PROTECTION AGAINST FIRE AND EXPLOSION  D4.1   Leakage of fuel and lubricating oil  The fuel tank and pipes shall be compatible with the fuel used and, if a gravity feed system,  be provided with a stopcock on the outlet of the fuel tank.  The fuel tank, fuel pipes and lubricating oil pipes shall not b e installed in the vicinity of  high-temperature surfaces, electrical components or the air intake (to engine or generator).  The tank filling arrangement shall ensure that, when overfilled, fuel does not spill over or  flow onto hot parts or rotating parts.  D4.2   Prohibited fuel piping  Galvanized steel shall not be used in contact with diesel fuel.   D4.3   Arrangement of the exhaust  The exhaust shall be fitted with a spark arrestor in accordance with AS 1019. Exhaust gases  shall be directed away from the fuel supply system, from electr ical wiring and from  controls.  D5   RATING AND PERFORMANCE  D5.1   General  D5.1.1    Total rating  All ratings shall apply to the complete generating set.  The rated power output of the generating set shall be the outpu t available from the  generator at rated operating c onditions and at standard tempera ture and air pressure   (refer to AS 4594.1 and AS 60034.1 or ISO 8528-8).  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  81 AS/NZS 3010:2017   COPYRIGHT  D5.1.2    Noise and vibration  When determined by the procedure specified in AS 2221.1, the ma ximum A-weighted  sound pressure level of the generating set, under both rated lo ad and no load, shall not  exceed that specified in Table D1.  TABLE   D1  MAXIMUM SOUND PRESSURE LEVELS OF   GENERATING SETS AT 7 m FROM THE REFERENCE SURFACE, dB(A)  Type of engine  Rated output of generating set, kW  2.5 >2.5 15 >15  Spark-ignition 78 80 83  Compression-ignition 80 85 90  NOTES:   1 The above maximum levels are bas ed on typical manufacturing sta ndards; nevertheless, many  generating sets may achieve s ignificantly lower levels.  2 The operation of the g enerating set shall not be limited by har mful vibration.  D5.1.3    Fuel consumption  The fuel consumption in litres per hour, if declared by the manufacturer, shall apply after  the nominated run-in period, in normal operation at rated electrical output with all  accessories, including battery c harger, if any, operational.  When measured in accordance with AS 4594.1, the fuel consumptio n shall be within 5% of  the manufacturer’s rated consumption.  D5.2   Mechanical—Governing  A generating set having a rated output exceeding 15 kW shall be provided with Class A1  governing in accordance with AS 4594.4.  A generating set of rating not exceeding 15 kW shall be provide d with governing such that,  when operating at rated load at governed speed and the full load is removed, the increase in  engine speed does not exceed that specified in Table D2.  TABLE   D2  GOVERNING REQUIREMENTS FOR   GENERATING SETS OF RATING NOT EXCEEDING 15 kW  Type of engine  Maximum increase in engine speed, percentage of  governed speed  Transient Steady state  Spark-ignition 15 10  Compression-ignition 12 8    D5.3   Cyclic irregularity of voltage  When the generating set is running at rated load and governed s peed, the cyclic irregularity  of voltage shall not exceed t he limits of AS 4594.5.  NOTE: This Paragraph imposes a maximum cyclic irregularity of voltage so that, under   steady-state conditions, light flicker is limited. However, the re may be other causes of light  flicker.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  82  COPYRIGHT  Cyclic irregularity arises from the combined effects of engine impulses (firing strokes) and the  smoothing inertia of the flywheel and generator rotating masses . Cyclic irregularity, which varies  from cycle to cycle, is cal culated from the ratio:  maximum speed minimum speed mean speed    When a generating set is running  at rated load and governed spe ed, the cyclic irregularity of  voltage shall not exceed  75 1 , i.e. 1.33%, when measured as follows:  (a) P l o t ,  b y  d i r e c t  o r  i n d i r e c t  m e a n s ,  t h e  s q u a r e  o f  t h e  v o l t a g e  w aveform over  10 consecutive half-cycles.  (b) Then measure the area of each half-cycle of the plot, noting th e maximum, minimum,  and mean areas.  (c) Then calculate the ratio:  maximum speed minimum speed mean speed    D5.4   Over-speed withstand  A generating set shall withstand, without harmful effect, a spe ed of 120% of the rated speed  for 5 min.  D5.5   Shutdown facilities  A generating set having a rated output exceeding 15 kW, shall i ncorporate automatic  shutdown devices for the fo llowing engine conditions:  (a) Low lubricating-oil pressure.   (b) High temperature of coolant (air or water).  (c) An over speed of 25%.  D6   ELECTRICAL  D6.1   Rated output  A generating set shall have a max imum continuous rating (S1 rat ing) in watts (or kilowatts)  at a stated power factor and be s uitable for continuous running  duty.  D6.2   Operation at other than the rating point  A generating set shall operate as follows:  (a) Without exceeding specified temperature limits —at rated output, rated speed, rated  power factor and at a voltage between 95% and 105% rated voltag e.  (b) Without practical difficulty —at rated output, rated speed, rated voltage, and at any  power factor between 0.8 lagging and unity.  D6.3   Temperature rise  The limits of temperature rise of the various parts of a generator when driven by the engine  at rated output, and the methods of measurement shall be as specified in AS 60034.1  NOTE: For other electrical components see Paragraph D3.1.10.  D6.4   Voltage regulation and adjustment  The voltage regulation under steady-state conditions between no  load and rated load shall  be within 5% of the rated voltage. No other  means for the adjustment of voltage need be  provided.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  83 AS/NZS 3010:2017   COPYRIGHT  D6.5   Irregularities of voltage waveform  When irregularities of voltage waveform are measured as specified in AS 60034.1, the  following limits shall apply:  (a) Waveform deviation :  (i) Generating set <2.5 kW. ..................................................................... 25% max.  (ii) Generating set >2.5 kW–15 kW. ......................................................... 20% max.  (iii) Generating set >15 kW. ...................................................................... 15% max.  NOTE: For some applications, e.g. for supply to electronic equi pment, lower limits may be  necessary [see Paragraph D9(k)].  D6.6   Electromagnetic interference  The limits for electromagnetic interference shall be as follows :  (a) From spark-ignition engines as specified in AS/NZS CISPR 12.  (b) From generator and electrical circuitry as specified in AS/NZS CISPR 14.1.  D6.7   Under-speed withstand  A generator shall withstand, without overheating, normal operat ion at rated output at speeds  down to 95% of rated speed.  D6.8   Momentary overload  A generator should be capable of withstanding, for not less tha n 15 s a current of 150%  rated current, the voltage being maintained as near the rated v alue as possible consistent  with the maximum capacity of the engine.  NOTE: The exact value of the voltage is not important.  D6.9   Short-circuit withstand  A generator shall be capable of withstanding a sudden short-cir cuit as specified below, on  all phases or on any combination of phases, at the terminals of  the generator without  harmful deformation of the windi ngs or other parts of the gener ator.  The peak value of the short-circuit current shall not exceed 15  t i m e s  t h e  p e a k  v a l u e  o r   21 times the RMS value of the rated current.  Conformance may be checked by calculation or by test. In the la tter case, the test shall be  carried out on a machine running on open-circuit at rated speed with excitation constant at a  value that will produce a generator terminal voltage not greate r than the rated voltage.  A generator shall be deemed to s atisfy the requirements of the test if no harmful  deformation occurs and if the windings withstand the high-volta ge test specified in  AS 60034.1, after the short-circuit test.  D7   DESIGN AND CONSTRUCTION  D7.1   General  D7.1.1    Unitary construction  The generating set shall be cons tructed as a unit. All parts, i ncluding the fuel tank and  engine-cooling means, e.g. radia tor, shall be common mounted.  Adequate means shall be provided for lifting the set, special r equirements will be included  in the information to be supplied when placing an order for the supply of the generating set  (see Paragraph D9).  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  84  COPYRIGHT  D7.1.2    Location of components  Components shall be grouped according to safe practice to avoid  any hazard, e.g. due to  proximity of the fuel tank and the hot exhaust parts, while pro viding reasonable access for  routine service, e.g. cleaning of filters and changing of fuses .   In particular, electrical wiring shall be kept clear of the exh aust, the muffler and other hot  parts.  D7.1.3    Vibration isolation  Means for minimizing transmission of vibration shall be provide d as follows:  (a) Between the engine-generator combination and the chassis; alter natively underneath  the chassis.  (b) For instruments and controls where these might be affected by vibration.  D7.1.4    Accessibility of parts  Parts of a generating set requiring routine service, e.g. air a nd oil filters, shall have  unobstructed access and be readily accessible and serviceable w ithout major dismantling or  the use of special tools.  D7.1.5    Weather protection  A generating set intended for unde rcover use should be suitable  for use in light mist without  interruption of operation.  A generating set intended for outdoor use without further protection from the weather shall  conform with Paragraph D7.3.  NOTE: For protection of electrical components, see Paragraph D7 .3.  D7.2   Mechanical  D7.2.1    Fuel system  The fuel tank capacity shall be s ufficient for normal operation  at rated output for at least  3 h.  D7.2.2    Cooling system  The cooling system shall be suitable for continuous operation at rated output.  D7.2.3    Lubricating system  Means shall be provided for coll ecting drained oil into a suita ble container.  D7.3   Electrical—Protection of electrical equipment against in gress of objects, dust,  and water  Electrical components, accessories and wiring shall be protected against ingress of objects,  dust, and water insofar as such might occur in normal use.  The enclosure of electrical equipment of a generating set shall  have a minimum degree of  protection of not less than IP22 in accordance with AS 60529 or , for the generator, with  AS 60034.1.  The enclosure of electrical equipment of a generating set intended for outdoor use without  further protection from the weather shall have a minimum degree of protection of not less  than IP23.  NOTE: Additional protection may involve considerable additional  cost (see Paragraph D9).  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  85 AS/NZS 3010:2017   COPYRIGHT  D8   INFORMATION  D8.1   Marking on set  The following information shall be permanently and legibly marked on a generating set:  (a) The name of the manufacturer of the set.  (b) The model number and serial number of the set.  (c) The type of fuel or fuel-oil mixture.  (d) Rated output in watts or kilowatts at a stated power factor.  (e) The voltage and frequency.  (f) Output terminal markings (unless all outputs are -socket outlet s).  (g) The frame terminal: Symbol    or ‘ FRAME ’.  (h) On a set intended for undercover or weather-protected usage, th e words ‘ NOT  WEATHERPROOF ’.  (i) On a set intended for outdoor use without further protection, t he IP classification of  its electrical equipment.  (j) A warning as follows:  WARNING: THE OUTPUT OF THIS GENERATING SET IS POTENTIALLY  LETHAL. THE SET SHALL NOT BE CONNECTED TO A FIXED ELECTRICAL  INSTALLATION BY FIXED WIRING EXCEPT BY AN APPROPRIATELY  LICENSED PERSON. SEE INSTRUCTION MANUAL.  D8.2   Warning notices  In addition to the warning detailed in Paragraph D8.1(j), the f ollowing warnings shall be  either—  (a) marked on a generating set in acco rdance with Paragraph D8.1; o r  (b) provided in documents supplie d with a generating set.  The warnings need not be phrased as set out below but should co nvey the same sense:  (i) DO NOT OPERATE IN A HAZARDOUS LOCATION, E.G. WHERE THERE MA Y  BE A RISK OF EXPLOSION OF PETROL FUMES, LEAKING GAS OR  EXPLOSIVE DUSTS.  (ii) DO NOT OPERATE IN A CONFINED AREA WHERE EXHAUST GASES, SMO KE  OR FUMES COULD REACH DANGEROUS CONCENTRATIONS  (iii) DO NOT REFUEL WHILE ENGINE IS RUNNING FOR PETROL DRIVEN  ENGINES.  Warnings shall also be provided, where necessary, dealing with methods of lifting the  generating set and any operating restrictions, e.g. concerning operation for long periods at  low load.  D8.3   Technical manual  A generating set shall be supplied with a technical manual that provides comprehensive  instructions concerning installation, operation and maintenance  procedures. The connection  of the generating set to a fixed electrical installation should  also be detailed   [see Paragraph D8.1(j)].  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  86  COPYRIGHT  D9   INFORMATION TO BE PROVID ED WITH ENQUIRY AND ORDER  The following information should be supplied by intending purch asers with enquiries and  orders for generating sets in accordance with this Appendix:  (a) The intended usage, or dominant load, e.g.:  (i) Leisure, sports, camping—lights, cooking appliances, refrigerat ion.  (ii) Light industrial—portable tools.  (iii)  Domestic household—mains-failure back-up.  (iv) Industrial, construction and building trades: tools.  (v) Marine applications.  (vi) Special requirements, e.g. high ambient temperature, high altit ude, or both.  (b) If the set is to drive electric motors, e.g. refrigerators, gri nders, pumps, fans, air  conditioners.  (c) The intended operating periods, e.g.:  (i) Number of hours per day, week, or month, as appropriate.  (ii) Maximum usage on one occasion, in hours.  (iii)  Expected usage before engi ne overhaul, in years.  NOTE: The specification of a lengthy period before overhaul may involve considerable  additional cost.  (d) The fuel to be used, e.g. grade of petrol; petrol-oil mixture ( 2-stroke); diesel; other,  e.g. LPG.  (e) Voltage, frequency, phases, e.g . 230 V 50 Hz, single-phase.  (f) The output required, in watts or kilowatts and load power facto r.  NOTES:    1 Note the marked load of each item intended for use simultaneous ly and add them. Make  allowance for motor-operated ap pliances like air conditioners, refrigerators and freezers  that briefly, on starting, t ake five times rated load.  2 Consider a larger output if it requires reduced variations in voltage and frequency due to  load changes, e.g. with sensitive electronic equipment.  (g) Details of the number, type and rating of the socket outlets to  be provided.  (h) If a lower noise level is required.  (i) If manual setting of voltage or closer automatic control of vol tage than specified in  Paragraph D6.4 is required.  (j) If a voltmeter or ammeter is required.  (k) If a better voltage waveform is r equired (see Paragraph D6.5).  (l) If a special lifting arrangement, e.g. single-point lifting, is  required   (see Paragraph D7.1.1).  (m) Any special protection of the i gnition system, if any, from the ingress or deposition of  moisture, or of the engine intake from ingress of water (see Pa ragraph D7.3).  (n) Any special protection against fungus growth (in the tropics), salty atmospheres   (in coastal areas), or corrosion (in industrial environments).  (o) If a larger capacity fuel tank is  required (see Paragraph D7.2. 1).  Any special protection of electrical equipment against ingress of objects, dust, or water   (see Paragraph D7.3).  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  87 AS/NZS 3010:2017   COPYRIGHT  D10   INSTRUCTION MANUAL  The instruction manual shall include the following information:   (a) Read instructions and note warnings on the set.  (b) Locate set in convenient place, avoiding long extension leads a nd possible damage to  leads by pedestrian or vehicular traffic.  (c) Stop engine, when adding fuel to tank.  (d) Maintain normal safety precautions with appliances and accessor ies as for use on  normal reticulated normal supply.  NOTES:    1 Extension leads should be ordinary or heavy duty depending on t he application, of  appropriate current rating, and i n any case not less than 1 mm 2 cross-section of conductor for  10 A fittings, or 1.5 mm 2 when 15 A fitting are used, and incorporates an earthing condu ctor  to ensure that there is no voltage difference between the gener ating set and any equipment  powered by the generating set.  2 The electrical continuity of the ‘earthing’ core should be chec ked periodically from pin to  socket to ensure continued electrical safety.  3 Some electrical appliances, e.g. portable drills, are marked  or ‘ double insulated ’, in which  case there will not be an earthing conductor in its mains lead (even though it may have a   3-pin plug).      Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8 AS/NZS 3010:2017  88    NOTES        Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8     Standards Australia  Standards Australia is an independent company, limited by guarantee, which prepares and publishes  most of the voluntary technical and commercial standards used i n Australia. These standards are  developed through an open process of consultation and consensus , in which all interested parties are  invited to participate. Through a Memorandum of Understanding w ith the Commonwealth  government, Standards Australia is recognized as Australia’s pe ak national standards body.  Standards New Zealand  The first national Standards or ganization was created in New Ze aland in 1932. The New Zealand  Standards Executive is established under the Standards and Accr editation Act 2015 and is the  national body responsible for  the production of Standards.  Australian/New Zealand Standards  Under a Memorandum of Understandi ng between Standards Australia  and Standards New Zealand,  Australian/New Zealand Standards  are prepared by committees of experts from industry,  governments, consumers and other s ectors. The requirements or r ecommendations contained  in published Standards are a consen sus of the views of represen tative interests and also take  account of comments received from  other sources. They reflect t he latest scientific and industry  experience. Australian/New Zeal and Standards are kept under continuous review after publication  and are updated regularly to take account of changing technolog y.  International Involvement  Standards Australia and Standards N ew Zealand are responsible f or ensuring that the Australian  and New Zealand viewpoints are considered in the formulation of  international Standards and that  the latest international experience is incorporated in national  and Joint Standards. This role is vital  in assisting local industry to c ompete in international markets . Both organizations are the national  members of ISO (the Internationa l Organization for Standardizat ion) and IEC (the International  Electrotechnical Commission).  Visit our web sites  www.standards.org.au  www.standards.govt.nz  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8         GPO Box 476 Sydney  NSW  2001  Phone (02) 9237 6000  Email mail@standards.org.au  Internet www.standards.org.au  SAI Global Customer Service  Phone 13 12 42  Email  sales@saiglobal.com  PO Box 1473 Wellington 6140  Freephone 0800 782 632  Phone (04) 498 5990  Email enquiries@standards.govt.nz  Website  www.standards.govt.nz  ISBN 978 1 76035 745 0 Printed in Australia  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8"
}