{
  "1.1": "1.1 SCOPE  This Standard sets out mInimum requirements for the design, construction and testing of  electrical installations that supply electricity to appliances and equipment on construction  and demolition sites, and for the in-service testing of portable, transportable and fixed  electrical equipment used on construction and demolition sites.  For a single domestic residence intended to be occupied as a residential housing unit, or,  adjoining units each with a separate exterior entry and intended to be occupied as  residential housing units, the requirements of this Standard are varied as detailed in  Appendix B.  NOTE: The Building Code of Australia (BCA) classification of building and structures is given in  Appendix C.  The requirements are intended to protect persons, livestock and property from electric  shock, fire and physical injury hazards that may arise from an electrical installation that is  used with reasonable care and with due regard to the intended purpose of the electrical  installation.  NOTE: For requirements and recommendations regarding safe working on or near electrical  equipment and installations, refer to AS/NZS 4836 and to Codes of Practice or other guidance  issued by the regu latory authorities.  This Standard applies to electrical installations associated with construction and demolition  sites which include- (a) building work, excavation work, compressed air work and diving work;  (b) parts of buildings that undergo structural alterations, such as extensions, major repairs  or demolition, to the extent that the work necessitates the provision of a temporary  electrical installation;  (c) work on or in connection with the construction or maintenance of roads, airfields or  airstrips, civil engineering works or bridges, or of the permanent way of a railway or  tramway;  (d) dredging or salvaging work;  (e) the laying, lining or maintenance of pipes or cables;  (I) earthmoving work carried out with equipment requiring the use of other than manual  power;  (g) any work in which explosives are used;  (h) site offices, cloakrooms, meeting rooms, dormitories, canteens, toilets, appliances and  other facilities provided during any work referred to in (a) to (g); and  (i) land clearing in preparation for any work referred to in (a) to (g).  COPYRIGHT  AS/NZS 3012:2010",
  "1.2": "1.2 APPLICATION  Electrical installations on construction and demolition sites shall be carried out in  accordance with AS/NZS 3000, except as varied herein, and with the applicable additional  requirements of this Standard.  This Standard shall be read and used in conjunction with the requirements of local  Electricity Safety and Occupational Health and Safety legislation and guidelines.  NOTE: Appendix D gives details of relevant authorities in Australia.",
  "1.3": "1.3 REFERENCED DOCUMENTS  Documents referred to in this Standard are listed in Appendix A.",
  "2.1": "2.1 SUPPLY",
  "2.2": "2.2 MAXIMUM DEMAND  The maximum demand of mains and sub-mains of construction wiring shall be determined  by one of the methods specified in AS/NZS 3000.",
  "2.3": "2.3 SWITCHBOARDS INSTALLED FOR THE PURPOSE OF CONSTRUCTION  AND D.EMOLITION",
  "2.4": "2.4 CONTROL AND PROTECTION",
  "2.5": "2.5 30 60 20 40  20 4.0 50 100 30 60",
  "2.6": "2.6 FLEXIBLE CORDS, CORD EXTENSION SETS, FLEXIBLE CABLES AND  ACCESSORIES",
  "2.7": "2.7 LIGHTING AND LUMINAIRES",
  "2.8": "2.8 LIFT SHAFTS",
  "2.9": "2.9 TRANSPORTABLE STRUCTURES  Electrical installations of transportable structures and their site supplies shall comply with  AS/NZS 300 I and with the following:  (a) Transportable structures shall be supplied by one of the following methods:  (i) Sub-mains originating at a circuit-breaker on a switchboard and installed as  construction wiring.  (ii) Final sub-circuits originating at a circuit-breaker on a switchboard and installed  as construction wiring.  (iii) Flexible cord and plug connected to a final sub-circuit via a socket-outlet in  accordance with the requirements of AS!NZS 300 I including- (A) each socket-outlet shall have a degree of protection not less than IPX4,  both when the plug is inserted and when it is not;  (8) each socket-outlet shall be individually protected by a circuit-breaker;  (C) the circuit-breaker shall not have a rating greater than that of the socket­ outlet, except where a 16 A circuit-breaker is protecting a 15 A socket­ outlet; and  (D) each socket-outlet shall be protected by an RCD with an operating current  not exceeding 30 rnA that operates in all live conductors (active and  neutral).  NOTE: It is recommended that a separate RCD is provided for each socket­ outlet to minimize the impact of the operation ofa single RCD.  Supply shall not be taken from a socket-outlet associated with one transportable  structure to supply another transportable structure except where item (e) applies.  (b) Where supplied by flexible cord the minimum cross-sectional area of the flexible cord  shall be 2.5 mm 2 and the maximum length of flexible cord shall be 15 m.  (c) Socket-outlets installed inside transportable structures shall- (i) be protected by ReDs, with a maximum rated residual current of 30 rnA, that  operate in all live (active and neutral) conductors;  Oi) be used only to supply electrical equipment and lighting within that  transportable structure; and  (iii) in Australia, where the structure is supplied by flexible cord and plug, be 0  controlled by double-pole switches.  (d) Socket-outlets installed on the outside of transportable structures shall- (i) be protected by 30 rnA RCD that operates in all live (active and neutral)  conductors: and  Exceptions: This condition need not app~y t()-~  (Aj supply to other transportable structures as desaibed in Clause 2.9(d)(ivJ  helow; and  (B) sub-main (interconnecting cable) supply systems comp~ying with  Appendix K  (ii) be used only to supply electrical equipment and lighting located immediately  adjacent to the structure; and  (iii) be controlled by switches that operate in all Jive (active and neutral)  conductors, where the structure is supplied by flexible cord and plug; and  COPYRIGHT  AS/NZS 3012:2010 28  (iv) only supply power to other transportable structures when the socket-outlet IS  part of an interconnecting system in accordance with (e) below.  (e) All components of an interconnecting supply system for transportable structures shall  be of equal or greater current carrying capacity than the protective devices that  protect the interconnecting system at the point of connection to the supply.  Overcurrent devices incorporated in the interconnecting system may be used to  provide overcurrent protection to individual cables.  NOTE: In New Zealand, some caravans may include a link between neutral and earth. In order to  avoid inappropriate operation of any upstream ReO, caravans that are fitted with such a I ink  should be modified to comply with the requirements in AS/NZS 300 I.  COPYRIGHT  29 AS/NZS 3012:2010  SECTION 3 VERIFICATION (INSPECTION  AND TESTING)",
  "3.2": "3.2 FREQUENCY OF VERIFICATION (lNSPECTJON AND TESTING)  The frequency of verification is determined by examination of the actual environment  where the equipment is being used rather than the type of equipment in use. The frequency  is based on the level of hazardlrisk and the degree of abuse to which the equipment is  exposed. This consideration should be based on the specific conditions immediately  effecting the particular item of equipment and not on general site conditions.  NOTE: Regulatory authorities, other Standards, workplace safety requirements or manufacturers'  instructions may specify shorter intervals appropriare to particular industries or specific types of  equipment.  Construction wiring and electrical equipment shall be inspected and tested as follows:  (a) For new equipment. prior to the initial introduction into service.  (b) Before return to service after a repair or servicing, which could have affected the  electrical sa (.'ety.  (c) For hire equipment, inspection prior to each hire and testing at not greater than  monthly intervals. If hire equipment remains on site then Table 3 applies.  (d) At intervals not exceeding those specified in Table 3.",
  "3.3": "3.3 PERSONNEL  The verification (inspection and testing) required by Clauses 3.4 and 3.7(b) shall be carried  out by a qualified person authorized to carry out the electrical installation work required.  The verification (inspection and testing) required by Clauses 3  shall be carried out by a competent person.  COPYRIGHT",
  "3.4": "3.4 CONSTRUCTION WIRING ANI) TRANSPORTABLE STRUCTURES",
  "3.5": "3.5 RCDS  RCDs shall- (a) be successfully operated by means of their in-built test facility (push-button); and  (b) be subject to and comply with a test for operating time of RCDs in accordance with  AS/NZS 3760.  NOTES:  An ReD tester may be used for this test.  2 Fixed ReDs include switchboard types and socket-outlet types.  3 Portable ReDs include ReDs on portable equipment.",
  "3.6": "3.6 OTHER EI..iECTRICAL EQUIPMENT ON SITE",
  "3.7": "3.7 CONNECTION BETWEEN GENERATOR WINDINGS, FRAME AND  EQUIPOTI!:NTIAL BONDING SYSTEM  Connections shall be tested and verified as follows:  (a) Where an RCD is used with, or connected to, a generator, the integrity of the  connection between the generator windings and the equipotential bonding system on  the generator (refer to Figure 2.3) shall be verified in accordance with Appendix O.  (b) Where, in aceordance with Clause 2.4.6.3(b), an isolated winding generator is used,  the continuity of the connection from the frame to the equipotential bonding system  (refer to Figure 2.2) shall be tested. The resistance of this connection shall be less  than I D. In addition, the insulation resistance between the generator winding and the  frame shall be greater than 1 MD.",
  "3.8": "3.8 ACTIONS RESULTING FROM INSPECTION AND TEST",
  "3.9": "3.9 PORTABLE GENERATOR SETS AND INVERTERS  Electrical verification of portable generator sets shall be carried out In accordance with  Appendix G.  Electrical verification of portable inverters shall be carried out In accordance with  Appendix H.",
  "3.10": "3.10 DOCUMENTATI()N ................................................................................................. 33  APPENDICES  A LIST OF REFERENCED DOCUMENTS ................................................................. 34  B ELECTRICAL INSTALLATIONS IN THE DOMESTIC HOUSING  CONSTRUCTION INDUSTRY ................................................................................ 36  C CLASSIFICATION OF BUILDINGS AND STRUCTURES .................................... 37  D REGULATORY APPLICATION ON CONSTRUCTION AND  DEM()LITION SiTES ............................................................................................... 39  E MARKING OF SWITCHBOARDS TO INDICATE THE PRESENCE  OF LIVE PARTS ....................................................................................................... 46  F RECOMMENDED COLOURS FOR TAGS ON TESTED EQUIPMENT ................ 47  G ELECTRICAL VERIFICATION OF GENERATORS WITH RCD  PROTECTION TO ASfNZS 3012 AND AS/NZS 3760 ............................................. 48  H ELECTRICAL VERIFICATION OF PORTABLE INVERTERS ............................. 49  NEW ZEALAND ONLY  VERIFICATION FORM FOR CONSTRUCflON AND DEMOLITION SITES ...... 52  J GUIDE TO ARRANGEMENT OF SWITCHBOARDS,  CONSTRUCTION WIRING AND EQUIPMENT ................................................... 53  K ALTERNATIVE SUPPLY SYSTEM FOR CONSTRUCTION  AND DEMOLITION SITES ........................................ \" ........................................... 54  AS/NZS 3012:2010  STAf\\IDARDS AUSTRALIA/STANDARDS NEW ZEALAND  Australian/New Zealand Standard  Electrical installations-Construction and demolition sites  SECTION SCOPE AND GENERAL",
  "1.4": "1.4 DEFINITIONS  For the purpose of this Standard the definitions given in AS/NZS 3000 and those below  apply.  ] .4.1 Appliance  A consuming device, other than a lamp, in which electricity is converted into heat, motion,  or any other form of energy, or is substantially changed in its electrical character.",
  "1.4.2": "1.4.2 Appliance, fixed  An appliance that is fastened to a support or otherwise secured in a specific location.",
  "1.4.3": "1.4.3 Appliance, hand-held  A portable app! iance intended to be held in the hand during normal use, the motor, if any,  forming an integral part of the appliance.",
  "1.4.4": "1.4.4 Appliance, portable  Either an appliance that is moved while in operation or an appliance that can easily be  moved from one place to another while connected to the supply.",
  "1.4.5": "1.4.5 Appliance, stationary  Either a fixed appliance or an appliance having a mass exceeding 18 kg and not provided  with a carrying handle.",
  "1.4.6": "1.4.6 Assembly for Construction Sites (ACS)  Switchboards complying with AS/NZS 3439.4 and the requirements of Clause 2.3.2.  NOTE: Further information is given in Appendix K.",
  "1.4.7": "1.4.7 Auxiliary socket-outlet panel  A socket-outlet assembly, supplied by a fixed-wired dedicated final sub-circuit of  construction wiring. (See Clause 2.6.11).",
  "1.4.8": "1.4.8 Cable, ilexible  A cable, the conductors, insulation and covering of which afford flexibility.",
  "1.4.9": "1.4.9 Competent person  A person, who has acquired, through training, qualification or experience or a combination  of these, the knowledge and skill enabling that person to perform the required task  correctly.",
  "1.4.10": "1.4.10 Construction and demolition site  A site where work in accordance with Clause 1.1 is carried out.  COPYRIGHT  7 ASJ'IZS 31112:211111",
  "1.4.11": "1.4.11 Construction-wiring (Construction and demolition wiring)  A system of wiring that is installed to provide electrical supply for construction and  demolition work and is not intended to form part of the permanent electrical installation.  The term includes- (a) consumers mains and sub-mains supplying site switchboards; and  (b) sub-mains to site facilities in which electricity is used, such as sheds, amenities or  transportable structures; and  (c) final sub-circuits connected at circuit-breakers on a site switchboard, supplying plant,  construction equipment such as temporary construction lighting, auxiliary socket­ outlet panels. hoists, and personnel lifts.  Construction wiring does not include flexible cords or flexible cables used to connect  appliances or luminaires to a socket-outlet, but does include flexible cords or flexible cables  used for items (a), (b) or (c) above.  NOTE: Construction wiring and equipment is normally intended to be removed at the completion  of construction work and is not intended to form part of the permanent installation. This does not  exclude parts of the permanent installation being used to support or supply construction wiring  provided it satisfies the relevant requirements of this Standard. Unused conductors must be  treated so they comply with the 'Voltage in unused conductors' section of AS/NZS 3000.",
  "1.4.12": "1.4.12 Cord, flexi ble  A flexible cable, no wire of which exceeds 0.31 mm diameter and no conductor of which  exceeds 4 mm 2 cross-sectional area, and having not more than five cores.",
  "104.13": "104.13 Detachable connection  'T'he connection of electrical equipment to a source of supply by means of a plug and socket.",
  "1.4.14": "1.4.14 Direct connection  The connection of electrical equipment directly to the source conductors by means of a  terminal, stud or other such arrangements.",
  "1.4.15": "1.4.15 Double-pole switcb  A switch that opcrates in both poles substantially at the same time.  NOTE: For single phase circuits, all live (active and neutral) conductors are switched.",
  "104.16": "104.16 Electrical equipment  Wiring systems, switchgear, controlgear, accessories, appliances, luminaires and fittings  used for such purposes as generation, conversion, storage, transmission, distribution or  uti I ization of e lectriea I energy.",
  "1.4.17": "1.4.17 Fixed eq uipment  Electrical equipment that is fastened to a support or otherwise secured in a specific  location.",
  "104.18": "104.18 Inverter  Device that uses semi-conductor devices to transfer power between a d.c. source and an a.c  load.",
  "1.4.19": "1.4.19 Isolated inverter  Inverter with protection by electrical separation, using double insulation or reinforced  insulation between input circuits and output circuits and between output circuits and  accessible conductive parts.  COPYRIGHT  AS/NZS 3012:2010 8",
  "1.4.20": "1.4.20 Permanent wiring  Wiring that forms part of the permanent electrical installation of a building or site.",
  "1.4.21": "1.4.21 Portable socket-outlet assembJy (PSOA)  An assembly, other than a cord extension set, having a heavy duty sheathed flexible cord,  one or more socket-outlets, an overload protection device, a residual current device and a  plug intended for connection to a low-voltage socket-outlet. It may also incorporate a  reeling or coiling arrangement.  NOTE: As a PSOA is a type of portable RCD (PRCD), it is a declared article and must comply  with the relevant requirements or AS/NZS 3190 and have regulatory approval.",
  "1.4.22": "1.4.22 Qualified person  A qualified person for electrical installation work is a suitably licensed electrician in  Australia or a licensed electrical worker in New Zealand.",
  "1.4.23": "1.4.23 RCD protected inverter (RCDP inverter)  Inverter that is fitted \\vith a residual current device (ReD) in the output circuit and with  cquipotential bonding of the earthing terminal of the a.c. output connector with input  circuits and the accessible conductive parts and with polarizcd output circuits achieved by  connecting of the earthing terminal of the a.c. output connector to either the- (a) upstream side of the ReD on the pole that is connected to the neutral terminal of the  a.c. output connector; or  (b) centre tap of the output circuit supply on the upstream side of the ReD.  NOTES:  This type of inverter may have accessible conductive parts that are separated from the output  circuits by double or reinforced insulation-these parts do not need to be bonded.  2 Where the d.c. input circuit is such that the input terminals are effectively connected together  by a low impedance internal impedance of a secondary battery), equipotential bonding of  a single input terminal is considered to satisfy the requirement for all such input terminals.",
  "1.4.24": "1.4.24 Residual current device (RCD)  A device intended to isolate supply to protected circuits, socket-outlets or electrical  equipment in the event of a current llow to earth that exceeds a predetermined value.  NOTE: RCDs are classified in AS/NZS 3190, AS/NZS 61008.1 and AS/NZS 61009.1.",
  "1.4.25": "1.4.25 Shall  Indicates a statement is mandatory.",
  "1.4.26": "1.4.26 Should  Indicates a recommendation.",
  "1.4.27": "1.4.27 Transportable structures  The term transportable structure includes both vehicles and structures with or without  wheels that can readily be moved from one site to another either under their own motive  power or by some other means.  NOTE: Includes temporary site offices, cloakrooms, meeting offices, dormitories, canteens,  toilets, workshops, site huts or other facilities provided on construction and demolition sites.  COPYRIGHT  ;\\S/~ZS 3012:2010  SECTION 2 INSTALLATION",
  "2.1.1": "2.1.1 Construction wiring  Construction wiring shall be supplied from- (a) an electricity distributor's main; or  (b) an existing switchboard in the permanent installation of the premises; or  (c) a low voltage generator complying with the principles of AS 2790, which shall be  installed in accordance with AS/NZS 30 I 0; or  (d) an inverter complying with the requirements of AS/NZS 4763(1nt).",
  "2.1.2": "2.1.2 Appliances, luminaires and electrical equipment  All appliances, luminaires and other electrical equipment shall be supplied from- (a) a final sub-circuit of the construction wiring, provided with overcurrent protection in  accordance with Clause 2.4.5.2 and additional protection 111 accordance with  Clause 2.4.6.1; or  (b) permanent wiring, provided with additional protection 111 accordance with  Clause 2.4.6.2; or  (c) a stand-alone power source, provided, where necessary, with additional protection in  accordance with Clause 2.4.6.3 or Clause 2.4.6.4, as applicable.",
  "2.1.3": "2.1.3 Identification of source of supply  Where there is more than one switehboard on site, each directly connected appliance shall  be legibly and indelibly marked to identify the switchboard at which its final sub-circuit  originates (see also Clause 2.3.2.1(f)).  Exception: This requirement does not apply to appliances connected by means o/a plug and  socket or to luminaires.",
  "2.1.4": "2.1.4 Connection devices  All plugs, socket-outlets and appliance couplers shall comply with AS/NZS 3112,  AS/NZS 3123 or r EC 60309 as applicable and shall have an I P rating appropriate for the  environment. Devices for interconnection of sub-mains shall be designed to prevent  inadvertent disconnection under load.  NOTE: Further guidance on IP ratings is provided in AS/NZS 3000.",
  "2.1.5": "2.1.5 Polarization  All plugs, fixed socket-outlets and cord extension sockets of single and multiphase shall be  connected so the polarity of the single phase complies with the requircments of  AS/NZS 3000 and the phase sequence of multiphase is the same for all fixed socket-outlets  and cord extension sets on a construction or demolition site.",
  "2.1.6": "2.1.6 Separate circuit requirements  One or more separate circuits shall be provided for each of the specific types of electrical  equipment listed below:  (a) Socket-outlets.  (b) Lighting points.  (c) Permanently connected welding equipment.  COPYRIGHT  AS/NZS 3012:2010 10  (d) Other specific electrical equipment as required by AS/NZS 3000.  (e) Transportable structures (see also Clause 2.9 and AS/NZS 3001).  (f) Auxiliary socket-outlet panels.",
  "2.3.1": "2.3.1 Location",
  "2.3.1.1": "2.3.1.1 General  All switchboards shall be installed in accordance with AS/NZS 3000.  All switchboards shall be readily accessible and shall be protected from damage during the  course of the construction or demolition work.  Every switchboard or part of a switchboard that is supplied from a separate source of supply  shall be legibly and indelibly marked to identify the source of supply from which it  originates.  NOTE: If the source of supply is a generating set. a unique identifier such as the plant number of  the generating set satisfies this requirement.",
  "2.3.1.2": "2.3.1.2 Distrihution hoards  Delete the requirement for a distribution switchboard on each level.",
  "2.3.2": "2.3.2 Switchboard construction",
  "2.3.2.1": "2.3.2.1 General requirements  All switchboards including those described in Clause 2.3.2.2 shall be constructed to comply  with the following requirements:  (a) Robust construction and materials to withstand mechanical damage from environment  or other external intluences that may be expected at the location.  (b) The enclosure shall have a degree of protection appropriate for the environment in  which it is installed subject to a minimum degree of protection of IPn.  (c) Live parts shall be effectively protected at all times against contact by persons  operating equipment located on the switchboard, including the connection or  disconnection of plugs to socket-outlets.  (d) Where the switchboard is provided with a socket-outlet, means to prevent strain at  connections or terminations, such as an insulated or covered tie bar, shall be provided  for the anchorage of external cables and flexible cords.  (e) Where provided with a door or lid to maintain degree of protection, the door or lid  shall- (i) require the use of a tool for removal; and  (ii) be fitted with a facility for locking; and  (iii) be fitted with a means of retention in the open position; and  COPYRIGHT  11 AS/NZS 3012:2010  (iv) not damage leads and allow the safe entry of leads if the switchboard is  provided with socket-outlets. A clearly visible and legible sign shall be fixed on  the external surface. For example words to the effect of 'KEEP CLOSED­ RUN ALL LEADS THROUGH BOTTOM'; and  (v) be kept closed except when access is required.  (f) Where there is more than one switchboard on the site, marking shall be provided, by  means of numbers, letters or both, to distinguish one switchboard from another.  (g) Switchboards shall be marked in accordance with Appendix E to indicate the presence  of live parts.  NOTE: Some Regulatory Jurisdictions require provision to be made on construction and  demolition switchboards supplying more than one final sub-circuit. for the fitting of a lockable or  sealable cover over circuit-breakers and ReDs associated with these circuits or other devices that  would control the resetting of circuit-breakers and ReDs, but does not prevent access to isolation  switches.",
  "2.3.2.2": "2.3.2.2 Alternative switchboard construction  Alternative switchboards shall comply with AS/NZS 3439.4 and the additional requirements  of Appendix K.  NOTE: Switchboards complying with AS/NZS 3439.4 are deemed to comply with 2.3.2.I(a), (b)  and (c).",
  "2.3.3": "2.3.3 Mounting of switchboards  Switchboards shall be securely attached to a pole, post, wall, floor or other structure unless  of a stable, freestanding design that takes into account any external forces that may be  exerted on the switchboard, for example, by flexible cords.",
  "2.3.4": "2.3.4 Socket-outlets  Socket-outlets provided on switchboards for the connection of portable appliances and other  electrical equipment shall be rated at not less than lOA.  NOTE: Where required all switchboards should be fitted with at least one 15 A or one 16 A,  single phase, socket-outlet. For example, such socket-outlets may be required to supply welders  and floor sanders.",
  "2.3.5": "2.3.5 Support of cables entering switchboards  At each switchboard, a fixed secure and stable means shall be provided to prevent  mechanical damage to flexible cords and cables and prevent the transfer of mechanical  strain to the cable connections (see Clause 2.5.3).  NOTE: An example of sLlch a means is to support flexible cords and cables above the floor or  ground on stands, cross-arms or similar, covered with material that is non-conducting.",
  "2.3.6": "2.3.6 Guide to arrangement of switchboards, wiring and equipment  Appendix J provides a diagram for guidance on the arrangement of construction systems.  Requirements on safety services are included.",
  "2.4.1": "2.4.1 Control  Each switchboard shall be provided with one isolating switch marked in accordance with  Clause 2.4.3 and complying with the requirements for isolating switches in ASfNZS 3000.  This switch shall interrupt supply to all final sub-circuits and sub-mains originating from  the switchboard, including circuits supplying socket-outlets mounted on the switchboard.  COPYRIGHT  AS/NZS 3012:2010 12  Exceptions:  (a) One additional switch may be provided, marked in accordance with Clause 2.4.3, for  the control o/allfinal sub-circuits intended 10 operate out a/normal working hours.  (b) Additional swilches controlling solely services, where required by ASINZS 3000, shall  be provided and clearly idel1t~fied, all in accordance with ASINZS 3000.  NOTE: Consideration should be given to generator supplies to ensure that the isolating switch  provides isolation from all incoming supplies",
  "2.4.2": "2.4.2 Securing of isolating switch  Isolating switches shall be provided with a means to prevent electrical equipment from  being inadvertently energised. The means of isolation shall be such that a deliberate action  in addition to the normal method of operation is required to energise the circuit.  The following methods are considered to satisfy this requirement- (a) provision for the fitting of a padlock; or  (b) location within a lockable space or enclosure.  NOTE: Warning  or (b) above.  or notices alone are not acceptable, but may be used in conjunction with (a)  Short-circuiting and earthing should be used only as a supplementary measure.",
  "2.4.3": "2.4.3 Marking of isolating switches  All isolating switches control I ing the portions of the installation included in Clause 2.4.1  shall be marked as required by AS/NZS 3000 and as follows:  'MAIN SWITCH'-on main switchboards.  'DISTRIBUTION BOARD ISOLATING SWITCH'-on distribution boards.  'ISOLATING SWITCH AFTER HOURS SUPPLY-DO NOT SWITCH OFF'-for circuits  supplying electrical equipment operating out of normal working hours.  Main switches for safety services shall be identified in accordance with AS/NZS 3000.",
  "2.4.4": "2.4.4 Size of marking  Letters used for marking referred to in Clause 2.4.3 shall not be less than 6 mm high and of  a contrasting colour to the background material.",
  "2.4.5": "2.4.5 Overload protection",
  "2.4.5.1": "2.4.5.1 Sub-mains  Devices for protection against overload and short-circuit currents in sub-mains shall be one  of the following types:  (a) Enclosed fuse-links complying with the appropriate Standard(s) in the AS 60269  series and be rated IP2X.  (b) Miniature overcurrent circuit-breakers  AS/NZS 60898. J.  complying  (c) Moulded-case circuit-breakers complying with AS 60947.2.  (d) Circuit-breakers complying with AS 60947.2.",
  "2.4.5.2": "2.4.5.2 Final sub-circuits  with AS 3111 and  Devices for protection against overload and short-circuit currents in final sub-circuits shall  be one of the following types:  (a) Miniature overcurrent  AS/NZS 60898.1.  circuit-breakers  COPYRIGHT  complying with AS 3111 and  \\3 AS/NZS 3012:2010  (b) Moulded-case circuit-breakers complying with AS 60947.2.  (c) Where supplying fixed appliances rated at 50 A per phase or greater, enclosed fuse­ links complying with the AS 60269 series of Standards and having a degree of  protection of at least IP2X when the removal carrier is inserted or removed.",
  "2.4.6": "2.4.6 Additional protection-basic protection (protection against direct contact) and  fault protection (protection against indirect contact)",
  "2.4.6.1": "2.4.6.1 Final sub-circuits o/'construction wiring  A II final sub-circuits of construction wiring shall be protected at the switchboard where the  final sub-circuits originate by residual current devices, with a maximum rated residual  current of 30 mA, that operate in all live (active and neutral) conductors. The final sub­ circuits shall be arranged-- (a) where the number of ReDs installed exceeds one; or  (b) where more than one lighting circuit is installed,  the lighting circuits shall be distributed between RCDs.  NOTE: This arrangement is intended to minimize the impact of the operation of a single ReD.  Exceptions: Additional protection by an ReD need not app~v to any o/the .fbllowillg types  offinal sub-circuit:  (i) Final sub-circuits supplying electrical equipment where safe mechanical operation is  at risk, e.g. electric cranes or personnel lifts.  (ii) Final sub-circuits where all appliances, luminaires and other electrical equipment  are supplied/rom a directly connected SELV or PEL V source in accordance with the  requirements ofA,)iNZS 3000/or extra low-voltage supply.  NOTE: A 110 V centre-lapped transj\"ormer to the requirements of AS/NZS 6/558.2.23 is  deemed to be a PEL V source of supp~y bul any circuits connected to the /ranc~f()rmer musl be  filled with plugs and sockets that are not interchangeable with other systems o/, supply (see  AS/NZS 3000).  (iii) Final sub-circuits where all appliances, luminaires and other electrical equipment  are supplied from a direct~v connected safety isolating tramformer complying with  ASINZS 6/558.2.23, supp~ying a separated circuit for electrical equipment installed  in accordance with the electrical separation requirements (~l ASINZS 3000 and with  each winding supplying not more than one item of Class J (earthed conductive parts)  electrical equipment.  NOTE: This description includes a single winding supplying one or more ilems of Class II  (double insulated) electrical equipment and a single \"winding supplying one item of Class f  (earthed conduclive parts) electrical equipment plus one or more ilems of Class 11 (double  insula/ed) electrical equipment.",
  "2.4.6.2": "2.4.6.2 Appliances, luminaires and other electrical equipment supplied by final sub­ circuits o/'permanenl inslallal ion wiring  Where appliances, luminaires and other eleetrieal equipment are supplied from a final sub­ circuit of the permanent installation, the equipment shall be proteeted by an RCD with a  maximum rated residual current of 30 mA located in accordance with one of the following:  (a) At the switchboard at the origin of the final sub-circuit.  (b) Incorporated into the socket-outlet supplying the electrical equipment.  (c) Ineorporated into a portable socket-outlet assembly complying with Clause 2.6.10,  arranged for connection to the supply socket-outlet either directly or by means of a  plug and flexible cord of maximum length 2 m.  COPYRIGHT  AS/NZS 3012:211 I I) 14  NOTE: This provision allows for construction or demolition work in eXlstmg premises that  involves the use of plug-in equipment, such as tools and task lighting, to be carried out using  existing socket-outlets that are in the vicin ity of the construction work. When the construction  work is more significant in terms of duration, scale or equipment, arrangements should be made  to have construction wiring and equipment insta lied that conforms to the requirements of th is  Standard.",
  "2.4.6.3": "2.4.6.3 Electrical equipment supplied by low-voltage generators  LV generators complying with the principles of AS 2790 shall be connected in accordance  with AS/NZS 30 I 0 and as follows:  NOTE: LV is any voltage exceeding 50 V a.c. or 120 V d.c. but not exceeding 1000 Va.c. or  J 500 V d.c. For example, welding generators with auxiliary circuits supplying J 15 V a.c. that do  not originate from an isolated winding is required to be RCD protected as per Clause 2.4.6.3(c).  (a) Where a site switchboard is supplied directly by a generator all sub-mains and final  sub-circuits originating at that switchboard shall be protected in accordance with  Clauses 2.4.5 and 2.4.6.1 as illustrated in Figure 2.1.  (b) Isolated winding generators, connected in accordance with Figure 2.2, shall only be  used on construction and demolition sites to supply a separated circuit for electrical  equipment, installed in accordance with the electrical separation requirements of  AS/NZS 3000. Each winding shall supply not more than one item of Class I (earthed  conductive parts) electrical equipment.  NOTES:  One or more items of Class II (double insulated) electrical equipment may be connected  to an isolated winding generator.  2 Portable ReDs will not operate as there is no neutral to earth connection upstream of the  RCD.  3 In some jurisdictions, the use of isolated winding generators is not permitted on  construction and demolition sites.  4 The 2 pole switching shown in Figure 2.2 is required as both conductors are considered to  be live-neither is earthed in normal operation.  5 The connection of the generating set bonding system to the general mass of earth through  an earth electrode is not required or recommended as there is double insulation from the  live parts to the frame.  6 On Iy one Class I item (one is based on probability) is allowed as the first fault from a live  part to earth makes it a non-isolated system.  (c) Generators providing electrical supply via permanently connected RCDs with  maximum rated residual current of 30 rnA, operating in all live (active and neutral)  conductors, and connccted as per Figure 2.3, may be used to supply multiple items of  equipment.  NOTES:  The RCD protected system allows the use of multiple Class ( (metal frame with a bonding  conductor) items as the first fault causes a residual current device to trip.  2 The connection of the generating set bonding system to the general mass of earth through  an earth electrode is not required or recommended. At 240 V a current of30 mA will not  flow if the fault path resistance exceeds 8 kn. Without an earth electrode the current is  reduced, but an RCD will operate at 30 rnA irrespective of the arrangement. The  protection required is given without an electrode. It is considered the possible fault  current should be as low as practicable and hence an electrode should NOT be used.  3 Th is principle does not app Iy to the M EN system where the neutral is earthed at the  source and at multiple points. (See Figure 2.1).  4 The following examples of fault current paths and currents (see Figure 2.3) have been  considered when deciding an earth electrode is not required:  COPYRIGHT  15 AS/NZS 3012:2010  (a) A fault between I ive parts and the equipotentially bonded exposed conductive parts such  as the frame of a Class I appliance or from the internal live parts of Class II appliances  to the bonding system.  (b) The fault path is from the live conductor through the fault to the equipotentially bonded  system to the neutral. The current is likely to exceed 30 rnA. The magnitude of the  current is not influenced by the presence or absence of an earth electrode.  (c) Fault between live parts and the mass of earth:  (i) Example A: A generator on the back o/' a truck The fault path is from  the live parts to the mass of earth-through the insulation resistance of the  tyres and truck tray parts to the generator frame, which is connected to the  neutral.  The tyres are high resistance so the current is low and the situation IS  similar to an isolated system. The current is likely to be below 30 mA  (ii) Example B: A general or resting on lhe mass earth The fault path is  from the live parts to the mass of earth through the casual resistance of the  generator frame which is connected to the neutral.  The casual resistance of the generator frame to the mass of earth may be  low so the current may exceed 30 rnA.  (iii) Example C: A generator with an earth elecfrode The fault path is from the  live parts to the mass of earth through the resistance of the earth electrode  to the generator frame which is connected to the neutral.  The earth resistance is lower than for Example B and the current is likely to  exceed 30 mA.",
  "2.4.6.4": "2.4.6.4 Electrical equipment supplied by inverters  Inverters used on construction and demolition sites shall comply with the requirements of  AS/NZS 4763(1nt) and be one of the following types:  (a) An RCD protected inverter (RCDP Inverter) with a maximum rated residual current  of30 mA.  (b) An isolated inverter.  Isolated inverters shall only be used on construction and demolition sites to supply a  separated circuit for electrical equipment, installed in accordance with the electrical  separation requirements of AS/NZS 3000. Each winding shall supply not more than one  item of Class I (earthed conductive parts) electrical equipment  NOTES:  AS/NZS 4763(1nt) requires identification of the classification, by the means given in  Paragraph HI.  2 One or more items of Class II (double insulated) electrical equipment may be connected to an  isolated winding inverter.  3 Wiring of dedicated battery storage systems for inverters should comply with AS/NZS 3000,  Clause 7.8. Battery storage systems should comply with AS 4086.2.",
  "2.4.6.5": "2.4.6.5 Permanent wiring located where construction or demolition work may be carried  out  Permanent wiring located where construction or demol ition work may be carried out shall  be considered to be energised until proven otherwise by inspection and testing.  All energized permanent wiring located where construction or demolition work may be  carried out shall be suitably identified and assessed for the risk of mechanical and  environmental damage from construction activities. If a risk of damage exists, such wiring  shall be protected in accordance with Clause 2.5.3.  COPYRIGHT  AS/NZS 3012:2010 16  NOTE: Particular care should be taken with permanent wiring located in ceiling spaces. All  permanent wiring should be considered to be live until proven otherwise.",
  "2.4.7": "2.4.7 Switching of single-phase socket-outlets  Every single-phase socket-outlet in the following situations shall be individually controlled  by a double-pole switch- (a) Portable generators of the isolated winding type fitted with integral socket-outlets;  (b) Portable inverters of the isolated type fitted with socket-outlets;  (c) Portable socket-outlet assemblies;  (d) In Australia only, on or in transportable structures that are connected to supply by a 0  flexible cord and plug; and  (e) Socket-outlets on equipment that is supplied by means of a plug and socket.  NOTE: Socket-outlets may be either the type with a manual switch or an integral switch that  switches on when the plug top is inserted and switches off when it is removed.  Generator complying with  the principles of AS 2790  ---1  Switchboard including main Residual current  isolating switch and residual  current devices  L_S i t ~ .. S ~ It c h boar d  Neutral  MEN  Sub-main Final sub-circuits  FIGURE 2.1 CONNECTION FROM STAND-ALONE GENERATOR TO SITE  SWITCHBOARD WITH AN MEN LINK AND ELECTRODE  COPYRIGHT  Generator complying with  the principles of AS 2790  l Fr ame connection r-h  17  Equipotential  bond  AS/NZS 3012:2010  (active  conductors required  FIGURE 2.2 ISOLATED WINDING GENERATOR WITH INTEGRAL SOCKET-OUTLETS  COPYRIGHT  AS/NZS 3012:21110  Generator complying with  the principles of AS 2790  L Frame connection  18  current  (RCD)  NE connection, upstream  of RCD, to equipote'ltial  bonding conductor  bonding conductor  FIGURE 2.3 GENERATOR WITH INTEGRAL RCD PROTECTED SOCKET-OUTLET",
  "2.5.1": "2.5.1 Cables and fittings  Cables and fittings used in construction wiring shall comply with the requirements of  AS/NZS 3000.  NOTE: The requirements of AS/NZS 2802 apply to trailing cables used for surface wiring.",
  "2.5.2": "2.5.2 Installation of cables  Cables shall be installed in accordance with AS/NZS 3000 except as varied in Clauses 2.5.3  to 2.5.8 below. Construction wiring shall not be tied, bundled or grouped with permanent  wiring.",
  "2.5.3": "2.5.3 Protection against mechanical damage  A risk assessment should be undertaken, prior to the installation of cables or whenever a  change occurs, as to the likelihood of the cables being exposed to mechanical damage.  Where the risk assessment identifies a risk of damage to cables, and the cables cannot be  relocated to an alternative position. they must be protected by a suitable enclosure or barrier  not less effective than- (a) medium duty rigid or corrugated conduit of insulating material; or  (b) heavy duty rigid or corrugated conduit of insulating material; or  (c) flexible electrical hose; or  (d) armoured cable; or  (e) other means that provide equivalent protection against mechanical damage.  AS/NZS 3000 provides guidance in Appendix H.  COPYRIGHT  19 AS/NZS 3012:2010  Where a risk assessment is not undertaken, protection against mechanical damage by the  use of a suitable enclosure or barrier not less effective than Items (a) to (e) above shall be  provided.  NOTE: The following are typical examples of situations where cables may require mechanical  protection:  (a) Cables run within 2.5 m of the floor or ground level.  (b) Cables run on exterior surfaces and in close proximity to scaffolding.  (c) Cables supplying switchboards and final sub-circuits to equipment located on formwork  decks.  (d) Cables run on the site's perimeter fencing that are securely fixed in pOSItIOn, C.g. by  securing the posts in the ground or by fixing to another secure structure. Cabling is NOT to  be attached to free-standing fencing.  (e) Ca bles s lung under a concrete cei ling s lab more than 150 mm a way from the juncture of the  ceiling slab and a wall or beam that would otherwise provide protection.  (f) Cables coming in close proximity to unearthed metal structures being installed as part of the  construction process (for exam p Ie sheet meta I ducts and hydrau I ic piping).  (g) Cables run across the top of transportable structures, storage containers, shipping containers  or the like.  (h) Cables run across or over metallic roofs or edges.  (i) Cables run in adverse environments.",
  "2.5.4": "2.5.4 Marking  Construction wiring shall be readily distinguishable from permanent wiring by using cable  sheaths of a different colour or by attaching iridescent yellow tape spaced at intervals not  exceeding 5 m and marked with the words 'construction wiring'. If live permanent wiring is  located where construction activity is occurring it, or its location, shall be marked as live  with the words 'live wiring' at intervals not exceeding 5 m. Live permanent wiring shall be  readily distinguishable from construction wiring.  NOTE: Unidentified wiring is deemed to be live.",
  "2.5.5": "2.5.5 Use of unarmoured cables  Unarmoured cables shall not be installed on metallic roofs or similar structures unless  suitably protected against mechanical damage.",
  "2.5.6": "2.5.6 Location and marking of overhead wiring (including aerial and catenary  wiring)  Overhead wtrlng should be positioned to avoid crossing roadways or access ways where  cranes, high loads or heavy machinery may travel.  Where it is not possible to avoid access ways, an effective means shall be provided to  minimize the risk of vehicular contact with the overhead wiring system.  This condition may be satisfied by the placement of flagged catenary wlfes or cables of  suitable material across the access way- (a) 6 m on either side of the overhead wiring; and  (b) 0.6 m below the lowest point of the overhead electrical cables or lower.",
  "2.5.7": "2.5.7 Type of aerial conductor  All aerial conductors installed on construction and demolition sites shall be insulated.  NOTES:  I Where underground or bare aerial conductors owned by the electricity distributor are located  on or near the site it is recommended the electricity distributor be consulted about de­ energizing, providing adequate safety clearances, or insulating the conductors, as applicable.  2 Local regulations may prohibit the use of aerial conductors in bushfire-prone areas.  COPYRIGHT  AS/NZS 3012:2010 20",
  "2.5.8": "2.5.8 Cables supported by a catenary  Cables supported by means of a catenary shall be stranded or flexible cables affording  double insulation or the equivalent of double insulation.  Cables supported by a catenary shall maintain clearances in accordance with AS/NZS 3000.  NOTE: Local regulations may prohibit cables supported 011 catenaries in bushfire-prone areas.",
  "2.6.1": "2.6.1 General  Clause 2,6 applies to the following:  (a) Flexible cords  Exception: This clause does not apply to flexible cords that are:  (i) permanently attached to elecfric:al equipment; or  (if) 5 m or less in length.  (b) Accessories used to connect electrical equipment to switchboards.  (c) Flexible cables.  (d) Cord extension sets.  Cord extension sets shall comply with AS/NZS 3199 except as varied by Clauses 2.6.2 to",
  "2.6.9": "2.6.9 Protection of flexible cords or cables  Flexible cords and cables shall not be subject to mechanical damage, damage by liquids or  damage by high temperatures.  Where flexible cords or cables supplying electrical equipment are more than 4m in length or  are not in view of the person using the electrical equipment, they shall be- (a) provided with suitable protection against, or located where they are not subjected to,  mechanical damage, damage by liquids or high temperature; or  (b) supported off the floor or ground on stands or hangers covered with material that is  non-conducting and will prevent mechanical damage to the cable.",
  "2.6.2": "2.6.2 Minimum conductor size and core configuration  The minimum cross-sectional area of each conductor in a flexible cord shall be 1.0 mm 2 •  Flexible cords shall contain an earthing conductor in addition to the live conductors.",
  "2.6.3": "2.6.3 Type of flexible cord and cable  Flexible cords used in cord extension sets shall be heavy duty sheathed and shall comply  with ASINZS 3191. Flexible cable shall comply with AS/NZS 5000.",
  "2.6.4": "2.6.4 Colour  The sheath of a flexible cord shall not contain the colour green.  NOTE: This is to avoid potential confusion with individual earthing conductors.",
  "2.6.5": "2.6.5 Current-carrying capacity  Every conductor shall have a current-carrying capacity not less than the current it IS  expected to carry.  This current-carrying capacity shall be determined in accordance \\\"ith- (a) in Australia, AS/NZS 3008.1.1; or  (b) in New Zealand, AS/NZS 3008.1.2.  NOTE: ASiNZS 3000 gives details on simplified protective device selection.",
  "2.6.6": "2.6.6 Accessories for connection  Cord extension sets shall be fitted with the following accessories for connection:  (a) A plug in accordance with­ (i) AS/NZS 3 I 12; or  (ii) AS/NZS 3123; or  (iii) lEe 60309.  COPYRIGHT  21  (b) A cord extension socket in accordance with~  (i) AS/NZS 3120; or  (ii) ASINZS 3123: or  (iii) I EC 60309.  AS/NZS 3012:2010  Double adaptors and 3-pin plug adaptors (piggyback) or similar fittings shall not be used on  construction and demolition sites.",
  "2.6.7": "2.6.7 :vIaximum length  The maximum length of a tlexible cord, for a given conductor cross-sectional area, shall  comply with Table I.  COPYRIGHT  ASfNZS 3012:2010 22  TABLE 1  MAXIMUM LENGTHS OF FLEXIBLE CORDS ANI) FLEXIBLE CABLES  I 2 3 4 :; 6  i  Maximum length of flexible cords and cables, in metres  Specific use for circuits where the  General use safety of J)ersonnel utilising the  (length based on 5% voltage droll equipment is deJ)endent on the  Rated Conductor reliable starting of motors.  current area at rated current) (length based on 3% voltage droJ)  at rated current)  ! Single phase 3 Three phase 4 Single phase 3 Three phase 4  core cable core cable core cable core cahle  (L, N, E) (U, L2, L3, E) (L, N, E) (LI, L2, L3, E)  (A) (mm 2 ) (m) (m) (m) (m)",
  "1.0": "1.0 25 50 15 30",
  "1.5": "1.5 25 50 15 30",
  "4.0": "4.0 100 200 60 120",
  "6.0": "6.0 75 150 45 90",
  "10.0": "10.0 130 260 75 ISO  NOTES  I'he lengths for 4 core cables above assume a balanced three phase load.  2 Examples of equipment covered in Columns 5 and 6 arc trailing cables ror suspended scarrolds.  swing stages and false cars.  3 Examples of equipment covered in Columns 3 and 4 are tools including saws. grinders and drills.  4 The percentage voltage drops given are in addition to the S'Yo maximum voltage drop allowed in the  installation to the point of connection.",
  "2.6.8": "2.6.8 Limitations on the use of cord extension sets  Delete (a) and replace with:  When used in domestic housing construction, be confined to not more than one storey up or  down from the storey of the switchboard from which they originate and be mechanically  protected in accordance with AS/NZS 3000 at the transition between storeys and in places  where damage is likely to occur.  COPYRIGHT  37 AS/NZS 3012:2010  APPENDIX C  CLASSIFICATION OF BUTLDINGS AND STRUCTURES  (Informative)  Cl PRINCIPLES OF CLASSIFICATION  The classification of a building or part of a building is determined in the Building Code of  Austral ia (BCA) by the purpose for which it is designed, constructed or adapted to be used.  The classifications listed below are taken directly from the BCA.  For the purposes of this Standard, Classes 1, 2 and 10 below are considered to be domestic  housing construction.  C2 CLASSIFICATIONS  Buildings are classified as follows:  (a) Class J-one or more buildings that in association constitute- (i) Class la-a single dwelling being­ (A) a detached house; or  (B) one of a group of two or more attached dwellings, each being a building  separated by a fire resisting wall, including a row house, terrace house,  town house or villa unit; or  (ii) Class I b-a boarding house, guest house, hostel or the like  (A) with a total area of all 1100rs not exceeding 300 m 2 measured over the  enclosing walls of the Class I b building; or  (B) In which not more than 12 persons would ordinarily be resident;  which is not located above or below another dwelling or another Class of building  other than a private garage.  (b) Class 2-a building containing two or more sole-occupancy units each being a  separate dwelling.  (c) Class 3-a residential building, other than a building of Class 1 or 2, which is a  common place of long term or transient living for a number of unrelated persons,  including- (i) a boarding house, guest house, hostel, lodging house or backpackers  accommodation; or  (ii) a residential part of a hotel or motel; or  (iii) a residential part of a school; or  (iv) accommodation for the aged, children or people with disabilities; or  (v) a residential part of a health-care build;ng that accommodates members of  staff, or  (vi) a residential part of a detention centre.  (d) Class 4-a dwelling in a building that is Class 5,6,7,8 or 9 if it is the only dwelling  in the building.  (e) Class 5-an office building used for professional or commercial purposes, excluding  buildings of Class 6, 7, 8 or 9.  COPYRIGHT  AS/NZS 3012:2010 38  (I) Class 6-a shop or other building for the sale of goods by retail or the supply of  services direct to the public, including- (i) an eating room, cafe, restaurant, milk or soft-drink bar; or  (ii) a dining room, bar area that is not an assemhZy building, shop or kiosk part of a  hotel or motel; or  (iii) a hairdresser's or barber's shop, public laundry or undertaker's establishment;  or  (iv) a market or sale room, showroom or service station.  (g) Class 7---a building that is- (i) Class 7a-a carpark; or  (ii) Class 7b-for storage or display of goods or produce for sale by wholesale.  (h) Class 8-a laboratory or a bu i Id i ng in wh ich a hand icraft or process for the  production, assembling, altering, repairing, packing, finishing or cleaning of goods is  carried on for trade, sale or gain.  (i) Class 9-a building of a public nature- (i) Class 90-a health care building, including those parts of the building sct aside  as a laboratory; or  (ii) Class 9b-an assembly building, including a trade workshop, laboratory or the  Ijke in a primary or secondary school, but excluding any other parts of the  building that are of another Class; or  (iii) Class 9c-an aged care building.  (j) Class 10-a non-habitable building or structure- (i) Class 10a-a non-habitable building being a private garage, carport, shed or  the like; or  (ii) Class 10b-a structure being a fence, mast, antenna, retaining or free-standing  wall, swimming pool or the like.  COPYRIGHT  39  APPENDIX D  REGULArORY APPLICATION ON CONSTRUCTION AND  DEMOLITION SITES  (Informative)  1)1 GENERAL  Compliance with this Standard is a requirement of AS/NZS 3000.  AS/NZS 3012:2()IO  Relevant regulatory authorities in the Australian States and Territories and in New Zealand  require compliance with this Standard under their various regulatory instruments and may  also provide requirements in addition to this Standard in relevant legislation or Industry  Codes of Practice.  The purpose of this Appendix is to provide details of the relevant authorities that enforce  regulations on electrical installations of construction and demolition sites in each of the  Australian States and Territories and in New Zealand.  This information is accurate at the time of publication of this Standard. Users are advised to  consult the relevant nominated regulatory authority for information current at the time of  lise.  D2 REGULATORY AUTHORITIES AND REGULATORY INSTRUMENTS  D2.1 New South Wales  WorkCover NSW, as the State OHS Regulator, applies regulation to electrical installations  at construction and demo I ition sites.  WorkCover NSW has adopted AS/NZS 3012 (this Standard) under its 'Code 0.1\" Practice~  Technical guidance'. The Code provides practical guidance for NSW employers and other  persons in meeting their obligations under the Occupational Health and Safety Regulations  200l.  An earlier NSW Code of Practice, 'Electrical practices for cons/ruction work' also covers  the verification (inspection and testing) of electrical installations and electrical equipment  on construction sites. In the event of any inconsistencies between AS/NZS 3012 and the  Code of Practice, the NSW Code prevails.  Contact details:  WorkCover NSW  I nformation Centre: Phone: 13 10 50  Head office:  92-100 Donnison Street  GOSFORD NSW 2250  Postal address:  Locked Bag 2906  LlSAROW NSW 2252  Telephone: (02) 4321 5000  Facsimile: (02) 4321 4145  Webs ite: ~~~.~.~'-2 ... ~~'.'~~::':\"\"'--~'''''  COPYRIGHT  AS/NZS 3012:2010 40  The NSW Department of Primary Industries, Mine Safety Operations is the OHS Regulator  for NSW Mines. Compliance to AS/NZS 3000 is mandatory in mining legislation.  AS/NZS 3012 is normative a reference within AS/NZS 3000.  Contact details:  NSW Department of Primary Industries, Mine Safely Operations  516 High Street  MAITLAND NSW 2320  Postal address:  PO Box 344  HUNTER REGION MAIL CENTRE NSW 2310  Telephone: (02) 4931 666  Facsimile: (02) 4931 6790  Website: www.dpi.nsw.gov.au  D2.2 Victoria  In Victoria regulation of electrical installations on construction and demolition sites is a  joint responsibility of Energy Safe Victoria [ESV] and WorkSafe Victoria [WorkSafe].  AS/NZS 3000 is called up by the Electricity Act 1998 and the Electricity (Installation)  Regulations 2009. AS/NZS 3012 is given the status of a mandatory compliance document in  AS/NZS 3000.  WorkSafe is responsible for regulating the Occupational Health and Safety Act and  Regulations  Victoria also has an Industry Guideline that provides advice on compliance to this Standard.  Some construction sites may have requirements in addition to the minimum safety  requirements set out in this Standard.  Contact details:  Energy Safe Victoria  Level 3  4 Riverside Quay  SOUTHBANK VIC 3006  Postal address:  PO Box 262  COLLINS STREET WEST VIC 8007  Telephone: (03) 9203 9700  Facsimile: (03) 9686 2197  Website: ':\"\".'.:'\"'-'..':;.\"''''~: ... ::_:.=~'=.  WorkSafe  WorkSafe Advisory Service 1800 136089  WorkSafe Incident Notification 132360  Website: .YX}~~Ql.!\\&'l.15-,-Xlf~D~t!1I ..  COPYRIGHT  41 AS/NZS 3012:2010",
  "2.6.10": "2.6.10 Portable socket-outlet assemblies (PSOAs)  Portable socket-outlet assemblies shall comply with the requirements of a Class H portable  residual current device to AS/NZS 3190 and include, where not specifically stated as  requirements of the above-mentioned Class H portable residual current devices or socket­ outlet assemblies, the following:  (a) The enclosure shall be constructed of a suitable impact resistant and durable material  and shall be of Class II (double insulated) construction.  (b) Socket-outlets mounted on the assembly shall- (i) comply with AS/NZS 3112, AS/NZS 3123 or IEC 60309;  (ii) be protected against damage by suitable means such as covers or extended  sides;  (iii) if single phase, be individually controlled by a double-pole switch; and  (iv) shall have a degree of protection appropriate for the environment, subject to a  minimum degree of protection of IP33.  (c) The flexible cord supplying the assembly shall be- (i) of the heavy duty sheathed type complying with AS/NZS 3191 ;  (ii) fitted with a plug complying with AS/NZS 3112, AS/NZS 3123 or IEC 60309;  and  (iii) a maximum length of2 m.  (d) The assembly shall incorporate overload protection with a rating no greater than the  rating of the flexible cord and plug supplying the assembly. Where three or more  socket-outlets are fitted to the assembly, overload protection shall be provided by a  miniature overcurrent circuit-breaker complying with AS 31 11, AS/NZS 60898.1 or  AS/NZS 60898.2. The socket-outlet rating sha II not exceed the rating of the overload  protection device, i.e. a lOA assembly shall not be fitted with 15 A socket-outlets.  (e) All socket-outlets mounted on these assemblies shall be protected by a RCD with a  maximum rated residual current of 30 mA that operates in all live (active and neutral)  conductors.  (0 The assembly shall be marked. to indicate compliance with this Standard.*  NOTES:  I These assemblies may be single-phase or three-phase.  2 For the purpose of calculating the maximum allowable length of flexible cord (from Table 1),  the length of the supply flexible cord to the portable socket-outlet assembly should be taken  into account.  3 As a PSOA is a type of portable RCD (PRCD), it is a declared article and must comply with  the relevant requirements of AS/NZS 3190 and have regulatory approval.  * Applicable 2 years after publication of this Standard.  COPYRIGHT  AS/NZS 3012:2010 24",
  "2.6.11": "2.6.11 Auxiliary socket-outlet panels  Auxiliary socket-outlet panels shall be constructed to comply with the following general  requirements:  (a) The panel shall be- (i) of robust construction and materials to withstand mechanical damage from thc  environment or other external influences that may be expected at the location;  (ii) located at a height of between 1.2 to 2 m above the floor and mounted securely  to a permanent structure or a temporary structure that has been specifically  designed for the purpose;  (iii) provided with an isolating switch controlling the incoming supply, with the  switch clearly marked to indicate its function unless the function of the switch  is obvious;  (iv) supplied by a dedicated final sub-circuit protected at the switchboard where the  final sub-circuit originates by an RCD, with a maximum rated residual current  of 30 rnA, that operates in all live (active and neutral conductors) in accordance  with Clause 2.4.6.1 and a circuit-breaker in accordance with Clause 2.4.5  (v) provided with means to prevent mechanical damage to outgoing cables and  relieve strain on plug and socket-outlet connections of flexible cords; and  NOTE: A typical means of achieving this is by providing a support (e.g. tie bar,  hanger, cross arm or stand) covered with a non-conductive material to which the cables  can be anchored.  (vi) labelled in accordance with Clause 2.1.3 to indicate the source of supply.  (b) The panel shall have a degree of protection appropriate for the environment in which  it is installed subject to a minimum degree of protection IP23.  (c) Socket-outlets mounted on the panel shall-- (i) comply with ASiNZS 3.112, AS/NZS 3 J 23 or I EC 60309; and  (ii) be protected against damage by extended sides or covers; and  (iii) be rated at not less than lOA and be individually controlled by a double pole  switch.  (d) The cable from the switchboard to the panel is construction wiring and shall be- (i) a minimum cross-sectional area of 4 mm 2 for active and neutral conductors and  corresponding 2.5 mm 2 earth conductors;  (ii) when used in multistorey buildings, confined to the storey of the switchboard  from which they originate, except in lift shafts, service shafts, mezzanine  levels, stairwells, form work or external staging;  (iii) compliant with the ASI1\\lZS 5000 series;  (iv) identified in accordance with Clause 2.5.4; and  (v) protected, where required, from mechanical damage 111 accordance with  Clause 2.5.3.",
  "2.6.12": "2.6.12 Electrical portable outlet devices (EPODS)  Electrical portable outlet devices to AS/NZS 3105 (e.g. domestic type power boards) do not  comply with the requirements of Clauses 2.6.10 or 2.6.11 and shall not be used on  construction and demolition sites.  COPYRIGHT  25 AS/I'\\ZS 3012:2010",
  "2.7.1": "2.7.1 Generallighting  Recommended mll1lmUm lighting levels are 40 Ix for walkways and 160 Ix for general  areas.",
  "2.7.2": "2.7.2 Mechanical protection  Lamps in luminaires shall be protected against mechanical damage.",
  "2.7.3": "2.7.3 Emergency evacuation lighting  Emergency evacuation lighting, when required, shall be sufficient to allow safe egress from  the site.  As a minimum requirement, sufficient battery-powered lighting shall be installed in  stairways and passageways and adjacent to switchboards to allow safe access to and egress  from the area if there is insufficient natural lighting. Emergency lighting at a minimum  level of 20 Ix shall be provided for a minimum of one hour following loss of normal  lighting in the area.  Guidance on appropriate spacings for luminaires can be found in AS 2293.1.  Internally illuminated emergency evacuation signage may be integrated in an eXlstlllg  emergency lighting system providing that system of lighting incorporates battery backup  light fittings capable of illuminating the exit signage and providing clear direction on the  safe means of egress from the workplace in the event of power fai lure.",
  "2.7.4": "2.7.4 Hand-held luminaires  Hand-held luminaires shall comply with AS/NZS 60598.2.8.",
  "2.7.5": "2.7.5 Edison screw type lamphoJders  Every low voltage edison screw lampholder shall be connected to the supply so that, where  a neutral conductor is required, it shall be connected to the outer contact.",
  "2.7.6": "2.7.6 Festoon lighting  (a) Festoon lampholders shall be permanently moulded to their supply cable and shall be  provided with a non-conductive mechanical guard for the lamp.  (b) The maximum permitted operating voltages for festoon lighting are:  (i) In Australia, extra-low voltage (::;;50 Va.c.).  (ii) In New Zealand, low voltage (e.g. 230 V a.c.) provided the circuit is protected  by 30 mA ReDs, as detailed in Clause 2.4.6.  (c) Festoon lighting shall be supported at least 2.5 m above any floor, ground, platform  or working area or be installed immediately below a ceiling.  Exception: This requirement need no! apply in stairwells, i{it shafts, and service  shafis where adequate support shall provided.",
  "2.7.7": "2.7.7 Portable luminaires  Portable luminaires shall be provided with the following:  (a) A minimum degree of protection IP2X in accordance with AS 60529.  (b) A mechanical guard for the lamp.  (c) Adequate stability.  COPYRIGHT  AS/NZS 3012;20111 26",
  "2.8.1": "2.8.1 General  Construction wiring dedicated to the installation of lift shaft equipment shall consist of a  separate final sub-circuit protected in accordance with Clause 2.4.6.1.  Circuit breakers shall be locked and tagged to prevent inadvertent isolation of supply to the  lift shaft by others on the site.  Lift shaft lighting shall be supplied from either construction wiring or permanent wiring  and should conform with the following minimum requirements:  (a) Luminaires should be-·  0) at a minimum lighting level equivalent to that provided by a 36 watt tluorescent  and suitably guarded against mechanical damage:  (ii) connected to supply via a plug and socket arrangement; and  (iii) installed at intervals not exceeding 6 m with the uppermost fixture installed  within I m of the top of the lift shaft.  (b) The relevant requirements of AS 1735.2 apply where lighting is installed and  intended to be part of the permanent lift installation.",
  "2.8.2": "2.8.2 Multiple lift shafts  Where a lift shaft will contain more than one lift, the vertical space provided for one lift  should be provided with effective illumination from the vertical space provided for the  immediately adjacent lift.",
  "2.8.3": "2.8.3 Emergency lighting  Emergency lighting at a minimum level of 20 lux shall be provided for a minimum duration  of one hour following loss of normal lighting to allow safe egress from the lift shaft. (Refer  to the relevant requirements of AS!NZS 1680.0).  Emergency lighting shall be positioned so that persons can exit at each egress point from  the lift shaft.",
  "2.8.4": "2.8.4 False-car (Guided work platform)  Where false-cars are installed for the purpose of the installation of lift shaft equipment,  construction wiring for electrical supply to the false-car should conform to the following  requirements:  (a) Be supplied from a minimum 230 V, 20 A socket-outlet on a separate final sub-circuit  protected by a 30 mA residual current device that operates in all live (active and  neutral) conductors. The supply should be provided for the sale purpose of providing  adequate power to the climbing hoist, including task lighting and power for the use of  electrical tools when working from the false-car working platform.  (b) Electrical wiring providing supply to the false-car working platform shall be heavy  duty double insulated flexible cord or cable with a minimum conductor size of 4 mm 2 •  (c) 'rhe flexible cord or cable should be~  (i) secured at the top of the lift shaft and at the point of attachment to the false-car  by suitable means to prevent mechanical damage:  (ii) suspended in the lift shaft in a manner that will ensure adequate running  clearance between the false-car and the lift shaft to prevent fouling or  mechanical damage to the cord or cable; and  (iii) of sufficient length to allow for free travel of the false-c·ar throughout the length  of the lift shaft.  COPYRIGHT  27 ;\\S/NZS 3012:2010",
  "3.1": "3.1 0 DOCUMENTATION  Records of inspection and tests shall be kept. All the following should be recorded:  (a) A register of all equipment.  (b) A record of formal inspection and tests.  (e) A repair register.  (d) A record of all faulty equipment.  (e) For construction wiring:  (i) Visual inspection-date, checklist (as per AS/NZS 3000 checklist).  Oi) Continuity of earthing system-values obtained for main earth, bonding earth  and protective earth.  (iii) Insulation resistance value.  (iv) Polarity-checklist.  (v) Correct circuit connections-checklist.  (vi) RCD-values for trip time.  NOTE: Electronic records are acceptable.  Where an item is not tagged, in accordance with Clause 3.8.3, records shall be available on  site for audit or made available for audit on the next working day.  In addition, electrical regulators may require further documentation for compliance of the  installation and electrical work.  NOTE: The existing State regulatory requirements for certification of electrical work may be used  for the documentation required in 3.10(e) subject to the recording of values. Copies of the  certification are retained by the electrician and the builder or owner/occupier.  COPYRIGHT  AS/NZS 3012:2010  AS  1735",
  "3.4.1": "3.4.1 Initial verification  All construction wiring, including switchboards, fixed RCDs and transportable structures,  shall be verified (inspected and tested) in accordance with AS/NZS 3000 following initial  installation.",
  "3.4.2": "3.4.2 Periodic verification  Construction wiring (including switchboards and transportabLe structures) shall be visually  inspected to verify the integrity of the installation at intervals not exceeding those specified  in Table 3. RCDs shall be tested in accordance with Clause 3.5. Faults shall be rectified in  accordance with Clause 3.8.1.  In New Zealand only, complete a construction and demolition verification certificate after INZI  completion of the verification detailed in Clause 3.4.2 .  NOTE: A suitable form is contained in Appendix I.",
  "3.6.1": "3.6.1 General  All other electrical equipment on site, including power tools, flexible cords, cord extension  sets and portable socket-outlet assemblies, shall be tested in accordance with Clauses 3.6.2  and 3.6.3, as appropriate, and inspected in accordance with the methods of AS/NZS 3760,  before being put into service and thereafter at intervals not exceeding those listed in Table 3  of this Standard.",
  "3.6.2": "3.6.2 Protective earthing continuity  All Class I (earthed conductive parts) electrical equipment shall have the continuity of the  protective earthing conductor from the plug earth pin or supply point to exposed conductive  parts tested in accordance with the requirements of AS/NZS 3760.  The measured earthing conductor resistance values shall be less than the maximum values  given in AS/NZS 3760.  NOTE: In accordance with AS/NZS 3760, equipment should not be dismantled to perform these  tests.",
  "3.6.3": "3.6.3 Insulation resistance or leakage current  The insulation resistance or leakage current of Class I (earthed conductive parts) and  Class II (double insulated) electrical equipment shall be tested in accordance with the  method given in AS/NZS 3760, except that, for fixed equipment, the insulation resistance  shall be measured from the earth terminal of the equipment rather than the earth pin of a  plug.  The insulation resistance values measured shall be not less than the minimum values given  in AS/NZS 3760.  COPYRIGHT  31 AS/NZS 3012:2010",
  "3.6.4": "3.6.4 Arc welding equipment  Where arc welders are incorporated into generating sets, tests shall be conducted to ensure  that the insulation resistances are not less than those given in Table 2.  TABLE 2  MINIMUM INSULATION RESrSTANCI!:  Minimum insulation  Parts to be tested resistance  (MO)  Input circuit (including control to Welding circuit (including 5 circuits connected to it) control circuits connected [0 it)  All circuits to Exposcd conductive pans 2.5  Wclding circuit (including Any auxiliary circuit that  to operates at a voltage exceeding 10 control circuits connected to il) extra-low-voltage  Welding circuit (including Any auxiliary circuit that  control circuits connected to it) t.o operates at a voltage not I  exceeding extra-low-voltage  Separate \\velding circuit to Scparatt: welding eircui(* I  * In the case or multiple welding circuit outlets.",
  "3.8.1": "3.8.1 Construction wiring  Where a visual inspection identifies damage or non-eompliance with this Standard, that part  of the installation shall be isolated, repaired or replaeed and tested as required.",
  "3.8.2": "3.8.2 Non-compliant equipment  Where inspection or testing identifies equipment that fails to comply with the criteria given  in this Standard, the equipment shall be- (a) withdrawn from service immediately, have a label attached to it warning against  further use; and  (b) sent for repair, disposal or destruction by an authorized repair agent or service  personnel.  COPYRIGHT  AS/NZS 3012:2010 32",
  "3.8.3": "3.8.3 Compliant equipment  New equipment, after inspection and tests shall be fitted with a durable, non-reusable, non­ metallic tag. Construction wiring, switchboards, fixed ReDs, fixed and transportable  electrical equipment need not be tagged.  Following periodic verification (inspection and testing), compliant equipment shall be re­ tagged. The items covered in Clause 3.4.2 need not be tagged.  The tag, which may be colour coded to identify the period in which the test was performed,  shall include the~  (a) name of the person or company who performed the tests; and  (b) test or re-test date.  NOTE: Appendix F gives a recommended colour coding schedule for tags on compliant  equipment  TABLE 3  PERIODIC VERIFICATION INTERVALS  1 2 3 4 5 6 7  Transportable structures, Class I  (earthed conductive parts) and Residual current devices  Class II (doubled insulated) (RCDs)  electrical equipment  Transportable Pushbutton test Operating time  Environment structuresl, fixed (by user) (RCD tester)  and  transportable Portable  equil)ment2 and equipment 4 Non- Non- construction PortableS portable Portables,7 portable  wi ring3 including fixed6 fixed6  switchboards  Construct ion 6 3 After 1 3 12  and months months connection to a month months months  demolition socket or  sites in before  accordance connection of  with equipment, and  Clause 1.1 at least once  every day in  usc.  NOTES:  In New Zealand, verification (inspection and testing) intervals ror transportable structures do not apply.  2 rransportablc structures and fixed and transportable electrical equipment (Clause 3.6).  3 Construction wiring including switchboards (Clause 3.4),  4 Portable equipment-applianees, llexible cords, cord extension sets, PSOAs. generators. inverters,  (Clause 3.6) excluding hire equipment (sec Clause 3,2(e)).  5 Portable RCD includes RCDs on portable equipment, or ReDs associated with portable gcnerutors  (Clause 3.5) or I~CD protected inverters,  6 See Clause 3.5 ror details or the required test.  7 Includes conneetion between generator winding and equipotential bonding system (Clause 3.7),  COPYRIGHT  33 AS/NZS 3012:2010",
  "1735.2": "1735.2  2293",
  "2293.1": "2293.1  2790  31 J I  4086",
  "4086.2": "4086.2  60269  60529  60947",
  "60947.2": "60947.2  AS/NZS  1680",
  "1680.0": "1680.0  2802  3000  3001  3008  34  APPENDIX A  LIST OF REFERENCED DOCUMENTS  (Normative)  Lifts, escalators and moving walks  Part 2: Passenger and goods lifts-Electric  Emergency escape lighting and exit signs for buildings  Part I: System design, installation and operation  Electricity generating sets-Transportable (Up to 25 kW)  Approval and test specification-Miniature overcurrent circuit-breakers  Secondary batteries for use with stand-alone power systems  Part 2: Installation and maintenance  Low-voltage fuses (all parts)  Degrees of protection prov ided by enclosures (I P code)  Low-voltage switchgear and controlgear  Part 2: Circuit-breakers  Interior lighting  Part 0: Safe movement  Electric cables-Reeling and trailing for mining and general use (other than  underground coal mining)  Electrical installations (known as the Australian/New Zealand Wiring Rules)  Electrical installations-Transportable structures and vehicles including their  site supplies  Electrical installation-Selection of cables",
  "3008.1.1": "3008.1.1 Part 1.1: Cables for alternating voltages up to and including 0.6/1 kV---Typical  Australian installation conditions",
  "3008.1.2": "3008.1.2 Part 1.2: Cables for alternating voltages up to and including 0.6/1 kV-Typical  New Zealand installation conditions  3010 Electrical installations-Generating sets  3 105 Approval and test specification-Electrical portable outlet devices  3112 Approval and test specification-Plugs and socket-outlets  3120 Approval and test specification-Cord extension sockets  3123 Approval and test specification-Plugs, socket-outlets and couplers for general  industrial application  3190 Approval and test specification--Residual current devices (current-operated  earth-leakage devices)  3 191 Electric flexible cords  3199 Approval and test specification-Cord extension sets  3760 In-service safety inspection and testing of electrical equipment  COPYRIGHT  AS/NZS  3439",
  "3439.4": "3439.4  4763(1nt)  4836  5000  60598",
  "60598.2.8": "60598.2.8  60898",
  "60898.1": "60898.1",
  "60898.2": "60898.2  61008",
  "61008.1": "61008.1  61009",
  "61009.1": "61009.1  35 AS/NZS 3012:2010  Low-voltage switchgear and controlgear assemblies  Part 4: Particular requirements for assembl for construction sites (ACS)  Safety of portable inverters  Safe working on low-voltage electrical installations  Electrical cables-Polymeric insulated (all parts)  Luminaires  Par12.8: Particular requirements-Handlamps  Electrical accessories-Circuit-breakcrs for overcurrent protection for  household and similar applications  Part I: Circuit-breakers for a.C. operation  Part 2: Circuit-breakers for a.e. and d.c. operation  Residual current operated circuit-breakers without integral overcurrent  protection for household and similar uses (RCCBs)  Part I: Genera I ru les  Residual current operated circuit-breakers with integral overcurrent protection  for household and similar uses (RCBOs)  Part I: Genera I ru les  61558 Safety of power transformers, power supply units and similar devices",
  "61558.2.23": "61558.2.23 Part 2.23: Particular requ irements for transformers for construction sites  IEC  60309  OTHER  BCA  Plugs, socket-outlets and couplers for industrial purposes (all parts)  Building Code of Australia  COPYRIGHT  AS/NZS 3012:2010 36  APPENDIX B  ELECTR[CAL INSTALLATIONS IN THE DOMESTIC HOUSING  CONSTRUCTION INDUSTRY  (N ormati ve)  HI GENERAL  Conditions in the domestic housing construction industry differ to those experienced during  commercial construction. T'his Appendix has been added to highlight areas where this  Standard can be varied for certain types of domestic housing construction. These types of  domestic housing construction are defined as Classes 1, 2 and 10.  The BCA classification of buildings also applies in New Zealand.  NOTE: See Appendix C.  Variations are listed below, with any clarification or alternative arrangements.  B2 SPECIFIC CLAlJSE VARIATIONS  For a single domestic residence intended to be occupied as a residential housing unit, or  adjoining units each with a separate exterior entry and intended to be occupied as  residential housing units, the requirements of this Standard are varied as listed for the  following clauses in Section 2 of this Standard:",
  "02.3": "02.3 Queensland  In Queensland, the Electrical Safety Office and Workplace Health and Safety have  regulatory responsibility for electrical installations on construction and demolition sites.  Contact details:  Electrical Safety Office  Level 16, State Law Building  50 Ann Street  BRISBANE QLD 4001  Postal address:  GPO Box 69  BRISBANE QLD 4001  Telephone: 1300 362 320  Facsimile: (07) 32379890  Website: ~~~~~10c'~.'I'~.  D2.4 Australian Capital Territory  ACT Department of Urban Services through the ACT Building Electrical and Plumbing  Control (BEPCON) applies regulation of electrical installations on construction and  demolition sites.  BEPCON calls up AS/NZS 3012 specifically in its 'Safe Demolition Work ACT Code of  Practice' .  Contact details:  BEPCON  Central Office  Ground Floor, North  Dame Pattie Menzies House  16 Challis Street  DICKSON ACT 2602  Telephone: (02) 6207 6400  Facsimile: (02) 62076324  Web site: ~~J~1.!l.!Il,J!9Lg.~~~i!!!!i.12S[?£<.l!!  COPYRIGHT  AS/NZS 3012:2010 42  D2.5 Tasmania  The Office of Electricity Standards and Safety has responsibility for electrical safety in  'rasmania.  AS/NZS 3000 is called up by the Occupational Licensing (Standards of Electrical Works)  Code of Practice established under Section 53 of the Occupational Licensing Act 2005.  'Electrical Installations (as defined) shall comply with AS/NZS 30]2 in accordance with  AS/NZS 3000'.  Electrical Work on construction and demolition sites is also subject to the terms of the  Workplace Health and Safe(F (WH&/';j Act 1995, which is administered by Workplace  Standards Tasmania. The Workplace Health and Safety Regulations 1998 state that relevant  codes and guidelines shall be used and AS/NZS 3012 is deemed to be the relevant code or  guideline for electrical installations on construction and demolition sites.  Both the Office of Electricity Standards and Safety and Workplace Standards Tasmania are  parts ofthe Department of Justice.  Contact details:  Workplace Standards Tasmania  30 Gordons Hill Rd  ROSNYPARK TAS 7018  Postal address:  PO Box 56  ROSNY PARK TAS 7018  Telephone: 1300 366 322  Facsimile: (03) 6233 8338  Website: www.wsUas.gov.au  COPYRIGHT  43 AS/NZS 34112:24110  D2.6 Northern Territory  The Department of Employment, Education and Training through NT Work Safe has  jurisdiction over electrical installations on construction and demolition sites in the Northern  Territory.  AS/NZS 3000, AS/NZS 3012 (this Standard) and AS/NZS 3100 are called up by the Work  Health (Occupational Health and Safety) Regulations.  Subject to the regulations, all electrical installations, materials, equipment and apparatus at  a workplace shall comply with AS/NZS 3000 and AS/NZS 3100.  Electrical installations on construction sites shall comply with AS/NZS 3012 (this  Standard).  Contact details:  NT WorkSafe  First Floor  Darwin Plaza Building, The Mall  41 Smith Street  DARWIN NT 0800  Postal Address:  GPO Box 4821  DARWIN NT 0801  Telephone: (08) 8999 5010  Facsimile: (08) 8999 5141  Webs i te: ~~Y:~S)I:Js.:ifl.!~I1.g~.J!Q  COPYRIGHT  AS/NZS 3012:2010 44  D2.7 South Australia  [n South Australia, the Office of the Technical Regulator (SA) has jurisdiction over  electrical installations on construction and demolition sites.  AS/NZS 3000 is called up by the Electricity Act 1996, Electricity (General) Regulations  1997. AS/NZS 3012 (this Standard) is given the status of a mandatory compliance  document in AS/NZS 3000.  Electrical Work on construction and demolition sites is also subject to the terms of the  OccupationaL Health, Safety and Welfare Act 1986 and the Occupationa I Health, Safety and  Welfare Regulations 1995, which are administered by Safework SA.  Contact details:  Office of the Technical Regulator  Department for Transport, Energy and Infrastructure  L8, ANZ Building  11 Waymouth Street  ADELAIDE SA 5000  Telephone: (08) 8226 55 J 8  Facsimile: (08) 8226 5529  Webs ite: ~1!~'-\"YJ£~!l!l!f.ill~ili!!Qr._,_~;j~.~~i.U!  Safework SA  Level 3  1 Richmond Road  KESWICK SA 5035  Postal Address:  GPO Box 465,  ADELAIDE SA 5001  Telephone: (08) 8303 0400  Facsimile: (08) 8303 0277  Webs ite: ~i}t,~~QI!:\\_,,1.<a.,gQ}'Jl!!  COPYRIGHT  45 AS/NZS 3012:2010  D2.8 Western Australia  In Western Australia, the Energy Safety Division of the Department of Consumer and  Employment Protection (DOCEP) has jurisdiction over electrical installations on  construction and electrical work generally.  AS/NZS 3000 is called up by the Electricity Act 1945, Electricity (Licensing) Regulations  1991 and the Electricity Regulations 1947. AS/NZS 30]2 is given the status ofa mandatory  compliance document in AS/NZS 3000.  Electrical Work on construction and demolition sites is also subject to the terms of the  Occupational Safety and Health Act 1984 and the Occupational Safety and Health  Regulations 1996, which are administered by Work Safe Western Australia, which is also a  Division of DOCEP.  Contact details:  Energy Safety  303 Sevenoaks St (corner Grose Ave)  CANNINGTON WA 6107  Telephone: (08) 9422 5200  Facsimile: (08) 9422 5244  Website: ~~~~~~~~~~==  Work Safe Western Australia  5th Floor  1260 Hay Street  WEST PERTH W A 6005  Postal address:  PO Box 294  WEST PERTH WA 6872  'relephone: (08) 9327 8777  Facsimile: (08) 9321 8973  Webs it e: -'-'-'--'-'-'-=-'-=..'--'--''-'='-'-'--'''\"=,-'''-'-'=  COPYRIGHT  ASfNZS 3012:2010 46  APPENDIX E  MARKING OF S WlTCHBOARDS TO INDICATE THE PRESENCE  OF LIVE PARTS  (Normative)  Where access to live parts is required, the following symbolic electric shock risk sign shall  be displayed in locations where additional attention is required to be given to the removal  of covers and the like.  In addition, a DANGER sign as illustrated below, with an additional message, for example,  indicating the presence of live parts within, should be conspicuously displayed on the  enclosure of the ASSEMBL Y to alert persons to the hazard.  COPYRIGHT  47 AS/NZS 3012:2010  APPENDIX F  RECOMMENDED COLOURS FOR TAGS ON TESTED EQUIPMENT  (I n formative)  This Appendix gives a recommended colour coding schedule for tags on tested equipment.  The tag should indicate by its colour the period in which the test was performed in  accordance with the following schedule:  (a) Red December-February.  (b) Green March-May.  (e) Blue June-August.  (d) Yellow September-November.  NOTE: Some construction sites wi 1\\ not allow the use of equipment on site unless the tag colour  readily indicates the required retest date in accordance with Table 3. The colours shown above  apply to 3-monthly requirements.  COPYRIGHT  AS/NZS 3012:2010 48  APPENDIX G  ELECTRICAL VERIFICA'T'TON OF GENERATORS WJTH RCD PROTECTION  TO AS/NZS 3012 AND AS/NZS 3760  (Normative)  Gl PRIOR TO INTRODUCTION TO SERVICE ON SITE AND AT INTERVALS IN  ACCORDANCE WITH CLAlJSE 3.2  (a) Inspection shall be performed in accordance with the relevant requirements of  ASINZS 3760.  (b) Testing of earth continuity and equipotential bonding shall be performed in  accordance with ASINZS 3760, with the generator not running. The resistance shall  not exceed 1 Q from the socket E, to the stator, to the frame and to the socket N, with  the RCD closed.  NOTE: Insulation resistance is not tested, due to the neutral-earth conneclion.  (c) RCD operation and correct connection shall be verified to Clause 3.5 and the relevant  requirements of ASINZS 3760 with the generator running. The following  requirements shall be met:  (i) When the test button is pushed, the RCD shall trip without undue delay; and  (ii) When tested at 30 mA, the RCD shall trip within 300 ms.  G2 PRIOR TO EACH USE AND AT LEAST ONCE PER DAY  The test button shall be pushed and the RCD shall trip without undue delay.  COPYRIGHT  49 AS/NZS 3012:2010  APPENDIX H  ELECTRICAL VERIFICATION OF PORTABLE INVERTERS  (Normative)  HI MARKING AND DOCUMENTATION  All inverters that meet AS/NZS 4763(1l1t) requirements shall be marked by the words or a  graphical symbol to identify the applicable installation situation as follows:  (a) Isolated inverters shall be identified by the words 'isolated inverter' or the diagram in  Figure H 1.1 on the inverter:  - ( ) WI -- ~ ~  FIGURE H1.1 ISOLATED INVERTER  (b) Re D protected inverter identification and documentation:  (i) Reo protected inverters shall be identified by the words 'ReDP inverter' or the  diagram in Figure H 1.2 on the inverter:  FIGURE H1.2 RCDP INVERTER  (ii) Inverters that have been retrofitted with an ReD shall have documentation  verifying compliance with AS/NZS 4763(1nt) as follows:  (A) Clause 3.1.5 Bonding connections (see Paragraph 1-12).  (8) Clause 15.12 The ReD is integral (cannot be removed without the use  of a tool) and the ReD has been tested for both a.c. and d.c. pulse  residual current.  (e) Clause 16.10 The ReO is Type A.  COPYRIGHT  AS/NZS 3012:2010 50  H2 VERIFICATION OF INVERTER SEPARATiON AND RCD OPERATION  H2.1 General  This Paragraph (H2) details tests for the verification of the electrical separation in isolated  inverters and for verification of the bonding and RCD operation in RCD protected inverters.  All tests shall be performed prior to the introduction of all inverters into service and at  intervals as specified in Paragraph H3.  H2.2 Electrical separation for isolated inverters  The inverter is connected to the rated supply voltage with no load and then with a load  connected to the output circuit.  A true rms reading volt meter, along with a parallel resistor, is connected from the battery  negative terminal to each of the following:  (a) The socket-outlet Active contact.  (b) The socket-outlet Neutral contact.  The voltage shall not exceed 25 V.  NOTE: The parallel resistor is to ensure the voltages are from a source with a sufficiently low  value of impedance that is capable of delivering a perception current to a person. A resistor in the  range 1.5 kf2 to 15 kf2 is suitable,  H2.3 Bonding and RCD operation for RCD protected inverters  H2.3.t Bonding test  The continuity is measured to ensure the battery negative, the inverter frame and the socket­ outlet earth contact are connected together.  The value of resistance shall not exceed I Q.  H2.3.2 RCD lest  The inverter is connected to the rated supply voltage with no load and then with a load  connected to the output circuit.  (a) Functional te,st with the RCD test buttoll The button is pushed to initiate a trip of the  RCD. The RCD must trip without undue delay. The test is made 5 times.  (b) Residual current rating Operation at the rated residual current using a test resistor  and verification that the neutral-earth (or eentre tap) connection is upstream of the  RCD.  A resistor in series with a switch is connected from the socket-outlet active term inal to the  socket-outlet earth terminal. The RCD is closed and then the test switch is closed.  The RCD must trip without undue delay. The test is made 5 times.  NOTES:  The resistor is sized to give the rated residual current. For example, with a 230 V true rms  output with a rated residual current of 30 mA, the resistor should be 7.6 kf2. Other values are  given in the notes to Figure H2.  2 If an ReD tester is llsed it must be verified by the supplier as suitable for the output  waveform of the inverter.  H3 PERIODIC TESTING INTERVALS  Testing intervals shall be in accordance with Clause 3.2 and 'rable 3  Isolated inverters and equipotentially bonded inverters are tested at intervals as specified  for Class II portable devices.  COPYRIGHT  51  RCD protected inverters are tested at intervals as specified for portable RCDs.  3 pin  Test switch­ normally open  push button  If the test box is metallic it should  be connected to ear\"th  NO'fE: For a rated residual current of 30 mA the values of the resistor are as follows:  For 230 V true rms output ....................... 7.6 k!1  For 240 V true rms output.. ........................ 8 k!1  For 120/120 V centre tap ........................... 4 k!1  AS/NZS 3012:20 III  FIGURE H2 RESIDUAL CURRENT TEST BOX (RESISTOR SIZED FOR 240 V rms)  COPYRIGHT  AS/NZS 3012:2010 52  APPENDIX I  NEW ZEALAND ONLY  VERIFICATION FORM FOR CONSTRUCTION AND DEMOLITION SrTES  (Normative)  H INTRODUCTION",
  "11.1": "11.1 Verification  There are mandated requirements in the NZ Electricity (Safety) Regulations 2010 for the  verification of Construction and Demolition sites at the intervals detailed in Table 3 to the  requirements of AS/NZS 3000 and the additional requirements of AS/NZS 3012 (this  Standard). The NZ Electrical Workers Licensing Board should be consulted for the  competency requirements for those persons carrying out inspections.  This Appendix provides a suitable form for this verification. '('his form may be copied for  production of forms.",
  "11.2": "11.2 Verification form  CERTIFICATE OF VERIFICATION  Construction and demolition site details:  Client:  Address of construction and demolition site  This certificate covers verification of Construction sitelDemolition site (delete as required):  Verification:  I have carried out a verification of the above site in accordance with AS/NZS 3000 and the  additional requirements of AS/NZS 3012 and certify that the installation meets the  requirements detailed for the issue of a Certificate of Verification  Name of person who carried out inspection: ................................................................. .  Registration type and number:  ! Signature: ...  COPYRIGHT  53 AS/NZS 3012:2010  APPENDIX J  GUIDE TO ARRANGEMENT OF SWITCHBOARDS.  CONSTRUCTION WIRING AND EQUIPMENT  (Normative)  Main switchboard (1)  (3)  L  Site distribution swi:tcrrboard  Distribution board isolating switch  NOTES:  Legend:  Residual current  ........ , '\"-'--N protection 30mA  OverCdrrent protection  circuit-breaker  Isolating switch  (In-i}, Socket-outlet, lOA  ,~/  Construction wiring  ri~\"tr--z- Flexible cord or cord  \\,'li/ extension set  Portable tools and  other plug connected  equipment  Portable tools and  I Safety services shall comply with the requirements orthe Wiring Rules.  2 If safety services arc supplied downstream or this switch, then this switch shall be locked ill the on  position and marked Isolating switch-operation by authorized persons only. If there are no safety  services this is the main switch.  3 Main switch if switch (2) is not provided.  4 Safety service.  S Only the main switchboard may supply safety services.  FIGURE J1 GUIDE TO ARRANGEMENT OF SWITCHBOARDS CONSTRUCTION  WIRING AND EQUIPMENT  COPYRIGHT  AS/NZS 3012:2010 54  APPENDIX K  ALTERNATIVE SUPPLY SYSTEM FOR CONSTRUCTION  AND DEMOLITION SITES  (Normati ve)  Kl SCOPE  This Appendix covers information and additional requirements for the use of Assemblies  for Construction Sites (ACS) complying with ASiNZS 3439.4 as an alternative supply  system for construction and demolition sites.  This Appendix provides further information to supplement that covered in Clause 2.3  NOTE: This Appendix uses the AS/NZS 3439.4 term 'Assemblies for Construction Sites'. These  units may be known by the term 'Cascadable Reticulation Units' (CRU) in other Standards, e.g.  AS/NZS 3002.  K2 ALTERNATIVE SUPPLY SYSTEMS  K2.1 Installation and verification  (a) Australia and New Zealand require a qualified person for the installation and  verification of direct connected sub-mains and equipment  (b) Australia requires a qualified person for the installation and verification of sub-mains  (interconnecting cable) for plug and socket connected ACSs.  (c) New Zealand requires a competent person for the installation and verification of sub­ mains (interconnecting cable) for plug and socket connected ACSs.  K3 GENERAL REQUIREMENTS AND FUNCTIONS OF ASSEMBLIES FOR  CONSTRUCTION SITES (ACS)  K3.1 General  All ACS shall comply with the requirements of ASiNZS 3439.4 and the relevant  requirements of this Standard.  K3.2 ACS description  An ACS system consisting of an incoming ACS unit and several outgoing ACS units is  shown in Figure K 1. Safety services shall be installed to the requirements of AS/NZS 3000.  The interconnecting cables are classified as sub-mains and may use direct or detachable  connections. The circuits within the units supplying socket-outlets and/or major items of  plant are classified as final sub-circuits.  Incoming and outgoing ACS units may incorporate additional units such as- (a) metering units;  (b) transformer units with low voltage 10 extra low voltage (LV /ELV) transformers to  provide SELV or PELV supplies; and  (c) transformer units with low voltage to low voltage (LV/LV) transformers to provide  separated (isolated) LV suppl ies.  An outgoing ACS unit may provide a supply to- (i) other ACS outgoing units;  (ii) lighting;  COPYRIGHT  (iii) machines or electric tools; or  (iv) other construction site equipment.  K3.3 ACS installation system  55 AS/NZS 3012:2010  A number of compatible ACS assemblies may be interconnected to form a complete  installation, or part of an installation. ACS assemblies shall provide basic protection  (protection against direct contact) from electric shock and, where possible, discrimination  by suitable selection of protective devices. For example. the breaking capacity. current  rating and operating time under fault conditions.  In Australia only, on the incoming supply fUllction unit for each floor of a multi-storey  construction the deta9hable incoming supply connections (both ends) shall be fitted with a  device requiring a key or tool for disconnection (detachment) and all other ACS units  connected to this unit shall be limited to that floor.  Exceplion: This requirement need not apply to work in !(ft shafis. slairwells, service shafis,  formwork or external staging.  K3.4 Assembly characteristics  The various assembly characteristics are laid down by the manufacturer, or are the subject  of an agreement between manufacturer and user, taking into account the nature of supply  and/or distribution network and relevant installation requirements. A single ACS assembly  may incorporate a number of functions.  K4 GENERAL CLASSIFICATION OF ACS ASSEMBLIES  K4.1 Transportable ACS unit  Assemblies that are intended for use in a place where they are not permanently fixed and  the location may vary during work on the site. When the transportable ACS is to be moved  to another location, it must be disconnected from the supply.  K4.2 Mobile ACS unit  Assemblies that are capable of being moved as work advances on the site. These may not  require disconnection from the supply when being relocated.  K4.3 Incoming ACS unit  (a) The cable connection facilities, terminals, connecting devices, connectors, or plug  and socket-outlet accessories shall be compatible with the current rating of the ACS  assembly.  (b) Incoming and outgoing isolating and over-current protective devices shall be  provided. There shall be means for securing these devices in the open position. The  protection shall be sized to ensure that, with the maximum earth fault loop impedance  to a socket-outlet on the most distant ACS, automatic disconnection of supply occurs  within 400 ms as per AS/NZS 3000, i.e. fault protection for indirect contact is  ensured.  (c) The incoming ACS assembly is typically a transportable ACS.  (d) The cabl ing to an incoming ACS shall be by direct connection.  (e) The connection to major items of plant shall be by direct connection from an  incoming ACS unit.  K4.4 Metering ACS unit  (a) The metering ACS assembly shall be designed by or in agreement with the electricity  distributor requirements if it is intended to use the metering device(s) to measure the  energy consumed for the purposes of payment for the energy consumed.  COPYRIGHT  ASfNZS 3012:2010 56  (b) The metering ACS assembly is typically a transportable ACS.  (c) The sub-main cabling to a metering ACS shall be by direct connection.  K4.5 Transformer ACS unit  K4.S.1 General  The transformer ACS unit includes a low-voltage to extra low-voltage (LV IELV)  transformer and/or a low-voltage to low-voltage transformer (LV/LV).  K4.5.2 LV/ELVACS unit  (a) The LV/ELV ACS unit provides either a SELV or PELV supply complying with  AS/NZS 3000 requirements.  (b) Each LV /EL V ACS un it consists of-- (i) the protective and control devices in the transformer primary circuit;  (ii) a ELV safety transformer complying with the requirements of AS/NZS 61558;  and  (iii) the protective devices, control switches and connection methods required for  the ELV output circuits as detailed in AS/NZS 3000.  (c) The LV/ELV ACS unit is typically a mobile ACS.  K4.S.3 LV/LV AeS unit  (a) The LV ILV ACS unit provides a separated (isolated) LV supply complying with  AS/NZS 3000 requirements.  (b) Each LV/LV ACS unit consists  (i) the protective and control devices on the transformer primary circuit;  (Ii) an LV/LV transformer, which shall be an isolating transformer complying with  AS/NZS 61558; and  (iii) the protective and control devices for the output circuit(s) and socket-outlets  shall be to AS/NZS 3000 requirements.  (c) '['he equipotential bonding of socket-outlet earth connections supplied by a common  isolating transformer secondary winding shall be to AS/NZS 3000 requirements.  (d) The LV /LV ACS unit is typically a mobile ACS.  K4.6 Outgoing ACS unit  (a) The outgoing ACS unit consists of one incoming and a number of outgoing circuits.  (b) There shall bc over-current protection, suitable for isolation, for the incoming and  outgoing supply.  Exception: The incoming over-current protection may be omitted if the ACS assemblJI  is directly connected 10 an upstream ACS assembly that is able to provide the  overcurrent protection required/or the downstream ACt)' assembly. However, a load  break isolator on the incoming supply is still required.  (c) The input isolation switch device shall be easily accessible without the use of a key or  tool.  (d) 'rhe input isolation switch shall operate simultaneously on all poles and switch all  active conductors.  COPYRIGHT  57 AS/NZS 3012:2010  (e) Additional protection of final sub-circuits shall comply with Clause 2.4.6 and 2.9.  (1)  NOTES:  To avoid unwanted tripping because of leakage currents and transient disturbances, care  should be taken to ensure the sum of the leakage currents of electrical equipment on the  load side of an RCD is significantly less than its rated residual current. RCDs may operate  at any value of residual current in excess of 50% of the rated residual current.  It is recommended the loading of the circuit should be such that the leakage current does  not exceed one th ird of the tripping current.  2 To avoid excessive leakage current causing unwanted tripping where socket-outlets are  protected by one RC D having a rated residual current not greater than 30 rnA,  consideration should be given to the number of socket-outlets protected and the nature of  electrical equipment likely to be connected to the socket-outlets.  3 Where RCDs are used, consideration should be given to the nature of the load, for  example, the supply waveform shape and the presence of high frequency and/or d.c.  components for the selection of the correct type of RCD.  In New Zealand the all RCDs shall be type A.  (g) Final sub-circuits supplying socket-outlets shall be provided with overcurrent  protection rated suitable for that final sub-circuit. An overcurrent protective device  may protect more than one socket-outlet.  NOTE: Consideration should be given to effects of unintended tripping, when an overcurrent  protective device protects multiple socket-outlets.  (h) The outgoing ACS unit is typically a mobile ACS.  K5 Interconnecting cables  KS.l General  The sub-mains (interconnecting cables) of an ACS system are construction wiring and the  requirements of Clause 2.5.3 for the provision of additional mechanical protection apply.  In addition, detachable sub-mains (interconnecting cables) of an ACS system shall also be  screened cables, with the screen being earthed.  NOTE: This provides protection against physical mechanical damage from sharp objects, or in the  case of the interconnecting cable being mechanically damaged by crushing or being cut, provides  additional protection by the automatic disconnection of the supply by operation of the protective  device protecting the cable.  KS.2 Connections  Direct or detachable connections may be used for sub-mains (interconnecting cables). See  Clause K2. I  K5.3 Detachable sub-main, plugs, cord connectors and appliance inlets  Detachable sub-main plugs, cord connectors and appliance inlets shall comply with  IEC 60309 or ASlNZS 3123 as agreed by the manufacturer and the user.  Devices for interconnection of sub-mains shall be rated at 32 A or above and be designed to  prevent inadvertent disconnection under load.  KS.4 Oistinction of sub-main sockets from other socket-outlets  The use of plug and soeket-outlet systems commonly used on the site to supply electrical  equipment shall not be used for the detachable connection of sub-mains.  KS.5 Overcurrent protection socket-outlets for detachable sub-mains  All socket-outlets used for the connection of detachable sub-mains shall be provided with  overcurrent protection rated at equal to or less than the rating of the socket-outlets.  COPYRIGHT  AS/NZS 3012:2010 58  KS.6 Labelling  Fixed socket-outlets or cord extension sockets used for interconnecting cabling systems  shall be identified as construction wiring and not suitable for electrical supply to hand held  tools. The ACS units shall be clearly marked with instructions to isolate the unit before  connection or disconnection of the sub-mains.  K6 INSTALLATION OF ACS ASSEMBLIES  K6.1 General  All ACS assemblies shall comply with Clause 2.3 and other relevant requirements.  Detachable interconnecting cables shall be earth screened or armoured cables.  K6.2 Openings  Openings in ACS assemblies for cable entries, cover plates, etc. shall be such that, when the  interconnecting cables, including their anchoring devices, are properly installed, the  protective measures against contact with live parts and stated degree of I P protection is  maintained.  K6.3 Interconnecting cables  Interconnecting cables shall be installed and protected to comply with Clause 2.5.  K6.4 Strain relief  Cables to and from ACS assemblies and connection facilities shall be suitably restrained to  prevent undue stress on the interconnecting cable connections (see Clause 2.3.5).  K7 INITIAL AND PERIODIC VERIFICATION  K7.1 initial verification  All ACS units and the detachable sub-main cabling systems, including fittings (if provided)  shall be inspected, tested and tagged prior to use as per Clause 3.  Following completion of the assembly of the ACS system, the requirements of Section 3 for  initial verification of construction wiring apply.  K7.2 Periodic verification  The requirements of Section 3 for periodic verification apply.  COPYRIGHT  59 AS/NZS 3012:2010  ~~ r --,  ~~t.: 1 _ _ _ ---------,..I·>--~/>----I  GeneratinjIg set lor I ---j---+ Major plant item  I  I I I I  : --./. I I  I I  Main switchboard or  Distribution switchboard  I  I  ---(II1II+----... To sec 0 n d AC S  I system  63A I  Ilnc~ing AC~ _  63A  cord  extension  socket  c  co  E  I  .0  ::J  if)  32A  plug  COl  'q; c  Note 2 63A  Sub-main (interconnecting cable)  30mA RCD  overcurrent  protection  . ~r(::---:  ~>*-­ N'.: N  ~  32A 32A  soc ket  outlet  E r; Outgoing ACS  overcurrent  protection  I (\\)  .oc  ::J c  if) 0  ::  (\\) ,.---------------------,  c  32A  cord  extension  socket  NOlES:  32A 32A  socket  outlet  Outgoing ACS  Socket outlet  overcurrent  protection  To plug connected  plant and tools etc.  To plug connected  plant and tools etc.  To plug connected  plant and tools etc.  Generator sct shall have the alternator star point connection bonded to the equipotential earthing system or  ACS assemblies to ensure eorrec! RCD operation.  2 This connection is shown as a direct connection for explanatory purposes only. Rcfer to Paragraph K5 f(lr  details.  FIGURE K1 GUIDE TO ARRANGEMENT OF SWITCHBOARDS, CONSTRUCTION  WIRING AND EQUIPMENT  COPYRIGHT  AS/NZS 3012:2010 60  NOTES  Standards Australia  Standards Australia is an independent company, limited by guarantee, which prepares and publishes  most of the voluntary technical and commercial standards used in Australia. These standards are  developed through an open process of consultation and consensus, in which all interested parties are  invited to participate. Through a Memorandum of Understanding with the Commonwealth  government, Standards Australia is recognized as Australia's peak national standards body.  Standards New Zealand  The first national Standards organization was created in New Zealand in 1932. The Standards  Council of New Zealand is the national authority responsible for the production of Standards.  Standards New Zealand is the trading arm of the Standards Council established under the Standards  Act 1988.  AustralianlNew Zealand Standards  Under a Memorandum of Understanding between Standards Australia and Standards New Zealand,  Australian/New Zealand Standards are prepared by committees of experts from industry,  governments, consumers and other sectors. The requirements or recommendations contained  in published Standards are a consensus of the views of representative interests and also take  account of comments received from other sources. They reflect the latest scientific and industry  experience. Australian/New Zealand Standards are kept under continuous review after publication  and are updated regularly to take account of changing technology.  International Involvement  Standards Australia and Standards New Zealand are responsible for ensuring that the Australian  and New Zealand viewpoints are considered in the formulation of international Standards and that  the latest international experience is incorporated in national and Joint Standards. This role is vital  in assisting local industry to compete in international markets. Both organizations are the national  members of ISO (the International Organization for Standardization) and IEC (the International  Electrotechnical Commission).  Visit our web sites  www.standards.org.au  www.standards.com.au  www.standards.co.nz  o  STANDARDS  NEW ZEALAND  PAER E WA AOTEARO A"
}