{
  "1.1": "1.1   SCOPE   This Standard sets out some of the common inspection and test methods required to verify that a low  voltage, multiple earthed neutral (MEN) (TN-C-S) electrical installation complies with safety  requirements for the prevention of fire, or a person or livestock from sustaining an electric shock.   The tests detailed in this Standard are as follows:   (a) Earthing system continuity and resistance;  (b) Insulation resistance;  (c) Polarity;  (d) Correct circuit connections;  (e) Phase sequence;  (f) Fault-loop impedance;  (g) Verification of operation of residual current devices;  (h) Earth electrode resistance;  (i) Touch voltage; and  (j) Continuity and resistance of the incoming neutral.  The Standard illustrates testing procedures for an electrical installation connected to an MEN system  of earthing. The equipment and methods:  (k) Are not exclusive and other equipment and methods may be used;  (l) May be applied to types of low voltage installations other than MEN; and   (m) May be applied to work affecting only part of an installation, e.g. alterations, additions or repairs.",
  "1.2": "1.2   SAFETY   To comply with the requirements of AS/NZS 3000, all electrical installations and any alterations,  additions and repairs to electrical installations shall, prior to being placed in service or use, be:  (a) Inspected as far as is practicable; and   (b) Tested.   Electrical testing inherently involves some degree of hazard. It is the responsibility of the person  performing the tests to ensure that safe practices are used in the performance of test procedures.   In this Standard tests are described both for situations where the supply is connected and where it is  not connected. Preference has been given to tests where the supply is not connected as this would  minimize the shock risk. However, testing with the supply connected may also be conducted and  some alternative test methods have been included. In these situations greater care must be exercised  to avoid direct or indirect contact with live parts or the energizing of exposed conductive parts.   Whether testing with supply disconnected or connected, the following precautions should be followed:   (c) Treat equipment, such as cables and terminations, as being energized until proven otherwise;   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  6 AS/NZS 3017:2007     COPYRIGHT  (d) Follow safe working practices as outlined in AS/NZS 4836;  (e) Understand the correct use of the equipment to be used and its rating; and  (f) Check that the equipment being used, including any test leads, probes or clips:  (i) Is suitable for the voltage being tested  (ii) Is in good working order; and   (iii) Has no damaged parts with which contact could be dangerous.     NOTE — For the testing of individual circuits when the circuit protective device has been removed or switched off,  a no-voltage test should be conducted at the end of the circuit to ensure the correct circuit protective device has  been removed or switched off.",
  "1.3": "1.3   REFERENCED DOCUMENTS   The following documents are referred to in this Standard:   AS     61010    Part 1:2003  Safety requirements for electrical equipment for measurement, control,  and laboratory use  General requirements  60269  Part 1:2005  Low-voltage fuses  General requirements  HB 187:2006 Guide to selecting a safe multimeter  AS/NZS     1125:2001 Conductors in insulated electric cables and flexible cords   3000:2007 Electrical installations (known as the Australian/New Zealand Wiring  Rules)   4836:2001  Safe working on low-voltage electrical installations   60479  Part 1:2002  Effects of current on human beings and livestock  General aspects  60898    Part 1:2004   Electrical accessories – Circuit-breakers for overcurrent protection for  household and similar installations  Circuit breakers for a.c. operation  60990:2002 Methods of measurement of touch current and protective conductor  current  BS   88 Low voltage fuses (all Parts)   IEC   61557 Electrical safety in low voltage distribution systems up to 1000 V a.c. and  1500 V d.c. – Equipment for testing, measuring or monitoring of protective  measures  Part 3:2007 Loop impedance  Part 5:2007 Resistance to earth",
  "1.4": "1.4   DEFINITIONS  For the purposes of this Standard the definitions given in AS/NZS 3000 and those below apply.  Inspection — Examination of an electrical installation using all the senses in order to ascertain correct  selection and proper erection of electrical equipment.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  7 AS/NZS 3017:2007     COPYRIGHT  Known earth — An earth point previously tested to confirm that it is connected to the installation  earthing system.  Reporting — Recording of the results of inspection and testing.  Supply connected — The electrical installation is connected to the network operator’s distribution  system.  Supply not connected — No conductor of the electrical installation, including the neutral, is  connected to the network operator’s distribution system.  Testing — Implementation of measures in an electrical installation by means of which its effectiveness  is proved.  NOTE — It includes ascertaining values by means of appropriate measuring instruments, those values not being  detectable by inspection.  Verification — All measures by means of which compliance of the electrical installation with the  relevant requirements of AS/NZS 3000 is checked.  NOTE — This comprises inspection, testing and reporting.",
  "1.5": "1.5 1.5 16 2.32 1.16 1.16 1.24 0.62 0.62 0.76 0.38 0.38 2.00 1.00 1.00",
  "1.6": "1.6   FAILURE OF A TEST   If the electrical installation fails a test, that test and any preceding tests that may have been influenced  by the fault indicated shall be repeated after the fault has been rectified.",
  "1.7": "1.7   TEST EQUIPMENT",
  "2.1": "2.1   GENERAL   A visual inspection shall be made when work on an electrical installation has been completed in order  to verify that the work complies with the requirements of AS/NZS 3000.  The visual inspection shall be carried out before, or in association with testing, and should where  practicable be made before the relevant part of the electrical installation is placed in service.  Where the visual inspection of a part of the electrical installation is not practicable at the completion of  the work, e.g. not accessible due to enclosure in the building structure, consideration should be given  to inspecting that part during the course of the installation.",
  "2.2": "2.2   CHECK LIST   The following items provide a guide to the matters to be checked during the visual inspection to  assess that the relevant requirements of AS/NZS 3000 are satisfied.  NOTE — The lists below are representative of items in a standard installation but are not intended to be  exhaustive.   (a)  General  (i) Basic protection (protection against direct contact with live parts), e.g. insulation and  enclosure  (ii)  Fault protection (protection against indirect contact with exposed conductive parts), e.g.  by the use of automatic disconnection of supply, double insulation or isolating  transformers  (iii) Protection against hazardous parts, e.g. enclosure, guarding or screening of flammable  materials, hot surfaces and parts that may cause physical injury  (iv) Protection against spread of fire, e.g. penetration of fire barriers, and  (v) General condition of the electrical equipment, e.g. signs of damage that could impair safe  operation, disconnection of unused electrical equipment.   (b)  Consumers mains  (i) Identification of cable cores  (ii) Current carrying capacity  (iii) Voltage drop, e.g. size and length of conductors and load  (iv) Underground installation conditions, e.g. enclosure, depth of burial, mechanical protection  (v) Aerial installation conditions  (vi) Connection of wiring, and  (vii) Protection against external influences.   (c)  Switchboards  (i) Location, e.g. access and egress, not in restricted location  (ii) Protective devices, e.g. selection and setting of adjustable protective devices for  compliance with overcurrent protection, arc fault protection and discrimination  requirements.  (iii) Isolating devices, e.g. main switches  (iv) Connecting devices, e.g. neutral bars, earth bars and active links  (v) Connection and fixing of wiring and switchgear  (vi) Identification and labelling of electrical equipment, and  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  10 AS/NZS 3017:2007     COPYRIGHT  (vii) Protection against external influences, e.g. mechanical damage, effects of ultraviolet light.  (d)  Wiring systems  (i) Conductor size, e.g. current-carrying capacity and voltage drop  (ii) Identification of cable cores  (iii) Adequate support and fixing  (iv) Connections and enclosures  (v) Particular installation conditions, e.g. underground, aerial, safety services  (vi) Segregation from other services and electrical installations, and  (vii) Protection against external influences, e.g. enclosure.  (e)  Electrical equipment   (i) Isolation and switching devices for protection against injury from mechanical movement  devices and motors  (ii) Isolation and switching devices for protection against thermal effects, e.g. motors, room  heaters, water heaters  (iii) Switching devices for particular electrical equipment, e.g. socket-outlets, cooking  appliances etc  (iv) Particular installation conditions, e.g. locations affected by water, explosive atmospheres,  extra-low voltage, high voltage  (v) Compliance with required Standard  (vi) Connection, support and fixing  (vii) Protection against external influences, and  (viii) Availability of instruction manuals, technical dossiers etc, especially for hazardous areas.  (f)  Earthing  (i) MEN connection  (ii) Earth electrode  (iii) Earthing conductors, e.g. size, identification  (iv) Equipotential bonding conductors, e.g. size, identification  (v) Connections, joints and terminations  (vi) Protection against external influences  (vii) Connection to earthing arrangements for other systems  (viii) Creation of earthed situation that may require earthing of additional electrical equipment,  and  (ix) Supplementary bonding of extraneous conductive parts in showers, bathrooms,  swimming pools, paddling pools, spa pools and spa tubs.    Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  11 AS/NZS 3017:2007     COPYRIGHT  SECTION 3   TESTS",
  "3.1": "3.1. This is due to the following:   (a) A reduction to 80% (0.8) due to a conductor temperature of 20 °C; and  (b) A further reduction as the length of circuits given in table B1 of AS/NZS 3000 was calculated using 80%  (0.8) of supply voltage.   Therefore 0.8 × 0.8 = 0.64 (64%).   (2) Resistances for active conductors (R ph) and protective earthing conductors (Re) are also provided.   (3) The types of circuit breakers (Type B, C and D) are based on the types described in AS/NZS 60898  (4) Fuses based on AS 60269.1 were previously known as BS 88 type fuses.  (5) When the nominal phase voltage of the electrical installation is not 230 V, Zs may be determined by multiplying by  a factor of Uo/230. For a nominal phase voltage of 240 V, the factor would be ≈ 1.04.",
  "3.2": "3.2   INSULATION RESISTANCE",
  "3.3": "3.3   POLARITY",
  "3.4": "3.4   CORRECT CIRCUIT CONNECTIONS",
  "3.5": "3.5   CHECK OF PHASE SEQUENCE",
  "3.6": "3.6   EARTH FAULT-LOOP IMPEDANCE",
  "3.7": "3.7   OPERATION OF RESIDUAL CURRENT DEVICES (RCDs)",
  "3.8": "3.8  METHOD FOR MEASUREMENT OF THE RESISTANCE OF THE EARTH ELECTRODE",
  "3.9": "3.9   MEASUREMENT OF TOUCH VOLTAGE",
  "3.10": "3.10   TEST FOR CONTINUITY AND RESISTANCE OF THE INCOMING NEUTRAL",
  "1.7.1": "1.7.1   Equipment checks   All test equipment should be suitable for its intended purpose and be checked from time to time,  particularly after extended periods of storage, to ensure that it remains operational and safe and  internal batteries are adequately charged.   NOTE —  (1) Test instruments should comply with the requirements of AS 61010.1 and IEC 61557 or equivalent  Standard and be calibrated at regular intervals.  (2) See SA HB 187 for information on the selection of safe multimeters.  Before carrying out any tests the equipment should be checked to ensure that it is correctly set,  functional and in good condition.   Instrument accuracy should be confirmed by checking against a range of resistors of known values or  by regular calibration checks.   Contact probes and leads should be checked for damage to insulated parts, continuity and sound  connections.",
  "1.7.2": "1.7.2   Equipment   To carry out all the tests detailed in this Standard the following equipment is required:   (a) Insulation resistance tester;  (b) Ohmmeter;  (c) Voltage indicator (e.g. lamp, neon, LED device or meter);  (d) Suitable probes;  (e) Trailing leads;  (f) A range of resistors of known values;  (g) A suitable instrument for measuring fault-loop impedance; and  (h) A suitable instrument or device for checking the operation of a RCD.     NOTE —  (1) The insulation resistance tester used shall be able to maintain its terminal voltage within +20% and -10%  of the nominal open-circuit terminal voltage, when measuring a resistance of 1 MΩ on the 500 V range or  10 MΩ on the1000 V range. W hen applying the insulation resistance test to electronic equipment or surge  protection devices, care should be taken to prevent damage to the devices.  (2) Voltage indicators such as high impedance volt meters, neon and LED devices, should only be used to  verify the presence of a voltage. They should not be used to verify the conductivity of a cable, as they will  operate satisfactorily with high resistances within the circuit under test.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  9 AS/NZS 3017:2007     COPYRIGHT  SECTION 2   VISUAL INSPECTION",
  "3.1.1": "3.1.1   Objective   Earth continuity and resistance tests are necessary to ensure that the earthing system has been  installed in an appropriate manner and the resistance of the protective earthing conductor is low  enough to permit the passage of sufficient current to cause circuit protective devices to operate if there  is a fault between live parts and exposed conductive parts.",
  "3.1.2": "3.1.2   Requirements   The resistance of the main earthing conductor and any equipotential bonding conductor shall be not  more than 0.5 Ω.   The resistance of protective earthing conductors shall be low enough to permit the passage of current  necessary to operate the circuit protective device. This condition is satisfied when the fault-loop  impedance is low enough to allow sufficient current to flow in the earth fault-loop to cause the  protective device to operate within a specified disconnection time.   NOTE —   (1) As described in 3.6, the maximum allowable resistance of the protective earthing conductor associated  with any particular circuit depends on the type and rating of the protective device and the impedance of the  live conductors that comprise the circuit in which the fault occurs.   (2) Maximum resistance values (R e) for earthing conductors related to size of conductor and rating of  associated protective device are given in table 3.2. These values may be used when testing for earth  continuity.",
  "3.1.3": "3.1.3   Test procedures   The test procedures below show methods of testing the continuity and resistance of earthing and  bonding conductors. They are shown in:  (a) Figure 3.1 for the main earthing conductor; and   (b) Figure 3.2 for protective earthing and equipotential bonding conductors.   NOTE — The continuity of protective earthing conductors may also be verified by measuring the earth fault-loop  impedance of the circuit. See 3.6.",
  "3.1.4": "3.1.4   Testing considerations   Consideration should be given to the following:   (a) In some situations, such as the connection of equipotential bonding conductors to water piping  or swimming pools, the terminations of conductors may not be accessible due to further building  activities or enclosure. If this is expected to occur, testing at the termination should be carried  out at the time of initial connection or other convenient time when the termination is still  accessible. Where this is not practicable, the inaccessible connection may be proven by testing  at a more convenient point on the parts which are to be earthed or bonded by the conductor;  and  (b) If the insulation resistance test, in accordance with 3.2, is not satisfactory (e.g. a value of less  than 1 MΩ is obtained) earth continuity and resistance tests may need to be repeated after any  fault is rectified.  NOTE — Where there is a possibility of a parallel connection between a protective earthing conductor and other  conductive parts, e.g. a water heater, the protective earthing conductor should be disconnected from the electrical  device and tested independently.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  12 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.1 — Resistance test of main earthing conductor   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  13 AS/NZS 3017:2007     COPYRIGHT    NOTE – Numbers indicate test sequence.   Figure 3.2 — Resistance test for protective earthing and equipotential bonding conductors   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  14 AS/NZS 3017:2007     COPYRIGHT",
  "3.2.1": "3.2.1   Objective   Insulation resistance tests are necessary to ensure that the insulation resistance between all live  conductors and earth or, as the case may be, all live parts and earth is adequate to ensure the  integrity of the insulation. This is to prevent:  (a) Electric shock hazards from inadvertent contact;  (b) Fire hazards from short-circuits; and  (c) Equipment damage.  In addition, insulation resistance tests between all conductors are necessary for consumers mains and  submains to minimise potential for insulation breakdown, injury or property damage due to failure of  such conductors.  The integrity of the insulation is stressed by applying a direct current at 500 V, or 250 V for equipment  described in 3.2.4(e) which cannot be isolated.",
  "3.2.2": "3.2.2   Requirements   The insulation resistance between:  (a) the conductors of consumers mains and submains; and   (b) live and earthed parts of an electrical installation, or parts thereof, including consumers mains  and submains   shall be not less than 1 MΩ.  Sheathed heating elements of appliances, RCDs with a functional earth connection and some other  electrical equipment may cause test results lower than 1 MΩ. These should be disconnected from the  circuit prior to testing.   These items may be tested individually. Acceptable insulation resistance values for such items are:  (c) 0.01 MΩ for sheathed heating elements of appliances;  (d) For RCDs with a functional earth connection, as specified by the manufacturer; or   (e) A value permitted in the relevant safety Standard applicable to the electrical equipment.   NOTE — Where consumers mains or submains are not of significant length, the insulation resistance of the circuit  should be significantly greater than 1 MΩ. For example, with short lengths (for example 50 m) of polymeric cables,  a value in excess of 50 MΩ would be expected.",
  "3.2.3": "3.2.3   Test procedures   Tests for insulation resistance are shown in the following:   (a) Figure 3.3 for testing a complete installation;   (b) Figure 3.4 for testing consumers mains or submains; and   (c) Figure 3.5 for testing a single circuit.",
  "3.2.4": "3.2.4   Testing considerations   Testing considerations include the following:   (a) If supply is available, care must be exercised to ensure that the test equipment is not connected  to energized parts. Main switches, circuit-breakers, residual current devices and fuses can be  opened to disconnect most circuits. Consumers mains must be de-energized and isolated  before testing;  (b) Where outbuildings having additional MEN connections exist, they shall be disconnected before  conducting the test;  (c) If earthing arrangements for functional purposes are provided as part of the electrical  installation, any connections to the protective earthing arrangements should be disconnected for  the duration of this test;  (d) If the insulation resistance test is not satisfactory (e.g. a value of less than 1 MΩ is obtained)  earth continuity and resistance tests of 3.1 may need to be repeated after the fault is rectified;  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  15 AS/NZS 3017:2007     COPYRIGHT  (e) Where electronic devices are installed as part of the fixed installation, care should be taken to  avoid damaging such devices by overvoltage. Damage may be avoided by:  (i) Connecting the active and neutral conductors together and testing between the  conductors and earth, and  (ii) If the results obtained in (i) are unsatisfactory, testing between neutral conductors and  earth and then between active conductors and earth.   These tests are to be carried out with the neutral conductor disconnected from the MEN system.   Where surge protective devices (SPDs) or other equipment are likely to influence the test or be  damaged, such equipment shall be disconnected before carrying out the insulation resistance  test. Where it is not reasonably practical to disconnect such equipment (e.g. in the case of fixed  socket-outlets incorporating an SPD) the test voltage of the particular circuit may be reduced to  250 V d.c., but the insulation resistance should have a value of at least 1 MΩ;  (f) Where an earth sheath return (ESR) system is used, the neutral conductor is not to be  connected to any active conductor for the purpose of the insulation resistance test; and  (g) All switch positions/combinations need to be tested in two-way and intermediate applications  and on the load side of devices such as contactors.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  16 AS/NZS 3017:2007     COPYRIGHT      NOTE — Numbers indicate test sequence.   Figure 3.3 — Insulation resistance test of complete installation (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  17 AS/NZS 3017:2007     COPYRIGHT    NOTE —   (1) Test can be carried out on each conductor separately.   (2) For multiphase consumers mains also test between phase conductors  (3) Numbers indicate test sequence.   Figure 3.4 — Insulation resistance test of consumers mains   (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  18 AS/NZS 3017:2007     COPYRIGHT    NOTE —   (1) Test can be carried out separately on each active and neutral conductor.   (2) Numbers indicate test sequence.     Figure 3.5 — Insulation resistance test of single circuit (supply not connected)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  19 AS/NZS 3017:2007     COPYRIGHT",
  "3.3.1": "3.3.1   Objective   Polarity testing is necessary to ensure that no shock hazard results from the incorrect connection of  active, neutral and earthing conductors. This testing is to ensure:  (a) Active and neutral conductors of the consumers mains or submains are not transposed resulting  in the electrical installation earthing system becoming energized;  (b) There are no combinations of incorrect active, neutral and earthing conductor connections  resulting in the exposed conductive parts of the electrical installation becoming energized; and   (c) Switches do not operate in neutral conductors, resulting in parts of appliances, such as heat ing  elements and lampholders, remaining energized when the switches are in the ‘OFF’ position.   Exception: Multi-pole RCDs, multi-pole switches in which the neutral is switched and switches in  the control circuit of fire pumps.  Phase sequence testing is necessary to ensure that multi-phase equipment operates in a predictable  manner, e.g. multi-phase motors, semiconductor controlled equipment etc (see 3.5).",
  "3.3.2": "3.3.2   Requirements   In general:  (a) Every single-pole switch or protective device shall operate in the active conductor of the circuit  in which it is connected;  (b) A switch or protective device of a multi-phase circuit, other than some types of motor overload  protective devices, shall operate in all active conductors of the circuit in which it is connected;  (c) RCDs required to switch all live conductors shall switch the active and neutral conductors of the  circuit;  (d) Where multi-phase socket-outlets of the same type form part of an electrical installation the  phase sequence of the socket-outlets shall be the same (see 3.5);  (e) Socket-outlets which accommodate flat-pin plugs shall be connected so that, when viewed from  the front of the socket-outlet, the order of connection commencing from the slot on the radial  line shall be earth, active and neutral in a clockwise direction;  (f) All neutral conductors shall be connected to the neutral bar of the switchboard; and   (g) The consumers mains neutral shall be connected to the neutral bar of the main switchboard.",
  "3.3.3": "3.3.3   Test procedures   The following test procedures show methods of testing polarity. These are shown in:  (a) Figures 3.6 to 3.11, where the supply is not connected; and  NOTE — Figures 3.8 and 3.9 show alternative tests to those in figure 3.7 for submains incorporating an  earthing conductor and submains to a MEN distribution board respectively.  (b) Figures 3.12 to 3.14, where the supply is available.  In all situations earthing and insulation resistance should have been established by earlier tests and  the MEN connection should be intact.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  20 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.6 — Polarity test of consumers mains (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  21 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.7 — Polarity test of submains incorporating an earthing conductor (supply not  connected)—Method 1  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  22 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.       Figure 3.8 — Polarity test of submains incorporating an earthing conductor (supply not  connected)—Method 2    Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  23 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.  Figure 3.9 — Polarity test of submains not incorporating an earthing conductor (separate MEN  installation) (supply not connected)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  24 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.  Figure 3.10 — Polarity test of single pole switch using ohmmeter (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  25 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.  Figure 3.11 — Alternative polarity test of single pole switch using ohmmeter (supply not  connected)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  26 AS/NZS 3017:2007     COPYRIGHT    NOTE —  (1) Numbers indicate test sequence.   (2) This wiring configuration uses the neutral as a PEN conductor and therefore it forms part of the earth fault- loop.   (3) Because voltage indicators such as high impedance volt meters, neon or LED devices will operate  satisfactorily with high resistances within the circuit under test, they should not be used to verify the  integrity of the connections of the circuit.  Figure 3.12 — Polarity test of submains with MEN connection at outbuilding (supply available)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  27 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.13 — Polarity test of submains incorporating protective earthing conductor (supply  available)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  28 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.  Figure 3.14 — Polarity test of single pole switch using voltage indicator (supply available)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  29 AS/NZS 3017:2007     COPYRIGHT",
  "3.4.1": "3.4.1   Objective   Tests for correct circuit connections are necessary to ensure the following:   (a) Protective earthing conductors do not carry current in non-fault conditions; and  (b) No short-circuit exists, because a short-circuit current flowing between live conductors and  through part of the earthing system can cause considerable fire damage or personal injury,  particularly in high current locations.",
  "3.4.2": "3.4.2   Requirements   The active, neutral and protective earthing conductors of each circuit shall be correctly connected so  that:  (a) There is no short-circuit between the conductors;  NOTE: Any MEN or earth sheath return connection is not considered as a short-circuit.  (b) There is no transposition of conductors that could result in the earthing system and any  exposed conductive parts of the electrical installation becoming energised; and   (c) There is no interconnection of conductors between different circuits.",
  "3.4.3": "3.4.3   Test procedures   Testing should confirm that any resistance measured between the active and neutral conductors of a  circuit is consistent with the load. For example, on a socket-outlet circuit with no connected equipment  a high resistance (approximately infinity) should be expected; whereas on a 230 V, 4.8 kW water  heater circuit, a resistance of about 11 Ω should be expected.   The tests illustrated in figures 3.15, 3.16, 3.17, 3.18 and 3.19 show recommended methods of testing  for correct circuit connections which require the use of an ohmmeter. Some tests require the use of  resistors of known values.   Other methods may be applied, for example:  (a) An interconnected neutral can be detected by removing the circuit neutral at the switchboard  and proving that no connection to neutral exists at the equipment;  (b) Using a clip-on ammeter over the energized circuit conductors to verify that with all circuit  equipment operating, the equivalent active load current is also passing through the correct  circuit neutral; or   (c) With only one circuit energized and equipment operational, an incorrect or interconnected active  can be detected by using a voltage indicator to confirm that the load side of protective devices  on other circuits are not energized from the circuit under test.",
  "3.4.4": "3.4.4   Testing considerations   Testing considerations include the following:   (a) Transposition of conductors is not always obvious under certain operating conditions, but is  unsafe if:  (i) The protective earthing conductor becomes ‘open circuited’ causing one portion of the  conductor and any exposed conductive parts connected to it, to become ‘live’ when there  is a fault between live conductors and the portion of the protective earthing conductor  isolated from the earthing system  (ii) The protective earthing conductor becomes overheated by carrying the load of larger  neutral conductors; or   (iii) Work is carried out on a protective earthing conductor that has become live;   (b) For lighting circuits, unless all two-way and intermediate switching completes the circuit, the test  may not be complete because the luminaire is not in circuit; and  (c) Where RCDs are installed, tests need to be carried out on the load side of the RCDs.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  30 AS/NZS 3017:2007     COPYRIGHT  (d)     NOTE — Numbers indicate test sequence.   Figure 3.15 — Polarity and circuit connection test of lighting points using resistors (supply not  connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  31 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.16 — Polarity and circuit connection test of socket-outlet subcircuits using resistors  (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  32 AS/NZS 3017:2007     COPYRIGHT    NOTE —  (1) Numbers indicate test sequence.   (2) This test alone would not detect an active and earth reversal.  Figure 3.17 — Polarity and circuit connection test of socket-outlet subcircuits (supply not  connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  33 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.18 — Polarity and circuit connection test of equipment (supply not connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  34 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.19 — Interconnection test between conductors of different circuits (supply not  connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  35 AS/NZS 3017:2007     COPYRIGHT",
  "3.5.1": "3.5.1   Objective   Phase sequence testing is necessary to ensure that multi-phase equipment such as multi-phase  motors and semiconductor controlled equipment operates in a predictable manner.",
  "3.5.2": "3.5.2   Test procedure  If supply is available use a phase sequence tester in accordance with the manufacturer’s instructions.  If supply is not available test as shown in figure 3.20.      Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  36 AS/NZS 3017:2007     COPYRIGHT    NOTE —   (1) Repeat test for each multiphase outlet to confirm the sequence is the same for each.  (2) Numbers indicate test sequence.  Figure 3.20 — Check of phase sequence (supply not connected)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  37 AS/NZS 3017:2007     COPYRIGHT",
  "3.6.1": "3.6.1   Objective   The earth fault-loop impedance of a circuit is measured to ensure that, if a fault of negligible  impedance occurs between an active conductor and a protective earthing conductor or an exposed  conductive part, sufficient current will flow in the earth fault-loop to cause a protective device to  operate within a specified disconnection time.   NOTE —  (1) See figure 3.21 for a simplified earth fault-loop.   (2) The earth fault-loop impedance test can be made as follows:   (a) With supply connected (see 3.6.4.1); or  (b) With supply not connected (see 3.6.4.2).   (3) An earth fault-loop impedance tester functions by measuring voltage drop during a short duration fault,  applied by a function of the tester, and can only be used with the supply connected.   (4) Additional information on earth fault-loop impedance can be found in AS/NZS 3000.  NOTE —  (1) Resistance values for R e and Rph are given in table 3.2.  (2) Although supply from a distribution system is shown, the same principle applies where the  substation forms part of the electrical installation.  Figure 3.21 — MEN system (simplified) showing fault current ( Ia) path   MEN Connection L1 L2 L3 N Consumers  mains  Main  earthing  conductor Service  line Supply mains Main switchboard  Earth bar N bar Soil resistance between  electrodes relatively high.   Proportion of current  may be ignored  Faulty  equipment Fault current (I A)   Substation LV  earthing conductor Point of supply  Supply substation  A  C DE F H  BG RB RG  Re R h Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  38 AS/NZS 3017:2007     COPYRIGHT",
  "3.6.2": "3.6.2   Earth fault-loop   The earth fault-loop in a MEN system comprises the following parts, starting and ending at the point of  fault (see figure 3.21):    (a) The protective earthing conductor including the main earthing terminal/connection or bar and  MEN connection;  (b) The neutral-return path, consisting of the neutral conductor, (N), between the main neutral  terminal or bar and the neutral point at the transformer (the earth return path R G to RB has a  relatively high resistance and may be ignored in an MEN system);  (c) The path through the neutral point of the transformer and the transformer winding; and  (d) The active conductor as far as the point of the fault.  The earth fault-loop is normally regarded as consisting of the following two parts:  (e) Conductors upstream or \"external\" to the reference point; and  (f) Conductors downstream or \"internal\" to the circuit, from the reference point.  Figure 3.21 shows an active to earth fault, which for the purposes of calculations is deemed to be of  negligible impedance.  At the instant of the fault, current will flow through the earth fault-loop and its magnitude is only limited  by the total system impedance Z s that is obtained from all the individual impedances in the earth fault- loop as follows:  Zs = ZAB+ ZBC + ZCD + ZDE + ZEF + ZFG + ZGH + ZHA   In figure 3.21 impedances ZAB, ZBC, ZFG, ZGH and ZHA are all upstream of the protective device wit hin  the electrical installation under consideration and are regarded as being external to the reference  point. Hence they may be collectively referred to as Zext. The remainder that are downstream from the  reference point (or \"internal\") may be referred to as Zint. Therefore Zs = Zext + Zint.",
  "3.6.3": "3.6.3   Requirements",
  "3.6.3.1": "3.6.3.1   Supply connected   Maximum values of earth fault-loop impedance shall not exceed the values shown in table 3.1 or the  value of I a for the protective device being used in accordance with the manufacturer’s data.   The values of Zs in table 3.1 were calculated using the following equation:      Uo   Zs  =  —       Ia   Where:   Zs = earth fault-loop impedance   Uo = nominal phase voltage (230 V)   Ia = current causing automatic operation of the protective device, as follows:   Ia  for circuit-breakers is the mean tripping current as follows:   Type B = 4 times rated current   Type C = 7.5 times rated current   Type D = 12.5 times rated current   I a  for fuses are approximate mean values from AS 60269.1.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  39 AS/NZS 3017:2007     COPYRIGHT  Table 3.1  Maximum values of earth fault-loop impedance (Zs) at 230 v a.c.   Circuit-breakers   Type B Type C Type D  Fuses   Disconnection times",
  "0.4": "0.4 s  0.4 s 5 s    Protective  device rating      A  Maximum earth fault-loop impedance Zs Ω   6 9.58 5.11 3.07 11.50 15.33  10 5.75 3.07 1.84 6.39 9.20  16 3.59 1.92 1.15 3.07 5.00  20 2.88 1.53 0.92 2.09 3.59  25 2.30 1.23 0.74 1.64 2.71  32 1.80 0.96 0.58 1.28 2.19  40 1.44 0.77 0.46 0.96 1.64  50 1.15 0.61 0.37 0.72 1.28  63 0.91 0.49 0.29 0.55 0.94  80 0.72 0.38 0.23 0.38 0.68  100 0.58 0.31 0.18 0.27 0.48  125 0.46 0.25 0.15 0.21 0.43  160 0.36 0.19 0.12 0.16 0.30  200 0.29 0.15 0.09 0.13 0.23  NOTE —    (1) The impedance values are based on a normal operating temperature of  75 °C for the conductors when they are carrying maximum current. If there is  no load on the electrical installation being tested, the values are reduced to  80% (based on a conductor temperature of 20 °C).   (2) The types of circuit breakers (Type B, C and D) are based on the types  described in AS/NZS 60898.1.   (3) Fuses based on AS 60269.1 were previously known as BS 88 type fuses.   (4) When the nominal phase voltage of the electrical installation is not 230 V, Zs  may be determined by multiplying by a factor of Uo/230. For a nominal phase  voltage of 240 V, the factor would be ≈ 1.04.   (5) Five second disconnection times are not shown for circuit breakers as they  are intended to operate in the instantaneous trip zone.",
  "3.6.3.2": "3.6.3.2   Supply not connected   When tested in accordance with 3.6.4.2, the total resistance (Rphe) of the active and protective earthing  conductors of an individual circuit which forms part of the earth fault-loop shall not exceed the values  shown in table 3.2.   The values in table 3.2 were calculated using the d.c. resistance values for conductors at 20 °C as  specified in AS/NZS 1125 and the maximum lengths of circuits given in table B1 of AS/NZS 3000.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  40 AS/NZS 3017:2007     COPYRIGHT  Table 3.2  Maximum values of resistances   Conductor  size   Protective  device  rating  Circuit breaker  Fuses   Active Earth  Type B Type C Type D    mm 2   mm 2   A  Maximum resistances         Rphe Rph  Re  Rphe Rph Re  Rphe Rph Re  Rphe  Rph  Re   1 1 6 6.16 3.08 3.08 3.30 1.65 1.65 2.00 1.00 1.00 7.38 3.69 3.69  1 1 10 3.70 1.85 1.85 2.00 1.00 1.00 1.20 0.60 0.60 4.12 2.06 2.06",
  "2.5": "2.5 2.5 20 1.86 0.93 0.93 1.00 0.50 0.50 0.60 0.30 0.30 1.36 0.68 0.68  4 2.5 25 1.50 0.43 1.07 0.80 0.23 0.57 0.48 0.14 0.34 1.00 0.24 0.76  4 2.5 32 1.17 0.45 0.72 0.62 0.24 0.38 0.37 0.14 0.23 0.83 0.32 0.51  6 2.5 40 0.93 0.27 0.66 0.50 0.15 0.35 0.30 0.09 0.21 0.62 0.18 0.44  10 4 50 0.76 0.22 0.54 0.40 0.11 0.29 0.24 0.07 0.17 0.47 0.13 0.34  16 6 63 0.60 0.16 0.44 0.32 0.09 0.23 0.19 0.05 0.14 0.36 0.10 0.26  NOTE —    (1) The values, which have been rounded to two decimal places, are approximately 64% of the values given in table",
  "3.6.4": "3.6.4   Testing considerations",
  "3.6.4.1": "3.6.4.1   Supply connected   The earth fault-loop impedance should be measured using an instrument that has a facility for  measuring and indicating low values of impedance.   NOTE —  (1) Special training and advice should be obtained for measurement of earth fault-loop impedance on circuits  from a supply source rated over 100 A. For example, readings of less than 0.2 Ω require system voltage to  be constant (i.e. no cyclic load on the installation) and may require test lead length and fusing  compensation and higher test currents.  Guidance is given in IEC 61557-3.  (2) Earth continuity and resistance tests should be carried out on protective earthing conductors in  accordance with 3.1 before measuring the earth fault-loop impedance.   (3) It is preferable to measure the earth fault-loop impedance using the permanent network supply rather than  a temporary supply.   (4) The measuring circuit includes the impedance of the flexible test lead, which must be as supplied with the  meter. If the meter leads are fused, the fuse resistance must be taken into account.  The MEN connection is to be left intact.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  41 AS/NZS 3017:2007     COPYRIGHT  Measurements for a final subcircuit should be made with the instrument connected between the  furthest point on the active conductor and the corresponding point on the associated protective  earthing conductor, for example, at a socket-outlet.   NOTE —   (5) This test provides the maximum value of Zs for the complete circuit. Typical maximum values of Zs are  given in table 3.1.   (6) If an RCD operates during the earth fault-loop impedance test, the test result is considered satisfactory.",
  "3.6.4.2": "3.6.4.2   Supply not connected   When the supply is not connected the resistance of the conductors of an individual circuit which forms  part of the earth fault-loop may be measured by an ohmmeter as follows:   (a) Connect the active conductor and protective earthing conductor together at the origin of the  particular circuit (normally where the protective device is fitted). See figure 3.22;  (b) At the furthermost point on the circuit, connect one lead of the ohmmeter to the active conductor  and the other lead to the associated protective earthing conductor; and  (c) The measured value of resistance ( Rphe) shall not exceed the values in table 3.2 for the  appropriate conductors and protective device.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  42 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.  Figure 3.22 — Measurement of an individual circuit earth fault-loop impedance (supply not  connected)   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  43 AS/NZS 3017:2007     COPYRIGHT",
  "3.7.1": "3.7.1   Objective   Testing of an RCD is carried out to ensure that the RCD operates and disconnects the designated  circuit.   The function of the RCD is verified by the operation of the integral test device, or by the use of special  test equipment.   For New Zealand, RCDs shall be of a type where tripping is ensured for residual alternating current  and residual pulsating direct current (Type A).",
  "3.7.2": "3.7.2   Requirements",
  "3.7.2.1": "3.7.2.1   Testing by use of the integral test device  Operation of the integral test device shall cause the RCD to trip and disconnect the designated circuit.   NOTE —    (1) Tripping the RCD by means of the integral test device establishes:   (a) That the RCD is functioning correctly; and   (b) The integrity of the electrical and mechanical elements of the tripping device.  (2) Operation of the integral test device does not provide a means of checking:  (a) The continuity of the main earthing conductor or the associated circuit protective earthing  conductors;  (b) Any earth electrode or other means of earthing; or   (c) Any other part of the associated electrical installation earthing.   (3) Tripping the RCD by means of the integral test device, or by special test equipment such as a test plug  with a resistor between the active and earth pins, may be used to verify that the circuits required to be  protected by the RCD are protected.",
  "3.7.2.2": "3.7.2.2   Testing by special test equipment  The RCD tester shall apply the rated tripping current ± 5% and measure the tripping time with an  accuracy dependent on the nominal tripping time as follows:    Type of RCD Residual tripping  current I Δn  Maximum Tripping  Time  Accuracy  1 ≤10mA 40 ms ± 2 ms  General Any value 300 ms ± 8 ms    A current, equal to the rated tripping current, shall be “suddenly\" applied between the active and  protective earth and the operating time measured.  WARNING. Extreme care is needed to ensure that this test can be and is carried out safely. Be aware  that this test may cause a rise in voltage to earth on other exposed metal. Testing for earth continuity  in accordance with 3.1 shall be carried out prior to this test.    NOTE —  (1) Some RCDs may have a different result (approximately 10 milliseconds) depending on which point on the  wave the test is initiated. In case of doubt, the operating time at both 0° and 180° should be tested.  (2) Load leakage and stored energy can affect the result and increase the meter trip time indication. In case of  doubt, all loads on the circuit should be disconnected.  (3) Tests on three- or four-pole RCDs, used on a three phase supply, shall be tested with a three phase  supply connected. The tests shall be carried out individually on each phase in turn with all load and neutral  connections disconnected, as any standing leakage current on the load side may add or subtract  vectorially from the test current.  (4) The possible wave form of a fault current to earth can affect the operation of an RCD and RCD test  equipment.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  44 AS/NZS 3017:2007     COPYRIGHT  Where the source of supply is other than smooth sinusoidal, such as an inverter, the advice of the  manufacturer of the RCD tester should be sought. Further information is contained in AS/NZS 3000.  (5) When testing a circuit, RCD testers do not provide a means of checking:  (i) The continuity of the main earthing conductor  (ii) Any earth electrode or other means of earthing, or   (iii) Any other part of the associated electrical installation earthing other than the circuit under test.",
  "3.7.2.3": "3.7.2.3   Confirmation of RCD type  For New Zealand the RCD shall be verified as being Type A by the presence of the symbol    or  by the manufacturer’s compliance documentation.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  45 AS/NZS 3017:2007     COPYRIGHT",
  "3.8.1": "3.8.1   Objective   To specify methods for measuring resistances to ground which are related to various parts of the  installation. Typical values are included in the test clauses.    NOTE —  (1) The MEN system has a multiplicity of neutral earthing electrodes and an earth electrode at each  installation. The distribution neutral earth electrodes give the system ground resistance.  (2) The installation earth electrode is connected to the installation exposed conductive parts. Exposed  conductive parts are in contact, via bonding or fortuitously, with other grounded parts such as water pipes.  Bonding minimises the touch voltage between exposed conductive parts of the installation and grounded  conductive parts.  (3) The installation MEN connection connects the earth electrode to the supply neutral. As the supply neutral  also acts as a return path for earth fault currents it is a Protective Earth and Neutral (PEN).   (4) This system of bonding and earthing should minimise the touch voltage from the exposed conductive parts  to ground during normal operation. However, if the supply neutral (PEN) is disconnected the path through  the ground is the only path. The touch voltage to ground is then dependent on the resistance of the paths  to ground in series with the load resistance and the current flowing.  (5) Similarly, if the supply neutral (PEN) is high resistance, the touch voltage depends on the ground paths in  parallel with the neutral (PEN). On single phase installations this current is the same as the active current;  on three phase installations the neutral current is the vector sum of the active currents.  (6) During a fault the fault current should return to the transformer via the neutral (PEN) and operate the  overcurrent or RCD protection. If the neutral is open circuit or high resistance, the voltages to neutral will  be unbalanced and a voltage will exist from neutral (PEN) to the exposed conductive parts and ground,  and current may flow in water pipes and voltages may exist across disconnected pipes. In the event of an  open or high resistance neutral, a single earth electrode cannot be relied upon to provide a low resistance  path sufficient to operate the protective devices",
  "3.8.2": "3.8.2   Requirements  AS/NZS 3000 does not specify a maximum value for the resistance of the earth electrode. However,  when the earth resistance is required to be measured any of the procedures in 3.8.3 may be used.",
  "3.8.3": "3.8.3   Test procedures",
  "3.8.3.1": "3.8.3.1 Test using an earth fault-loop impedance meter   The approximate earth electrode resistance may be obtained by the use of a proprietary earth fault- loop impedance meter.   With the MEN connection removed, measure the ‘ground loop without PEN’ impedance by connecting  an earth fault-loop impedance meter between the incoming active supply (for example, at the main  switch) and the main earth.  The ‘ground loop without PEN’ impedance includes the installation ground resistance (the earth  electrode in parallel with any bonding to grounded exposed conductive parts) in series with the  distribution system ground resistance to the PEN, the transformer impedance and  the active  conductor impedance.  The approximate value obtained by the use of a proprietary earth fault-loop impedance meter is  typically in the order of 10 Ω to 50 Ω in good soil conditions with non-metallic water pipes.     NOTE — This test could be carried out in conjunction with the test in 3.10.2.1  WARNING. As this test procedure removes the parallel  connection between the earthing system and  the supply neutral, ensure there is no current flowing in the MEN connection before removing it.",
  "3.8.3.2": "3.8.3.2 Test of the resistance to ground of the installation earth electrode using the ‘fall of potential  method’  When using this method, a proprietary meter, or the method in figure 3.23, may be used.    NOTE — IEC 61557-5 specifies that the meter shall have a maximum output voltage of 50 V and a maximum  current of 3.5 mA.  When using the test in figure 3.23, if the three readings obtained in sequences 8 and 10 are  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  46 AS/NZS 3017:2007     COPYRIGHT  substantially the same, the electrode resistance is the mean of the three values. If the readings are not  substantially the same, the test should be repeated with the distance between T and T 1 increased.  The approximate value obtained by the use of a proprietary meter is typically in the order of 50 Ω to  200 Ω in good soil conditions.   WARNING. Extreme care is needed to ensure that this test can be and is carried out safely. Be aware  that this test may cause the touch voltage of extraneous, exposed, conductive parts of the installation  to rise.",
  "3.8.3.3": "3.8.3.3 Test using an earth ground clamp meter  A proprietary earth ground clamp meter may be used to measure the loop impedance of the earth  electrode.    NOTE — The meter measures the loop impedance by inducing a voltage into the circuit and measuring the  corresponding current within the loop.  Measure the ‘ground loop to PEN’ impedance by placing the jaws of the ground clamp meter around  the electrode or the main earth conductor connected to it.  The 'ground loop to PEN' impedance includes the installation ground resistance (the earth electrode in  parallel with any bonding to grounded exposed conductive parts), to the PEN (via the system neutral  earth resistances) but excludes the transformer impedance and the active conductor impedance.   The approximate value obtained by the use of a proprietary meter is typically in the order of 10 Ω to  50 Ω in good soil conditions.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  47 AS/NZS 3017:2007     COPYRIGHT    NOTE — Numbers indicate test sequence.   Figure 3.23 — Measurement of the resistance of the earth electrode  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  48 AS/NZS 3017:2007     COPYRIGHT",
  "3.9.1": "3.9.1   Objective   When an item of electrical equipment is suspected of causing an electric shock, touch voltage tests  are performed to ensure that shock currents resulting from contact between exposed metal of the  electrical equipment and extraneous conductive parts do not exceed the IEC shock current limits  specified in AS/NZS 60479-1. In the case of earthed equipment, the touch voltage between the  earthed metal of the electrical equipment and an item of equipment earthed through another earth ing  conductor is usually the voltage drop along the protective earthing conductor (See figure 3.24).  In the case of Class II (double insulated) equipment containing switch mode power supplies, the touch  voltage between the extraneous metal of the electrical equipment and either earthed metallic  equipment or extraneous conductive parts may be due to capacitive coupling.        Figure 3.24 — Example of touch voltage",
  "3.9.2": "3.9.2   Requirement  The severity of an electric shock is dependent, among other factors, on the magnitude of the volt age  across the human body, or part thereof, and the time it is present.  The touch voltage shall not exceed the values specified in AS/NZS 3000.    NOTE — The touch voltages specified in AS/NZS 3000, dependent on environmental conditions, are:  (a) 50 V a.c. or 120 V ripple free d.c.;   (b) 25 V a.c. or 60 V ripple free d.c.;   (c) 12 V a.c. or 30 V ripple free d.c.; and   (d) 6 V a.c. or 15 V ripple free d.c.   Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  49 AS/NZS 3017:2007     COPYRIGHT",
  "3.9.3": "3.9.3   Test procedures  The test procedure for measurement of touch voltage is shown in figure 3.25. A high impedance  voltmeter, i.e. an input impedance greater than 5 MΩ, must be used.        NOTE —  (1) A 2 kΩ resistor is used to simulate the body resistance of a typical person.  (2) Numbers indicate test sequence.   (3) The 2 kΩ resistor is a simplified version of the circuits shown in AS/NZS 60990.    Figure 3.25 — Measurement of touch voltage  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  50 AS/NZS 3017:2007     COPYRIGHT",
  "3.10.1": "3.10.1   Objective   To ensure the incoming neutral [PEN] connections are of low resistance so that fault protective  devices operate correctly and touch voltages are minimised.",
  "3.10.2": "3.10.2   Test procedures",
  "3.10.2.1": "3.10.2.1 Test using an earth fault-loop impedance meter  The incoming neutral can be tested by using a proprietary earth fault-loop impedance tester as  follows:  (a) Turn all main switches OFF;  (b) To remove all alternate current paths, for example, water pipe bond, remove MEN connection  and incoming neutral from the neutral bar at the main switchboard; and  (c) Measure between the incoming active(s) on line side of main switch and incoming neutral.  NOTE —  (1) In multi-phase installations, the readings should be substantially the same.  (2) Expert advice is required to reconnect earth fault-loop testers for active to neutral tests instead of active to  earth tests.  (3) If the earth fault-loop impedance is greater than 0.5 Ω consult the electricity network provider.",
  "3.10.2.2": "3.10.2.2 Test using a clamp type ammeter  The condition of the supply neutral may be assessed by measuring the current in the consumers  mains active(s) and neutral conductors, the main earthing conductor and the MEN connection. With a  substantial load such as an electric range or water heater applied, use a clamp ammeter to measure  the current flow in the active and neutral conductors separately, upstream of the MEN connection, and  in the MEN connection. For multiphase installations, place the clamp meter around all active  conductors simultaneously, ensuring the line and load of each phase conductor is orientated the same  way.  NOTE —   (1) The current flowing in the active conductor(s) and the neutral conductor should be substantially the same.  (2) If a large proportion of the active current is flowing in the main earthing conductor and MEN connection,  there is the possibility of a continuity problem with the consumer mains/service neutral connections for that  installation.  (3) If the sum of the currents in the main neutral conductor and MEN connection exceeds that in the active  conductor(s), there is a possibility of a continuity problem with another installation further from the  distribution transformer than the installation under test. This can be confirmed by checking for current in  the main neutral conductor and the MEN connection with the main switch(es) off.  (4) This test requires a competent person trained in this testing technique.",
  "3.10.2.3": "3.10.2.3 Test using a volt meter  The procedure for testing the continuity and high resistance is shown in figure 3.26.  NOTE — A substantial difference, ie > 5V, indicates a loose or high resistance neutral connection either at the  switchboard, overhead line connector box or to the consumers mains or service line.",
  "3.10.2.4": "3.10.2.4 Test using a proprietary meter  Some proprietary test equipment measure voltages under load and no load and give values for  consideration.  Special training in the use of the test equipment and interpretation of test results may be required.",
  "3.10.3": "3.10.3   Testing considerations  A large number of shocks are found to be the result of loose or poor neutral connections and a load  test shall always be followed up by a physical and visual examination of connections in the main  neutral back to the distributor’s mains, taking particular note of line taps, aluminium to copper  connections, etc.  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  51 AS/NZS 3017:2007     COPYRIGHT        WARNING: Due to the significant rise in voltage on earthed equipment,  including the earth electrode, during the course of this test, the premises should  be vacated by all persons and the test conducted by an experienced person  trained in this technique.    NOTE — Numbers indicate test sequence.   Figure 3.26 — Test for continuity and high resistance of the incoming neutral (supply available)  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8  52 AS/NZS 3017:2007      NOTES  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8     Standards Australia  Standards Australia is an independent company, limited by guarantee, which prepares and publishes  most of the voluntary technical and commercial standards used in Australia. These standards are  developed through an open process of consultation and consensus, in which all interested parties are  invited to participate. Through a Memorandum of Understanding with the Commonwealth  government, Standards Australia is recognized as Australia’s peak national standards body.  Standards New Zealand  The first national Standards organization was created in New Zealand in 1932. The Standards  Council of New Zealand is the national authority responsible for the production of Standards.  Standards New Zealand is the trading arm of the Standards Council established under the Standards  Act 1988.  Australian/New Zealand Standards  Under a Memorandum of Understanding between Standards Australia and Standards New Zealand,  Australian/New Zealand Standards are prepared by committees of experts from industry,  governments, consumers and other sectors. The requirements or recommendations contained  in published Standards are a consensus of the views of representative interests and also take  account of comments received from other sources. They reflect the latest scientific and industry  experience. Australian/New Zealand Standards are kept under continuous review after publication  and are updated regularly to take account of changing technology.  International Involvement  Standards Australia and Standards New Zealand are responsible for ensuring that the Australian  and New Zealand viewpoints are considered in the formulation of international Standards and that  the latest international experience is incorporated in national and Joint Standards. This role is vital  in assisting local industry to compete in international markets. Both organizations are the national  members of ISO (the International Organization for Standardization) and IEC (the International  Electrotechnical Commission).  Visit our web sites  www.standards.org.au  www.standards.co.nz  www.standards.com.au  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8         GPO Box 476 Sydney  NSW  2001  Administration  Phone (02) 9237 6000  Fax (02) 9237 6010  Email mail@standards.org.au  Customer Service  Phone 1300 65 46 46  Fax 1300 65 49 49  Email sales@standards.com.au  Internet www.standards.org.au  Level 10 Radio New Zealand House  155 The Terrace Wellington 6001  (Private Bag 2439 Wellington 6020)  Phone (04) 498 5990  Fax (04) 498 5994  Customer Services (04) 498 5991  Information Service (04) 498 5992  Email snz@standards.co.nz  Internet  www.standards.co.nz  ISBN 0 7337 8422 4 Printed in Australia  Master Electricians Australia- Reproduced under copyright Licence number 1602-c100-8"
}