{
  "4777.1": "4777.1    Customer completes agreement with  distributor for Small IES EG Connection.     Retailer sends SOR to distributor and MP to  carry out work.  EC sends EWR to distributor.  Distributor or MP advises  customer/owner/EC of  defects.  Note: The customer must  decide whether a Gross or Net  Energy Scheme is to be used.   EC to consult the QECM and  QEMM before work is  commenced.   Note: The Queensland  Government Solar Bonus  Scheme or Feed-in-Tariff  requires the installation of a  Net Energy scheme.  Note: This diagram  represents a general  description of the process.   Some of the steps may occur  at different times depending on  the situation.  Customer /owner ensures EC has provided  Certificate of Testing and Compliance.  Queensland Electricity Connection Manual   Page 15 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  7) Initial Connection - High Voltage Installation                                                                                                             Customer   Discusses project with  distributor.  Designer discusses project  with distributor.   Installation of HV equipment is  completed.  HV accredited auditor visits site  and issues report.  EC advises customer to contact  retailer.  Metering provider completes  metering and distributor  connects HV installation  providing documentation is  complete.  Appoints competent person to  manage or design project.  Appoints an electricity  retailer.  Retailer/Customer appoints  metering coordinator   Distributor provides customer  with connection agreement.    Customer advises retailer that  project is ready for connection.   HV accredited auditor is  appointed by the customer,  designer or EC.   Retailer issues SOR to  distributor and notifies metering  coordinator.    EC rectifies any defects found  by accredited auditor and  submits EWR to distributor.  Metering provider advises  metering coordinator who  notifies retailer of connection.  Note: This diagram  represents a general  description of the process.   Some of the steps may occur  at different times depending  on the situation.  Metering Coordinator appoints  metering provider and  metering data provider.  Queensland Electricity Connection Manual   Page 16 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK     Queensland Electricity Connection Manual   Page 17 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   IMPORTANT INFORMATION   Use of this document  This document is to be read in conjunction with the current:  (a) Australian Standards, in particular AS/NZS 3000 (Wiring Rules).  (b) Relevant Legislation and respective Regulations and Codes (see References pg. 5).  (c) The National Electricity Rules.   (d) QECM addendums published in relation to specific topics (on and from the date they are  published).  (e) Queensland Electricity Metering Manual (QEMM)  Note:  The requirements of the Queensland Electricity Legislation are to be considered in  the design, installation, operation and maintenance of the customer’s electrical installation  This is a self-contained document except where it specifically refers to other related documents  and supersedes previous versions of both the Energex  and Ergon Energy  Electricity  Connection and Metering Manuals.     Scope  This document provides guidelines fo r the connection of supply, metering and load control  arrangements of a customer's installation that apply in respect of the establishment or  alteration of the connection, and in respect of the ongoing connection to the relevant  distributor’s network .  Where departures from these guidelines may be necessary, prior consultation with the  distributor will be required (Refer to Section 1.4, Exceptional Circumstances).  Note: If there is any inconsistency between the requirements and obligations under this  QECM and:   (a) any applicable legislation (i.e. the Electricity Act 1994, the Electrical Safety Act 2002 and  their respective Regulations or Codes of Practice), AS/NZS 3000 (Wiring Rules) and the  National Electricity Rules; or  (b) the terms contained in the distributor ’s connection offer, or the applicable connection  agreement,  then the relevant legislation set out above (at Section 1.2(a)), shall prevail in the first instance,  followed by any applicable connection offer or agreement for connection (referred to in Section",
  "1.2": "1.2mm    480mm x  460mm  (high) (wide)    600mm x  550mm  (high) (wide)          75mm        185mm     Queensland Electricity Connection Manual   Page 120 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK.  Queensland Electricity Connection Manual   Page 121 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  APPENDIX B - GLOSSARY OF TERMS    Accredited Auditor A person appointed under section 129 of the Electrical Safety Act 2002  to audit high voltage or hazardous area installations before connection  to supply.    Further information may be obtained from the Electrical Safety Office.    AEMO ‘Australian Energy Market Operator’ is responsible for the day to day  management of wholesale and retail energy market operations and  emergency management protocols; on- going market development  required to incorporate new rules, infrastructure and participants; and  long term market planning through demand forecasting data and  scenario analysis.    AF Receiver See “Network Device”     Capital Contribution A contribution towards costs associated with a standard control service,  such as any necessary augmentati on of connection assets at the  connection point, extension or augmentation of the shared distribution  network to accommodate the connection/modification.   A capital  contribution will only be levied where there is a difference between the  cost to provide the connection service and the revenue that will be  earned by the distributor from the connection service.    Card Operated Meter A meter that contains control equipment that switches on and off in  accordance with the amount of credit stored in the meter.    Common Property        Community Title  Development    Common property means so much of a parcel as from time to time is  not comprised in any lot.  Refer to Building Units and Group Titles Act  1980(Qld)    A subdivision of land in which individual lots do not necessarily have  immediate access to a dedicated road serve and which comply with the  Body Corporate and Community Management Act (Qld).     Connection Point     The agreed point of supply established between Network Service  Provider(s) and another Registered Participant, Non- Registered  Customer or franchise customer.    Note (1): AS/NZS 3000 refers to the ‘Connection Point’ as the ‘Point  of Supply’. Previous editions of AS/NZS 3000 referred to the  ‘Connection Point’ as the ‘consumer’s terminals’.  Note (2): The Queensland Electricity Regulation 2006 uses the  definition ‘consumer’s terminals’.  Note (3): The National Electricity Rules  uses the definition  ‘connection point’.  Note (4): This is the point which differentiates the responsibilities of  the Network Service Provider and the application of AS/NZS  3000.     Connection Policy           The distributor’s connection policy provides an outline of connection  services, when connection charges may be payable by customers and  how those charges are calculated.    Queensland Electricity Connection Manual   Page 122 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Consumer Mains The conductors between the connection point  and the main  switchboard.     Consumer’s Terminals See connection point.    Controlled Load,   Controlled Supply      Those loads  that are wired separately from other appliances, are  controlled by means of frequency injection receiver or time clock and   are separately metered from the remaining load at the metering point.     Current Transformer  Metering  A metering arrangement where electricity flow is measured by a meter  using current transformers (CTs).    Customer A person, including a relevant body corporate, who receives, or wants  to receive, a supply of electricity for a premise from an electricity entity  or special approval holder.    Direct Connected Meter A meter where the electricity flow is directly measured by the meter i.e.  the current under measurement passes through the meter itself.    Distribution Entity,  Distributor    A distribution entity is a person who holds a distribution  authority that  authorises its holder to supply electricity using a supply network within  its distribution area.  See sections 37, 38 and 39 of the Electricity Act  1994 (Qld).  (Refer to definition for Relevant Distribution Entity).    EG system (s) One or more embedded generating units and auxiliary equipment that  are interconnected with a distributor’s network.    Electrical Contractor  (EC)   A person licensed under the Electrical Safety Act 2002  to conduct a  business or undertaking that includes the performance of electrical  work.    Electrical Work  Request (EWR)  The request from the customer’s electrical contractor to a distributor to  perform a distribution service e.g.  (i) Energex - Form 2; or  (ii) Ergon Energy - Form 2 - Request for Initial Connection, Metering  Change or Service Alteration    Energex Energex Limited - ABN 40 078 849 055    Enhanced Metering A scheme, which is not normally considered to be part of standard  metering as described in this manual (e.g. has pulse inputs, outputs, or  remote communications).  Additions that are above and beyond the metering provided in this  manual.    Ergon Energy    Energy Storage System  (ESS)    Ergon Energy Corporation Limited ABN 50 087 646 062    A system comprising one or more batteries that store electricity  generated by Distributed Energy Resource or directly from the grid, and  that can discharge the electricity to loads.     EVSE Electric Vehicle Supply Equipment as defined in AS/IEC 62196    Excluded Customer A customer who cannot choose their retailer.  For example, customers  connected to isolated power systems.    Queensland Electricity Connection Manual   Page 123 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Gross Energy Scheme The Gross Energy Scheme separately meters the full energy output of  the Small IES EG Connection.  The energy consumed at the premises  is metered normally.     High Voltage Metering A high voltage metering arrangement where electricity flow is  measured by a meter using current transformers and voltage  transformers.     Interconnected Connection of an EG system  capable of parallel operation with a  distributor’s network.    Isolated Power System A supply network that does not form part of and is not connected to the  national grid and may include an isolated feeder.    Large Customer A customer whose annual consumption is equal to, or greater than,  100MWh, and is connected to the distributor’s network.    Large Non-market  Customer  A large non-market customer, for premises, is a large customer for the  premises who is also a non-market customer  for the premises.     Metering Coordinator A person who has been  registered by AEMO under Chapter 2 of the  National Electricity Rules to engage in the coordination and provision  of metering services at a connection point in accordance with Chapter  7 of the National Electricity Rules.    Metering Data Agent An agent appointed by AEMO to undertake the collection, processing  and transfer of metering data to AEMO and other registered  participants.     Metering Data Provider    A person who meets the requirements listed in schedule 7.3 of the  National Electricity Rules and has been accredited and registered by  AEMO to undertake the collection, processing, storage and delivery of  metering data and the management of NMI Standing Data.    Metering Provider (MP) A person who meets the requirements listed in schedule 7.2 of the  National Electricity Rules and has been accredited and registered by  AEMO to undertake the provision, installation and maintenance of  metering installations.     Note: The distributor is the metering provider in non-NEM areas.     NATA The National Association of Testing Authorities.    National Electricity  Rules    The rules under which the National Electricity Market operates.     National Metering  Identifier (NMI)  A National Metering Identifier (NMI) is a unique national   identifier that relates to the metering installation at a customer’s  premises.    Queensland Electricity Connection Manual   Page 124 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Net Energy Scheme The Net Energy Scheme provides for the separate measurement of the  energy supplied from the LV network to the customer’s installation in  excess of the Small IES generation, and the excess energy supplied to  the LV network from the premises by the Small IES after the energy  needs at the premises are met.    Network Device,  AF Receiver  Apparatus or equipment that:   (a) enables a distributor to monitor,  operate or control the network for the purposes of providing network  services, which may include switching devices, measurement equipment  and control equipment; and (b) is located at or adjacent to a metering  installation at the connection point of a customer.    NMI Classification  Code  In accordance with the Market Settlement and Transfer Solution  Procedures:  Small - annual consumption less than 100MWh  Large - annual consumption equal to, or greater than 100MWh.    Point of Attachment The point at which aerial conductors of a service line or aerial consumer  mains are terminated on a customer’s structure.    Point of Entry The point at which the consumer mains or the underground service  cable enters a structure.    Premises Premises includes -  (a) a building or other structure; and  (b) a part of a building or other structure; and  (c) land where a building or other structure is situated.    Premises, of a customer, means premises owned or  occupied by the customer.  Queensland Electricity Act 1994    QECM    QEMM    Queensland Electricity Connection Manual     Queensland Electricity Metering Manual   QECMM Queensland Electricity Connection and Metering Manual.  On 24 th  August 2018 the QECMM content was separated into two new  documents, the QECM and the QEMM and the QECMM was  withdrawn.     Relevant Distribution  Entity,  Distributor    The relevant distribution entity for a premises, means the distribution  entity to whose supply network the premises are, or will be, connected.      Note: For the purposes of this document the relevant distribution  entity will be referred to as the ‘distributor’.    Relevant Retail Entity,  Retailer    The relevant retail entity for a premise, means the retail entity who,  under a retail contract, supplies or has agreed to supply electricity to  the premises.      Note: For the purposes of this document the relevant retail entity will  be referred to as the ‘retailer’.    Retail Entity A person who holds a retail authority to sell electricity and retail services  (a ‘retail authority’ authorises its holder to provide customer retail  services under the terms of the authority).  Queensland Electricity Connection Manual   Page 125 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     RPEQ Registered Professional Engineer Queensland.    Rural/Isolated Area    A rural/Isolated area is defined as one with a density of less than 5 lots  per hectare (i.e. would generally have a dedicated supply transformer).      Note: This definition is only applicable within the Ergon Energy   distribution area.    Service Line An electric line that-   (a) forms part of the works of an electricity entity; and   (b) connects consumer terminals to  -     (i) other parts of the works of the electricity entity; or   (ii) the works of another electricity entity.    Schedule 9 of the Queensland Electricity Regulation 2006.    Small Customer A customer who consumes less than 100MWh per annum and is  connected to the distributor’s network.    Small IES           Small IES Embedded  Generation Connection      Micro-embedded generators of the kind contemplated by Australian  Standard AS/NZS 4777 (Grid connection  of energy system via  inverters) up to 30kVA for which a Small IES EG Connection is  appropriate.     A connection between Small IES and a distribution network.       SOR       Service Order Request - This is a request from a Retailer to a  Distributor to perform a distribution service (e.g. New Connections,  Metering Alterations and Service Upgrades). It is also referred to as a  B2B request.    Suitable Mains  Connection Box      A mains connection box that is deemed to be compliant with the  distributor’s technical specifications. Details are available by  contacting the distributor via the methods listed on page 1      Two element Meter    A single phase two element device which includes both metering and  load switching within one meter.     Type 1-7 Metering  Installation    As defined in the National Electricity Rules  Unmetered Supply A Type 7 metering installation classification (NER) where a metering  installation does not require a meter to measure the flow of electricity  in a power conductor and accordingly there is a requirement to  determine by other means the energy data that is deemed to flow in  the power conductor and managed by the relevant Distribution Entity.    Urban A residential area with a system of street lighting.            Queensland Electricity Connection Manual   Page 126 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK.    Queensland Electricity Connection Manual   Page 127 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  APPENDIX C - AMENDMENT RECORD    Please note:  It is not possible to cover all of the changes in the following list, nor can the changes  be covered in the detail and context as they appear within the manual.  As an  Electrical Contractor  it is the responsibility of you and your endorsees to be fully c onversant with the content and  requirements of the Queensland Electricity Connection Manual.    Date 18/06/2020 Previous Version: Version 02 of the QECM      Section Description   Addition of Look Up and Live Details  1 Updated contact details for dispensations  2 Additional details provided around Embedded  Generation and supply beyond boundaries.  3 Clarity around connection process and maximum  demands – Alignment of Connection Policy  4 Changes to standard requirements for switched loads  and addition of motor requirements  5 Minor changes  6 Clearer definitions of category or works. Clearer  expectation on works to be performed.   7 Tariff Reform Alignment  8 Minor Changes  9 Minor Changes",
  "2.1": "2.1 (and must not be less than 0.8 lagging).  If the power factor falls outside the power factor range specified in TABLE 2.1 at the connection  point, the customer will be responsible for taking appropriate action to ensure compliance (as  agreed with the distributor).  TABLE 2.1 provides the power factor performance standard.  TABLE 2.1    POWER FACTOR PERFORMANCE STANDARD  Nominal Supply Voltage Power Factor Range  50kV - 250kV 0.95 lagging to unity  1kV <50kV 0.90 lagging to 0.90 leading  <1kV* >0.8 lagging but not leading  * Electricity Regulation 2006.  At all other voltage ranges the requirements are as specified by the  National Electricity Rules, unless detailed in a contract.    Customers shall ensure that shunt capacitors installed for power factor correction are designed  to avoid attenuating the distributor’s  audio-frequency signals used for load control.  The  distributor will supply the details of the audio- frequency signals in any region upon request.  Customers are also required to meet the harmonic emission limits specified for their installation  even under resonant conditions due to their capacitor bank.   Interference with Supply of Electricity to Other Customers  Customers shall take reasonable precautions to prevent transformer arc welding machines,  motor starting, fluorescent lighting, Small IES EG Connections and any other equipment from  interfering with the satisfact ory operation of the distributor’s network or interfering with the  distributor’s supply of electricity to other customers etc.  The requirements of AS/NZS 61000 series standards \"Electromagnetic Compatibility (EMC)\"  shall always be observed.  The fact that t he distributor may have connected the apparatus or equipment causing the  interference shall not exempt the customer from this requirement. Also see Chapter 4 of this  manual.  Note: Customers with an electrical installation or equipment which may be sensitive to voltage  variation, transients, loss of one or more phases of supply or due to leakage current  are advised to install protective equipment to limit possible damage.   Queensland Electricity Connection Manual   Page 25 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Supply Beyond Property Boundary  The distributor shall be contacted prior to finalising any proposal to install an electrical  installation on public land or extending wiring and equipment from an electrical installation  across any property boundary.   Section 24(1) of the Electricity Regulation 2006 (Qld) states a person may install and  operate, on a place beyond the person’s property (including on a public controlled place), a  low voltage electric line forming part of the person’s electrical installation if –   (a) the person as consulted with all entities who may have an interest in the proposed  location of the electric line; and   (b) the entities have stated in writing that they have no objection to the installation or  operation of the electric line; and   (c) the installation and operation of the electric line is not likely to cause fire or a person to  suffer an electric shock.   The customer must obtain the approval of the relevant authorities to install an electrical  installation in the road reserve and provide any approvals to the distributor before proceeding  with the installation and operation of the proposed low voltage electric line (unless otherwise  agreed in writing with the distributor). Additionally, the proposed low voltage electric line must  be installed in accordance with AS/NZS 3000 and in accordance with any requirements or  conditions imposed by an applicable authority or the distributor.   This shall be considered an exceptional circumstances to which Section 1.4 applies.   High Voltage Installations  Any person intending to install high voltage equipment at a premise shall consult the distributor  before taking steps to obtain or install such equipment.  Where the distributor  agrees with a customer’s  request for a high voltage connection, and  subject to certain conditions (such as a minimum demand being met ), the agreed voltage is  the standard voltage for the supply (Refer to the Electricity Regulation 2006 for standard  voltages).  The distributor will provide a connection offer or connection agreement outlining the  applicable conditions and requirements.  The Electrical Safety Act 2002  (Qld) requires all new or altered high voltage electrical  installations to be inspected by an Accredited Auditor  before connection to supply.  For  additional information on Accredited Auditors contact the Electrical Safety Office.  The auditor  should be involved in the project at an early stage.  More information in relation to high voltage installations is included in Chapter 9 of this manual   Customer's Generating Systems    General  The installation of customer’s generating systems shall comply with  AS/NZS 3000   (Wiring Rules).  The consumer mains neutral shall not be switched or broken on the  distribution supply side of the MEN connection.  The generating system neutral is  required to be clearly identified at the main neutral link.   Non-Parallel Operation with Distributors Supply  Customer's generating system for emergency supply  This section applies for the installation of generating system on a customer’s premises  to provide a supply of electricity to the customer ’s electrical installation, during an  interruption to the supply of electricity.  (a) The customer shall ensure that, when the generating system is operating to give  emergency supply, it is installed with effective isolation between: ―  Queensland Electricity Connection Manual   Page 26 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (i) all active conductors of the part of the electrical installation or electrical  installations to which the generating system is connected; and  (ii) the part of the electrical installation still connected to the supply from the  distributor.  (b) The connection of the generating system shall be so arranged that the metering  provider’s revenue meters do not meter the alternate supply  and all metering  equipment, including CTs are able to be isolated to enable access whilst the  generating system is in service (i.e. the changeover switch must be inst alled on  the load side of the meter).    Parallel Operation with Distributor’s Supply   Customer's EG System for interconnection to supply network  (a) A customer shall not install generating plant for interconnection with the  distributor’s supply network without prior agreement, which is to be documented  in a written agreement.   (b) The agreement shall include the conditions for securing safe and stable parallel  operation of the supply network and the generating system. ( refer to section 28  of the Electricity Regulation 2006(Qld)).  (c) The generating system shall only be connected to a single tariff . A generating  system shall not be enabled to connect and supply e quipment which is being  supplied on an alternate tariff. Similarly, equipment connected to a control tariff  shall not be connected to a tariff other than the control tariff.  Note: Embedded g eneration is allowable from all forms of alternative energy  supplies such as solar panel (photovoltaic), wind turbine, diesel generation  etc.  Refer to Chapter 8 for details of the metering schemes for interconnection of Embedded  Generating systems connected to the distribution network.  Appropriate revenue metering will be installed in accordance with the negotiated supply  arrangements.   Determination of Maximum Demand  Unless limited by a fixed setting circuit breaker, the determination of the maximum demand of  an installation shall be calculated, measured or assessed in accordance with the guidelines  set out in AS/NZS 3000 (Wiring Rules).   Requirement for Circuit Breakers in Rural/Isolated Areas  The distributor requires circuit breaker/s for main switch/s as part of the customer’s installation  and these circuit breaker/s are required to coordinate with the service fuse/circuit breaker.  The  distributor may require the customer's protective device to be changed or altered to provide  adequate discrimination.  (Refer also to sections 29 and 30 of the Electricity Regulation 2006,  (Qld)).  Notes:  1. These regulations refer to the customer owned circuit breaker main switch/s provided as  part of the customer's installation and not to the customer's  sub-circuit protection or the  distributor’s service fuse/circuit breaker.  2. Refer to Glossary of Terms for definition of rural/isolated area.    Queensland Electricity Connection Manual   Page 27 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   SUPPLY APPLICATIONS   General  At the earliest opportunity, negotiations should commence with the distributor in respect of the  costs and availability of supply to:  • a new electrical installation  • a change of load, generation or storage capacity  • a new or altered connection point.   For a new or altered supply, the service capacity available to the customer shall be detailed in  the connection offer and/or connection agreement.    Types of Connection Offer   Basic Connection  The maximum permitted supply across the connection point  from the distri bution  system is:  (a) For urban premises connected to lines other than SWER lines is 100 A per phase;  (b) For rural premises connected to lines other than SWER lines is 80 A  per phase;  and   (c) for SWER lines is 40 A;  Unless otherwise approved by the distributor in your connection application a maximum  of 80 A fuse will be fitted. Refer to Chapter 6 for direct connected or current transformer  metering requirements.    Negotiated Connection  Where the connection service sought is not a basic connection service, or the  customer elects to have a negotiated connection contract, then the negotiated  connection process will apply. Further information on the negotiated connection  process is available from the distributor.   Determination of the Number of Phases to be Installed  The number of phases provided to supply load at an installation shall be the number required  by Chapter 4 of this manual for individual switched equipment or the number determined by  this section, whichever is the greater.  Note: The electrical contractor or designer should consult with the customer to determine future  loading requirements.  Provision for additional phases or larger consumer mains may be  required (e.g. air conditioning load, Small IES, EVSE).   Single Customer Installations   Where only single-phase loads are installed on the premises, if the maximum demand  as calculated in accordance with AS/NZS 3000 (Wiring Rules) is:  (a) not greater than 100 A, then supply shall be via single-phase, 2-phase or 3-phase  network connection as requested;  (b) greater than 100 A, then supply shall be 3 -phases and neutral  network  connection.  The distributor approves the use of 3-phase underground or overhead supply where 3- phase loads (e.g. air conditioner or pump) is connected and the remainder of the  installation is balanced across the 3-phases.   Queensland Electricity Connection Manual   Page 28 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Multi Customer Installations  Where only single-phase loads are installed on the premises with multi customers the  number of phases shall be determined by the following methods:  (a) A maximum of two individually metered units may be connected to a single-phase  network connection if the maximum demand calculated in accordance with  AS/NZS 3000 (Wiring Rules) does not exceed 100 A.  (b) Where two individually metered units maximum demand exceeds 100 A then  supply shall be 3-phases and neutral network connection.   (c) Where there are more than two individually metered units, the installation shall  be arranged for a three -phase network connection (e.g. three uni ts - one per  phase) unless otherwise advised by the distributor.     Queensland Electricity Connection Manual   Page 29 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK    Queensland Electricity Connection Manual   Page 30 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   BALANCING OF LOAD AND LIMITATION ON EQUIPMENT   General  The load of an installation (including all primary and secondary tariff loads) , or separately  metered portion of an installation supplied by separate consumer mains or submains, shall be  so balanced that at the time of maximum demand on such installation or portion of such  installation the current in any phase does not exceed the current in any other phase by more  than 20 A (unless otherwise approved in writing by the distributor). The principal tariff load (and  secondary tariff load where possible) shall be balanced across all supplied phases and the use  of controlled or time of use tariffs to balance another tariff across phases will not be accepted.  The distributor may apply additional conditions when large loads are connected in rural (non- urban) areas.   Switched Loads  The equipment may be restricted by the change in current that occurs when the equipment is  switched on and off or between operational settings. Where controlled equipment is to be  installed it is to be permanently connected to a controlled supply as per the requirements in  Section 7. All equipment designed to operate at 230V that is installed in electrical installations  of 100A or less shall be installed in accordance with Table 4.1:   Table 4.1  Note for Section 4.2:   1. When assessing domestic cooking equipment for compliance to 230V Uncontrolled  equipment limits or 230V Controlled equipment limits assessments may be completed in  accordance with AS/NZS3000 Appendix C2.5.3 for Domestic Cooking Appliances.  2. For the suitability of water heaters for controlled or night rate supplies reference should  be made to the Network Tariff Guide (available from the distributor’s web site) e.g. where  the heating unit rating exceeds 1800W, it shall not exceed 13.5W per litre of heat storage  volume for heat exchange type water heaters or 15.5W per litre of rated hot water  delivery for other storage type water heaters.  3. Electric vehicle supply equipment shall be compliant with AS/IEC 62196   Device Switching Arrangements Phase Limit (A)  230V  Uncontrolled  equipment      1 (line to neutral)  20  Phases not switched  simultaneously  2 or 3 (line to neutral) 20  Phases switched  simultaneously  3 (line to neutral)  40  230V Controlled  Equipment   1 (line to neutral)  35  Phases not switched  simultaneously  2 or 3 (line to neutral) 35  Phases switched  simultaneously  3 (line to neutral)  50  Commercial  Cooking  Equipment   1 (line to neutral)  35  Phases not switched  simultaneously  2 or 3 (line to neutral) 35  Phases switched  simultaneously  3 (line to neutral)  40  Queensland Electricity Connection Manual   Page 31 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Equipment Having Fluctuating Loads.  Examples of equipment having fluctuating loads are: Welding Machines, X -Ray equipment,  furnaces etc.  The distributor reserves the right to specify the conditions under which an electricity supply will  be given for equipment having rapidly fluctuating loads such as welding machines (other than  welding machines complying with AS 60974. 6, or previous standards superseded by this  standard, and marked \"Limited Input\"), X-ray equipment and furnaces.  No work should be carried out by a customer until advice has been received on the terms on  which supply will be given. (Refer to Section 2.10 \"Interference with Supply of Electricity to  Other Customers\").   Harmonic Interference or Wave Form Distortion  The distributor reserves the right to specify the conditions under which an electricity supply will  be given for equipment which would cause excessive distortion to the wave form of the supply  system voltage. (e.g. rectifiers, frequency converters, load control devices using thyristors or  saturable reactors).   Rectifiers  Alternating to direct current rectifying equipment shall not be connected to the distributor’s   system unless:  (a) the rectifier is of the full-wave type; or  (b) a double-wound transformer is interposed between the rectifier and the supply system; or  (c) the rectifier is us ed in conjunction with an electrical measuring instrument or in similar  applications where the rectified current does not exceed 100 mA.  Note: Further information regarding general limits may be obtained from AS/NZS 61000  series \"Electromagnetic Compatibility (EMC)\".  Additional limits apply to avoid harmonic interference to the distributor’s audio frequency load  control system.  (Refer to Section 2.9 of this manual).   Connection of Equipment - Voltage Limitations  All equipment must  be able to operate satisfactorily within the voltage limits detailed in the  applicable legislation or regulation.   Connection of Equipment - Isolated Generation Localities  Load restrictions on electric motors, welders, air conditioners and other electrical equipment in  excess of 2.4kW may apply in isolated remote generation areas throughout Ergon Energy. Call  General Customer Service ( contact details are listed at page 1) to clarify any restrictions  contained in the Ergon Energy  document PW000202R114 - \"Guidelines for Electrical  Installations at Isolated Systems\".   Limitations on Starting Currents of AC Motors   General Requirements  All requirements shall be calculated where the Motor rating in kW  is the continuous  rating of the largest motor in the installation. Except as required by Section 4.8.4 motor  installations and any associated starting devices shall be so designed and operated as  to comply with either of the following conditions:     Queensland Electricity Connection Manual   Page 32 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    Single-phase Motors 230 Volts and 400 Volts    TABLE 4.2  MOTOR VOLTAGE MOTOR SIZE ALLOWABLE STARTING CURRENT    230V      All Sizes    I = 45 Amps        400V      Not exceeding 7.5kW  I = (17.5 x Motor rating in kW) Amps     Exceeding 7.5kW      Shall not be connected.      Note: The distributor must be contacted before motors are installed in SWER areas of supply.   (Refer to page 1 for contact details).      Three-phase Motors 400 Volts    TABLE 4.3  MOTOR SIZE ALLOWABLE STARTING  CURRENT    Not exceeding 1.5kW      I = 26 Amps  Exceeding 1.5kW and up to",
  "3.75": "3.75kW    I = (Motor rating in kW x 17.5) Amps  Exceeding 3.75kW and up to 10kW       I = (53 + 3.3 x Motor rating in  kW)  Amps   Exceeding 10kW    Contact distributor.      Exception:   1. No limitation may be placed on the starting current of any motor that is not frequently  started and the rated output does not exceed 10% of the total motor load connected for a  customer to the one service.    2. In premises which are supplied directly from a substation or in other appropriate  supply conditions as determined by the distributor, starting currents in excess of those laid  down may be permitted provided that written approval is obtained from the distributor .   (Refer to page 1 for contact details).  Note: Motors should not be started simultaneously,  and the starting current of the  motors should be limited to 2 to 3 times full rated current by fitting with an appropriate  starter.      Queensland Electricity Connection Manual   Page 33 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Fall in Voltage   The starting current shall not cause a fall in Voltage of more than 5% of the nominal  voltage at the connection point for more than 0.02 seconds when connected to a typical  400/230V, 3-phase, 50Hz supply system which for this purpose shall be considered to  have the following impedance:    Z = 0.2 + j0.2 ohms (phase - neutral);   Z = 0.1 + j0.1 ohms (line impedance per phase).   Test Methods  (a) Fall in Voltage shall be measured by instrumentation with a high- speed  measurement capability.  (b) Starting currents shall be measured by instrumentation with a high- speed  measurement capability or by the locked rotor method, with the rated voltage and  frequency applied to the terminals of the motor.  (c) In any case where the test methods specified in paragraphs (a) and (b) above  cannot conveniently be applied, another test method that conforms to recognised  practices in the electrical industry may be used.  Note: The distributor will accept test results from a recognised testing laboratory or  manufacturer's certified test results.   Special Provisions  For both three- phase and single-phase motors the distributor may require maximum  starting currents lower than those set out or may limit the rating of any motor to be  connected if such lower starting currents or limits of motor capacity are necessary to  prevent interference with supply to other customers.  For isolated generation areas within the Ergon Energy  distribution area, special  limitations may be applied on starting currents of electric motors (including air  conditioners) and may require time delay controls on motor starting circuits after a  power outage.  Any special requirements are outlined in the Ergon Energy  document  PW000202R114 - \"Guidelines for Electrical Installations at Isolated Systems\" which is  available on request by contacting Ergon Energy Customer Service.  (Refer to page 1 for  contact details).       Queensland Electricity Connection Manual   Page 34 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK  Queensland Electricity Connection Manual   Page 35 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   SERVICE LINES AND CONNECTION POINT    General  Each individual electrical installation (as defined in AS/NZS 3000 (Wiring Rules)) shall have a  separate and individual connection to the supply network (i.e. separate connection point -  service line, point of attachment, consumer mains etc).   Note: The distributor will not accept any “Joint Use” arrangements where two or more  customers with separate freehold land lots requiring separate connections (e.g. small  lot subdivisions). The sharing of the same property pole and/or property line and/or  overhead service shall not be permitted.    Connection point   The distributor provides only one service line /connection point to a customer’s  premises.  Unless otherwise determined or approved by the distributor , the connection point  shall be  located as detailed in Sections 5.2.1 and 5.2.2.   Low Voltage  The connection point shall be located -  (a) at the termination of the overhead service line onto a building or structure where  the service line is installed without the use of property poles (i.e. typically the first  span of service line to the first structure); or   (b) on the first property pole (termination pole) from the point of origin of the service  line where supply is connected by means of a property line.  The property pole shall be located a maximum of  20m from the property  boundary.  Where the service line does not cross a property boundary the first  property pole shall not be located more than 20m from the origin of the service  line.   In the case where the service line crosses a road reserve and extends into private  property, the total length of the  service line from the distributor’s supply pole to  the first property pole shall not exceed 50m; or  Note: To comply with this requirement, the distance that the first property pole  is located within the property may need to be reduced so that the 50m  limit of the service line is not exceeded (in special situations the service  length may be increased at the discretion of the distributor).   (c) in a service pillar or pit at the customer’s property boundary in underground  residential distribution areas and non - CBD commercial and industrial areas; or  (d) at the termination of the  underground service line on the customer’s premises.   This arrangement is generally restricted to the CBD; or  (e) at the low voltage terminals of a distribution transformer installed at the  customer’s premises or at the load terminals of any switch or circuit protective  device that may be installed by the distributor  at such transformer.  (Refer to  Section 5.11 \"Substations on Customer's Premises\").   High Voltage  The connection point shall be as agreed  by the distributor and another Registered  Participant, Non-registered customer or Franchise Customer and documented in the  connection agreement.   Multiple Occupancy Connection Point  The distributor may consider a request to provide more than one connection point to a  property that satisfies the following conditions:  Queensland Electricity Connection Manual   Page 36 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (i) separate individual domestic dwellings where each portion has a separate  freehold title; and   (ii) the land associated with each of the domestic dwellings directly abuts a public  road reserve; and   (iii) the buildings are separated by an area as per AS/NZS 3000 MEN requirements;   Note: Refer also to Section 6.9.7 for Community Title Scheme Arrangements and Drawing",
  "6.6": "6.6 Metering Neutral Link (MNL)",
  "5.2.1": "5.2.1 POA maximum 20m from property boundary",
  "5.8.6": "5.8.6  POA requirements met",
  "5.12": "5.12).  (ii) 50mm² (Ergon Energy only) and 95mm² services shall have a load rating of",
  "3.5": "3.5kN working load and parallel (twin) 95mm 2 overhead service lines (refer    above condition) shall have a load rating of 7kN working load.  Safe working    loads shall be multiplied by 2.0 to convert to limit state principles.   For overhead service lines  requiring a 3.5kN design for the eye bolt, raiser  bracket or service pole, (ot her than hardwood timber which requires 5kN), the  customer must provide certification from a suitably qualified person (i.e. an  RPEQ) that the structure is suitable for the application.  (Refer to Drawing QECM",
  "5.15": "5.15).  (c) The method of attachment of an overhead service line to a structure shall be such  that mechanical load is transmitted to the frame of the structure.  Details of  approved attachment details for 1kN and 3.5kN service attachments are contained  in Drawings QECM 5.12; 5.13; 5.14 and 5.15.  (d) ‘J’ Hooks are not permitted on fascias or poles.  For 1kN services a minimum  M12 open eye screw or eye bolt is acceptable. For other services up to 3.5kN a  minimum M16 closed eye bolt is required  (e) Where any electric line or electrical article of a customer’s electrical installation is  to be supported by any structure, other than a wooden or steel pole conforming  to the requirements of AS/NZS 3000 (Wiring Rules), the customer must provide  certification from a suitably qualified person (i.e. an RPEQ ) that the s tructure is  suitable for the application.  (f) The maximum height of the point of attachment  of any overhead service line on  a customer’s premises shall not exceed 8m above ground or floor level and shall  have ready and safe access by ladder.  This maximum height may only be  exceeded in special situations where the distributor  has approved the  arrangement and given this approval in writing.  (g) Where raiser brackets or eyebolts are used, the design and installation is to make  provision for work to be carried  out safely.  (Refer to the applicable workplace  health and safety legal requirements).   (h) The point of attachment  must not be positioned such that the distributor’s  personnel need to climb on roofs or enter swimming pool areas. (Refer to Drawing  QECM 6.5).   Raiser Brackets  Proprietary raiser brackets (not exceeding 1.2m in height), certified by an RPEQ, tested  to a suitable SWL (e.g. 1kN or 3.5kN minimum rating for raiser brackets), and approved  by the relevant distributor are deemed suitable.    Queensland Electricity Connection Manual   Page 41 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (a) Within the Ergon Energy distribution area, the maximum size overhead service  line that will be erected to 1kN rated brackets is 3 phase 25mm2.  (Refer to  Clause 5.8.4(a) for 3.5kN bracket requirements).  (b) Refer to Drawing QECM 5.12 for examples of acceptable service raiser bracket  designs i.e. brackets that display an SWL and are fitted with a means of  attachment that will retain the service in high wind conditions (e.g. a pigtail or  closed loop).  (c) Where timber is used as an anchorage for 1kN raiser brackets and eye bolts it  is to be a minimum of 100mm X 75mm and securely fastened to or part of the  building structural frame.  (NB A bracket mounted on a fascia without suitable  bracing to the structural frame is not considered to be an effective method).  (d) Through (rafter) roof mounted service raiser brackets shall be positioned no  further than 0.5m back from the edge of the roof or guttering.  (e) All service raiser brackets shall be positioned so that any backstay attached to  the roof is in line with the direction of the service pull +/- 20 degrees.  (f) Where an approved side pull type service raiser bracket is installed, and the  angle of the service line from the point of attachment to the connection point  exceeds 60 degrees or is greater than that recommended by the manufacture, a  service raiser bracket designed for this application shall be installed. The height  of this bracket shall not exceed 1.2m.   Connection Point Overhead Service Lines  (a) The connection point shall be no more than 600mm from the point of attachment.  (b) The point of attachment  and the connection point  are to be positioned on the  building or structure where the distributor’s  personnel have unobstructed ready  and safe access  from the same common ladder position. That is, it must be  positioned where personnel do not climb on roofs, enter adjoining properties, or  carry ladders through structures, and or buildings for access.  (c) Clear level and safe access to the point of attachment shall be maintained by the  customer to allow the distributor to maintain the service.  A clear level area below  the point of attachment that allows a ladder ratio of 4:1 vertical to horizontal is  deemed suitable.  (d) The customer shall, at their expense, relocate the point of attachment  to an  acceptable position complying with the Section 5 when the existing point of  attachment is located in an unsuitable location where:  - Electrical work is performed at an existing installation resulting in a major  alteration as per section 6.4 or;  - Building works are carried out at premises  that results in the requirements   of section 5.8.6 (b) or (c) not being satisfied.   Connection Arrangements at Connection point  The following arrangements are required at a connection point:  (a) A suitable mains connection box, complete with house service connectors, shall  be provided by the customer  for the connection of overhead service lines  to  consumer mains.  (b) Suitable mains connection boxes shall be mounted to provide adequate support  by brackets or similar and not be reliant on rigid conduit for support.  (Refer to  Drawings QECM 5.13; 5.14 and 5.15).  Queensland Electricity Connection Manual   Page 42 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (c) If consumer mains are replaced or upgraded on an existing installation, a suitable  mains connection box  or an insulated enclosure shall be installed to the same  standard as for a new service.  (d) Where an overhead service line is to be connected to overhead consumer mains,  clamps suitable for this application shall be provided. This does not apply where  parallel overhead service lines or parallel consumer mains are installed.  (e) Where the conductors of either the service line or consumer mains are of a size  not suitable for a mains connection box, the method of connection shall be such  that the consumer mains are terminated with cable lugs within a UV resistant  insulated enclosure.  (Refer to Note 1 below and to Drawings QECM 5.13, 5.14  and 5.15). The customer (via their electrical contractor) is required to provide an  approved UV resistant insulated enclosure and crimp lugs complete with shroud,  12mm stainless steel bolts, nuts, washers and spring washers  fitted onto the  consumer mains.  Exception: The requirement for a suitable mains connection box or UV enclosure is  waived where the distributor’s service line is terminated onto aerial  overhead consumer mains.  TABLE 5.2 below gives the suitable sizes of UV resistant insulated enclosures:   TABLE 5.2      UV RESISTANT INSULATED ENCLOSURE  Service Type PVC Enclosure Size    Single 35 or 50mm² LV ABC  service    360mm X 270mm X 205mm*       Single & Parallel (Twin)  95mm² LV ABC service    540mm X 360mm X 220mm  * Certain manufacturers utilise a spacer to achieve 220mm depth.  Notes:  1. Suitable mains connection boxes are available for conductors up to 95mm2.  Where  double insulated sheathed cables are used for the consumer mains, the sheathing  must be removed in accordance with the manufacturer’s instructions before  termination into the IPC connector.    2. Refer to Section 6.7 for phase identification requirements.  3. It is recommended that these enclosures be mounted vertically with entry of  consumer mains positioned low, through the bottom of the enclosure.   Builder’s Temporary Supply (BTS)   For a Builder’s Temporary Supply (BTS), where a steel reusable pole is used, refer  to Drawings Q ECM 5.9, 5.10 and 5.11 for details of an approved design.  The  connection of the overhead service line can be facilitated with the use of a suitable  mains connection box suitable for conductors. All BTS must be metered.   The point of attachment is to be mounted within 600mm from the top of the pole  (however this distance can be increased to ensure the point of attachment is no  higher than 8m from the ground) and the connection point is to be as per Section",
  "5.9.3.1": "5.9.3.1 Supply or Service Pillar  There are also limits on the size of consumer mains to be connected to the service fuse  in service pillars. Single aluminium or copper cables no greater than 35mm2 PVC  insulated and PVC sheathed cables. To prevent damage to the distributors  service,  Queensland Electricity Connection Manual   Page 44 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  fuse the conduit shall not protrude past the pillar base and shall be positioned to the  rear of the fuse panel. The minimum length of the consumer mains shall be sufficient  to reach the top of the fuse panel +300mm.   FIGURE 5.1                                          Ergon Energy Distribution Area",
  "5.9.3.2": "5.9.3.2 Commercial and Industrial Pillar  There are also limits on the size of consumer mains to be connected to the CFS Unit in  C&I pillars. Single aluminium or copper cables no greater than 240mm 2 PVC insulated  and PVC sheathed cables. A lug with a maximum width of 38mm is able to be  connected to a CFS unit.    Consumer mains on the Distributor’s Poles  In general, consumer mains shall not be installed on the distributor’s  poles. However, the  distributor (in its absolute discretion) may approve such an arrangement in the circumstances  described in 5.10(a) and (b)  below. All such requests for approval are to be evaluated as  exceptional circumstances to which Section 1.4 applies.  Where existing consumer mains are installed on the distributor’s pole and works are being  completed that comply with major category of work as per Section 6.4.1 the customer shall be  connected by service line as per Section 5.2.1.  In Ergon Energy a 40mm Lead In (service) conduit is provided for the Electrical  Contractor to use for the installation of consumer mains. Each Lead In conduit exits  the pillar at a 45 degree angle, is installed 600mm deep and is identifiable with  Orange Caution Tape tied to the end of the conduit extending to ground level for ease  of location. A 25mm reducer is provided on each Lead In conduit.  The reducer can  be removed and replaced as necessary. Consumer mains shall only be installed via  the Lead In (service) conduits provided.  Alternative installation of mains to the pillar  without the use of the conduits supplied can result in the pillar being undermined and  de-stabilised and can result in damage to the supply cables.         Queensland Electricity Connection Manual   Page 45 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (a) Unmetered Installations  Unmetered installations are generally owned by a telecommunications company, public body (or  affiliated operator) or other companies (approved by a public body) and installed on public land.   (Refer to Section 2.6).  When the installation does not meet the requirements of an unmetered supply (e.g. council public  parks) it will be treated as a metered installation.   In no case shall the maximum demand of these installations exceed the rating of a standard  overhead service (i.e. 100A per phase).  This arrangement generally applies only to Rate 3  Public Lighting where a standard charge per light applies. The customer and distributor must  also enter into a connection agreement.   Where the above has been satisfied, approval may be granted for the public body (or affiliated  operator) or other companies (approved by a public body) to install the consumer mains on poles  designated by the distributor.  Note: Specific requirements apply (particular pole types are unsuitable).  The customer  must contact the distributor for details and prior approval. For information on the  minimum requirements for construction please refer to drawing QECM 5.16. For  more detailed construction drawings refer to the distributors’ Underground  Construction Manual.  (b) Metered Installations:   In all cases this arrangement is at the absolute discretion of the distributor and the following  criteria must be satisfied:  (i) The supply network is within the boundaries of the customer’s property; and  (ii) The installation actual demand is above 400A (i.e. in excess of a standar d overhead  service arrangement); or  (iii) The electrical installation is owned by a Public Body or other companies (approved by a  public body) and complies with the following -   • the installation is for the use of the general public; and    • the installation is installed on public land; and  • the public body or other companies (approved by a public body) is able to demonstrate  that there is a community benefit in not installing a property pole (e.g. supply to parkland  etc.); and  • the distributor’s network is within a reasonable distance from the connection point (i.e.  not more than 20m); and  • the network is on the same side of the road as the installation; and  • the installation maximum demand is not greater than 100A per phase.  Note: Special conditions apply for all the above and the distributor’s approval, as well as the  details of any conditions/requirements, must be obtained prior to the commencement  of any design or installation work.  The customer  shall meet all associated costs. For  information on the minimum requirements for construction please refer to Drawing  QECM 5.16. For more detailed construction drawings refer to the distributors’  Underground Construction Manual   Substations on Customer's Premises   Where the aggregate maximum demand exceeds or is reasonably estimated to exceed 100 kVA  as determined by AS/NZS 3000 (Wiring Rules), the distributor may require a customer to provide  (free of charge)  the space necessary for a substation in accordance with the Electricity  Regulation 2006 (Qld).  Queensland Electricity Connection Manual   Page 46 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Consumer Mains Connections to Transformer Terminals  Where consumer mains  originate at the terminals of a transformer, they shall be  adequately supported and shall be connected to the transformer terminals by flexible  braid connectors and adaptor plates.  The electrical contractor is responsible for the supply and installation of the low voltage  support stand/terminal cover, flexible braid connectors, adaptor plates and consumer  mains, plus any equipment required by the distributor’s Commercial and Industrial  Substation Manual.  (Refer to page 1 for details).   Consumer Mains Connection to LV Switchgear  Where consumer mains are to be connected at the LV terminals of the LV transformer  fuses or LV isolator in the LV compartment of a padmount transformer t he consumer  mains size shall be restricted to maintain clearances between phases when physically  connected. The standard striple fuse unit in a  padmount transformer permits a  maximum of 2*300mm2 aluminium or copper cables per phase. If you require a different  connection point  or consumer main s size, please seek advice from the distributor   before installing the consumer mains.   Multiple Transformers  Where multiple transformers supply a single switchboard, each transformer must be  connected to a separate bus section, however, a bus -tie switching arrangement is  permitted provided:  (a) The bus -tie switches are fitted with fail safe interlocking devices to prevent  paralleling of the supplies; and   (b) If the bus-tie switches are a type that cannot be operated under load, fitted with  a warning label to indicate the operating requirements; and  (c) Be installed and identified in accordance with AS/NZS 3000 (Wiring Rules).  In general, where the distributor agrees to provide more than one connection point  to  an installation, the customer must ensure that the supplies cannot be connected in  parallel. Electronically controlled interlocking systems may be allowed (at the discretion  of the distributor) upon approval of a functional design and operational specification  certified by an RPEQ in the application stage.    Buried Earthing Systems  Provision of a high voltage substation requires the installation of buried earthing  systems.  These earthing systems are generally installed within 5m of the substation,  however in some cases additional earthing cables may be required.  These additional  earthing cables would generally be located under the line and may extend some  distance away from the substation.  For safety reasons, it is important that building  foundations, customers’ low voltage earths or other metallic structures be located a  distance of at least 5m or more away from the high voltage earthing system.  The  distributor will provide advice on the location of the earthing system for specific  installations if required.    Joints in Consumer mains  Joints in un-metered consumer mains are permitted provided they comply with AS/NZS 3000  (Wiring Rules) and are not vulnerable to tampering by re-instating insulation to equivalent of   an unbroken cable.     Queensland Electricity Connection Manual   Page 47 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 48 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062          Queensland Electricity Connection Manual   Page 49 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062         Queensland Electricity Connection Manual   Page 50 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 51 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 52 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 53 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 54 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 55 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 56 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 57 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 58 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 59 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 60 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 61 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062        Queensland Electricity Connection Manual   Page 62 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK         Queensland Electricity Connection Manual   Page 63 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   METERING REQUIREMENTS   General  Metering installations are to comply with this document (QECM) and the requirements set out in  the QEMM. Only the appointed Metering Provider can work on or remove metering equipment  (refer to the responsibilities section).   Where a customer directs a retailer to request metering or tariff changes, any alterations to the  customer’s switchboard installation or meter enclosure shall be the customer’s  responsibility  (e.g. removal of asbestos contaminated waste) (Refer to Section 6.4).  Network devices deemed to be necessary to control electricity consumption shall be supplied  and maintained by the distributor and shall remain their property. All meter and network device  active terminals shall be connected directly to the Metering Isolation Link or Metering Active  Link for direct connected installations.  All phases of a service line are required to be connected at the initial connection of the  premises.All metering and control equipment shall be back-wired and mounted on a side hinged  panel attached to a metering enclosure or a switchboard frame.    All the Customer's ancillary equipment including (but limited to) surge diverters, voltmeters,  phase failure relays. shall be connected on the load side of the revenue metering equipment.  Customer owned current transformers for energy management are permitted on the line side of  revenue metering equipment at multiple tenancy installations.   Metering Determination  Calculated loads greater than 100 A per phase or measured loads greater than 80 A per phase  shall require current transformer metering. Contact the metering provider for further information  or refer to the QEMM.    Controlled loads  Where controlled loads  are required ( Controlled Supply/Night Rate tariffs), provision for a  separate network device shall be made (Refer to Drawing QECM 6.1 for cable access drilling  details). The network device will only be installed when the customer has requested controlled  load as part of the EWR for the installation.   Section 7 contains further detail on the requirements for connecting controlled loads.   Additions & Alterations Category of Works  Where work is performed on an existing  electrical installation, it shall be classified under the  following descriptions;   Major Electrical Additions & Alterations  Where major upgrades are carried out  to a customers’ installation the metering  installation shall comply with all requirements of the QECM. Major alteration works  being undertaken include (but are not limited to):  • where consumer mains are replaced;  • connection of additional phase/s;  • where the meter enclosure is replaced or relocated;  • where the meter panel is not housed in an enclosure;  • where the metering is changed from direct connected to current transformer or vice  versa;  • where an additional tenancy/metering point is added;  Note: refer also to Section 5.8.6(d) for requirements to relocate overhead service  point of attachment where major alterations are carried out.  Queensland Electricity Connection Manual   Page 64 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Minor Electrical Additions & Alterations   Where minor upgrades are carried out to a customer installation the meters may be left  in the existing location provided the metering location is suitable to the distributor  and  metering provider. Refer to Section 6.9.2 & 6. 9.9 for details on unsuitable locations.  Minor alteration works being untaken include (but are not limited to):  • Additional tariff requested e.g. Controlled supply tariff  • Customer requested meter change  • Load Centre changed  • The replacement of meter panel within an enclosure where the enclosure is not  being replaced  • Where point of attachment  is relocated for safety and no other works being  completed;   Addition of Small IES EG Connection  Where a customer installs a Small IES at their premises allowance shall be made for  the metering equipment to be mounted on a hinged panel that does not contai n  asbestos with metering isolation links and metering neutral links.    Refer to Section 6.5.2, 6.6.2 and 6.12 for requirement details.    Multiple Tenancy Alterations  Where building alterations are being carried out and fall into m ajor category of works  as per Section 6.4.1 then all tenancies must be upgraded to comply with the  requirements of the QECM and QEMM including the requirement for isolation of the  building and each customer.  Where a single tenant of a multiple tenancy connection requires works that fall under  minor category of works (Section 6.4.2) or the addition of Small IES (Section 6.4.3) and  is unable to gain support from the body corporate to upgrade metering they may:  Install a second meter board directly next to existing non -compliant meter panel.  Alternatively, if the existing meter board is hinged with no asbestos, then they will be  able to use the existing meter position however will be required to install metering active  and neutral links.    Building Renovations / Alterations   Where building alterations or similar works are carried out to premises which results in  the metering equipment no longer being in  a position that is suitable to the metering  provider (refer to Section 6.9.9 for unsuitable locations), the customer  shall, at their  expense, relocate the metering equipment to an acceptable position complying with  Section 6.   Other Repairs & Damage caused outside a person’s control (e.g.  Natural Disaster)  Compliance with Section 6 is required where the metering is located in an  unsuitable  location (refer to Section 6.9.9). In instances where the metering is not  located in an  unsuitable location, repairs may be carried out by “using methods that were acceptable  when that part of the electrical installation was originally installed”, provided those  methods satisfy the fundamental safety principles of Part 1 of AS/NZS 3000.   Metering Isolation  To faci litate the requirements of the Electrical Safety Act 2002 (Qld) and Electrical Safety  Regulation 2013(Qld) for performing electrical work, and the Electricity Act 1994 (Qld) and  Queensland Electricity Connection Manual   Page 65 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Electricity Regulation 2006 (Qld), supply to the revenue metering equipment for each customer  must be capable of being individually isolated.  All metering shall be connected with suitable active isolation devices connected to the line side  of the metering to allow safe access to the metering equipment. The requirement to install meter  isolator applies to all new installations including direct connected metering and current  transformer metering. Refer to Section 6.5.2.4 for existing installations requirements.   Metering Isolation Links/Circuit Breakers  Metering Isolation Links (MIL)/Circuit Breakers (CB) shall be installed in accordance with  the following:  (a) metering isolation links shall be clear cased type that comply with AS 60269,  sealable, back wired, fitted with a tubular link and installed on the line side of all direct  connected metering equipment; and  (b) all metering isolation links/CBs on a metering panel shall be connected in the same  line - load sequence; and  (c) the metering isolation links shall be mounted horizontally or vertically on the front of  the metering panel and if not obvious, clearly labelled to indicate the meter and portion  of the installation that they control. Clearance around the ends of metering isolation  links shall be 40mm; and   (d) the load through a MIL/CB shall not exceed 125A. In multiple supply applications (e.g.  general and controlled supplies ), where the load exceeds 125A, additional metering  isolation links/CBs shall be required. Where a fuse is used to replace the solid link (Refer  to Section 6.5.2.3) the maximum load through the metering isolation link shall not exceed  the rating of the fuse; and  (e) on multiple installations MIL/CB shall be provided for each network device  and  installed on or adjacent to the relevant meter/metering equipment; and  (f) for customers with three-phase supply the MIL/CB are to be grouped together and if  not obvious, permanent labelling must be applied to the meter panel to show the  meter(s) and installation that they control.  Aluminium cables are not suitable for connection directly into Meter ing Isolation Link  terminals unless fitted with a suitable means of termination, such as a soft -form bi- metallic sleeve or ferrule that is compatible with the Meter ing Isolation Link terminal  metal.  Where cables of these types are used as consumer mains, they shall comply with the  requirements of the electrical component/cable manufacturers and AS/NZS 3000 (Wiring  Rules), particularly in respect of termination and bending.   Isolation of Direct Connected Metering",
  "6.5.2.1": "6.5.2.1 must be provided to allow isolation of the meter without interrupting supply to  other customers.  Where customer works are major alterations as per Section 6.4.1 a  means of isolation in accordance with Section 6.5.2.2 shall be provided.   Exception:    On existing single-phase multi-tenancy installations utilising plug- in meters, the  need to fit isolation link/s is not required in situations where a replacement plug-in  meter is to be used. These include a single -phase tenancy with a Small IES or a  tenancy with Time of Use metering (TOU)  Notes for Clause 6.5.2.3:  1. Where the distributor’s service fuse is greater than 80A, fault current limiting  devices (supplied and installed by the customer) complying with AS/NZS 3000  Metering isolation circuit breaker  Contact an Electrical Contractor if in off position.  Queensland Electricity Connection Manual   Page 67 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (Wiring Rules), are required to protect any direct connected meters.  Fault current  limiting devices shall be installed as per AS/NZS3000.  (Refer to Drawings QECM",
  "6.5.2.2": "6.5.2.2 Multiple Installations  A lockable load- break isolator (with facility for locking off) that is capable of isolating  supply to the entire electrical installation shall be installed for all multiple customer   installations including multiple customers fed from remote metering points . Where a  circuit breaker main switch is installed for overload protection of the consumer mains in  accordance with AS/NZS 3000 (Wiring Rules), it shall be lockable, connected on the  line side of the metering and can be used in place of the building isolat or (Refer to  Drawings QECM 6.2 and QECM 6.3).    Metering isolation links are required for individual customers.  (Refer to Section 6.5.1).",
  "6.5.2.3": "6.5.2.3 Existing Installations  All meters at the one-meter location must follow the same sequence (i.e. be either all  “before” or all “after” the main switch/s or any lockable isolator).  Where direct connected meters are installed to facilitate a customer requested  supply/tariff change, additional tariffs (e.g. controlled supply tariff) or installation of a  Small IES on an existing single customer  installation, they shall be connected on the  line side of the individual installation's switchgear and provision for MIL is required in  accordance with Section 6.5.2.1  On existing multi -tenancy installations where the individual tenancy main switch is  connected on the line side of the meters, a new meter shall be connected on the line side  of the individual tenancy main switch.  A means of isolation in accordance with Section",
  "6.3": "6.3 and QECM 6.4).  2. Standard practice in multiple tenancy direct connected metering installations, where  the service fuse protection is greater than 80A, is to install an 80A fuse in the  metering isolation link in place of the solid link.  Where fuses are installed, the  metering provider will provide the fuse and place a label on the panel adjacent to the  metering isolation links stating: “WARNING - The metering isolation links have been  fused for protection of metering provider Equipment”.  3. Where the metering provider determines that the meter requires an 80A fuse for  adequate overload/fault protection, metering providers can install an 80A fuse in the  metering isolation link provided the Maximum Demand of the installation does not  exceed 80A. Should a 100A supply be required, the metering provider shall ensure  the meter used is suitably rated for, and protected by, the 80A service fuse. All other  requirements of Notes 1 and 2 above remain applicable.   Isolation of Current Transformer Metering  Current Transformer metering shall be capable of being individually isolated by a  suitable isolator or main switch. All isolation equipment shall be clearly identified and  readily accessible and shall be installed and maintained by the customer.  Where direct connected metering  is installed at the same switchboard as current  transformer metering, the direct connected metering is to comply with Section 6.5.2.",
  "6.5.3.1": "6.5.3.1 Specific Single Customer Current Transformer Metered Installations  Specific single customer current transformer metered installations include installations  where:  (i) Supply to the installation is interrupted for extended continuous periods of time  (>2 days) e.g. irrigation pumps, flood lifters, grain silos etc. (i.e. where the main  switch is used to control the installation and leave the electronic meter without  supply so that it cannot be read); or  (ii) “Safety Services” are installed and require supply to be maintained.   Note: AS/NZS 3000 (Wiring Rules) permits lockable isolators for installations  supplying “Safety Services”.   In these specific single customer current transformer metered installations, the  customer shall install a lockable load- break isolator (with facility for locking on  and off) on the line side of the current transformer metering  chamber with the  main switch(s) installed on the load side.  In these specific installations, the  isolator may be locked in the on position.  (Refer to Drawing QECM 6.4).  Where the metering current transformers are installed remote from the main  switchboard, the isolator shall be marked “Metering Isolator”.",
  "6.5.3.2": "6.5.3.2 Other Single Customer Current Transformer Metered Installations  This includes all other single customer  current transformer metered  installations  where supply to the meter will not be interrupted for extended continuous periods of  time.    The preferred arrangement is to connect all single customer  current transformer  metered installations as per (a) above, however, in the interests of reducing costs to  the customer, a main switch used as the lockable isolator installed on the line side of  the current transformer metering is permitted provided isolation of customer outgoing  circuits is still provided on the same switchboard as the CTs. The main switch shall  be capable of being locked in the off position.  (Refer to Drawing QECM 6.4).  Queensland Electricity Connection Manual   Page 68 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062",
  "6.5.3.3": "6.5.3.3 Multiple Customer Current Transformer Metered Installations  (i) Isolation of entire installation (Building Isolator).  A lockable load-break isolator (with facility for locking off) that is capable of  isolating supply to the entire electrical installation is required.  Note: A charge will be made where the distributor  is required to isolate  supply.  (ii) Isolation of individual customers.  A lockable load-break isolator (with facility for locking off) shall be installed on  the line side of each set of revenue metering current transformers with the  customer’s main switch(s) installed on the load side located on the same  switchboard as the CTs.  (Refer to Drawings QECM 6.3 and 6.4).   Metering Active and Metering Neutral Requirements   Metering Active Links  Where common consumer mains are installed for the purpose of supplying more than  one customer, metering active links shall be used.   Metering active links may be  required to facilitate the ease of connecting large cables to metering isolation links in  multi-tenancy installations or when there are more than two meters connected to single- phase.    Metering Neutral Links  The metering neutral shall be connected to a dedicated terminal of a metering neutral  link (MNL). All meter and network device neutral terminals shall be connected to a  dedicated terminal of the metering neutral link via a separate neutral conductor.  Soldered meter and network device neutral connections are not permitted.   Construction  Metering active and metering neutral links shall -  (a) incorporate a separate connecting device for the incoming and each outgoing  circuit; and  (b) consist of tunnel terminals  for termination of the conductors  using one of the  following methods (i); (ii) or (iii) for termination of the conductors.  i. Two screws shall be provided for each terminal; or  ii. One screw, the outside diameter of which is not less than 80% of the tunnel  diameter; or  iii. One screw, which is arranged so that the conductor is clamped by suitable  ferrules or plates in direct contact with the conductor.  (c) must be sealable or where this facility does not exist (for larger sized consumer  mains), the links must be installed within a suitable dedicated enclosure fitted with  a sealable cover.   Connection of Metering Neutral Conductors to Main Neutral  The neutral conductor of the consumer mains is not to be joined or looped through the  terminals of a revenue meter or metering neutral link. Metering neutral conductors shall  not be looped between metering equipment and when alterations or additions are  required on existing installations with neutral looping, the looping must be removed and  metering neutral link installed.   The metering neutral shall be connected to the main neutral in such a manner that it  cannot be disconnected or removed, for instance:  Queensland Electricity Connection Manual   Page 69 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (a) soldered or crimped to the main neutral;  (b) a flag lug under the main neutral connection. Slotted lugs shall not be used;  (c) a sealable terminal or bolt on the neutral link/bar where -  (i) the consumer mains are a busway or busbar arrangement;  (ii) the installation main switchboard is supplied by more than one connection  point and a bus-tie arrangement is in place (the consumer mains neutrals shall  be connected to a common neutral link/bar);  (d) where the main neutral conductor is 25 mm2 or larger a sealable terminal may be  used;   (e) under a stud fitted with a suitable nut that is drilled and tapped into the consumer  mains neutral lug, provided the arrangement can be sealed.  Note: In domestic installations where parallel consumer mains are used the metering  neutral conductor shall be soldered to one conductor only.     Accessibility of Neutral Connections  The metering neutral connection is to be readily accessible and shall not be located  behind a panel where access requires isolation of supply.   On heavy current switchboards (refer to AS/NZS 3000 (Wiring Rules)) the main neutral  and MEN connections to the busbar shall be located in an accessible position with a  minimum of 600mm clearance from exposed live parts.  If a minimum clearance of  600mm cannot be achieved, the use of a permanent barrier or location within a chamber  separate from that of the main switch or other exposed live parts is acceptable.    The arrangement must allow the main neutral  and MEN connections to be safely  accessed without isolating the supply to the switchboard or moving other cables.  (refer  to AS/NZS 3000 (Wiring Rules)).  The use of shrouds over cable connections is not a sufficient barrier as the shrouds need  to be removed during polarity testing (unless access to conductors is provided via test  probe holes without the need to remove the shrouds).   Metering Active and Metering Neutral Link Mounting  Metering active and metering neutral links shall be mounted on the rear of the meter  panel or meter enclosure. Where metering active and neutral links are mounted on the  rear of the meter panel, they shall be mounted in such a way that they do not interfere  with the mounting of the metering equipment.  To not interfere with metering equipment (normally mounted on the upper or middle  section of the meter panel) it is preferable for the metering active and neutral links to be  mounted as close as practical to the bottom of the meter panel.  Where metering active and neutral links are mounted on the rear of the meter enclosure  and the material on which they are mounted is conductive, they shall be mounted on  insulating material with low water absorption properties that will extend past the live parts  of the link by a minimum of 25mm in all directions. This mounting arrangement is not  required where the link has been specifically designed and type tested for installation  onto metal surfaces.  Access to metering links must not be obstructed by any structure or wiring within the  switchboard.   Metering Active and Neutral Link Labelling  A permanent label is required on the front of the meter panel to indicate the location of  the metering active and metering neutral links.  Queensland Electricity Connection Manual   Page 70 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Metering active and neutral links shall be identified as such and marked to identify  which meter is fed from each outgoing circuit of the metering link. Labelling must be  legible and durable in accordance with AS/NZS 3000 (Wiring Rules).   Conductor Identification  To assist in identification of conductors and correct phase sequence of polyphase  meters, the individual conductors of consumer mains shall be clearly identified at both  ends (including up to each set  of Meter Isolation Links) by colour coding of the  conductor insulation (e.g. red, white and dark blue to identify active conductors). This  identification may be achieved by installation of 150mm minimum of colour coded  sleeving installed at the conductor terminations  (e.g. at the service pillar, mains  connection box, transformer terminals, switchboard/metering panel MIL etc). Insulation  tape is not an acceptable means of identification.   Metering and Control Equipment - Accommodation  The customer shall provide and maintain at their expense, suitable space, housing,  mounting and connecting facilities to accommodate meters and control equipment for  each supply arrangement (e.g. general and controlled supplies).  Unless otherwise specified and agreed with the distributor,  the minimum space  requirements for high voltage metering panels shall be as specified in Section 9.   Metering and Control Equipment - Position   General  Meters and control equipment shall be positioned so that they are not subjected to  mechanical damage, vibration, high temperature or other environmental situations that  might affect their correct operation (e.g. exposure to direct sunlight).  Where security of  a meter enclosure is necessary, a metering lock must be purchased to allow access.   (refer to Section 6.14).  The customer shall provide safe and ready access so that meters and control  equipment may be fixed, read, tested, adjusted and removed without difficulty at any  reasonable time but generally between the hours of 8.00am to 5.00pm Monday  to  Friday. The minimum access requirements for a meter enclosure shall be as per the  requirements for switchboards as detailed in AS/NZS 3000 (Wiring Rules).  Unless otherwise approved by the distributor, or as varied by Section 6.9.4, all meters  and control equipment supplied for any one installation ( as defined in the National  Electricity Rules) shall be located in one readily accessible position, preferably on an  outside wall at the front of the building.   Current transformer meters should be installed  towards the front of the building on a  readily accessible outside wall.  Direct connected meters shall be positioned in  the same location as the Main switch  and MEN point to allow required testing to be undertaken by the distributor.  Note: Where a property or building is of a type that may be subdivided, the meters  and wiring should be located in an area that would be set aside as common property  or within each individual lot.   Residential Properties  On single or multiple residential premises a meter position suitable to the distributor  shall satisfy the following criteria:  (a) unless otherwise approved in writing by the distributor, meters shall be erected on  the side of the premises  facing a street from which there is pedestrian access or  within the first 2 m along an adjacent side of the premises.  (refer to Drawing QECM",
  "6.5": "6.5 Metering Isolation Link (MIL)",
  "6.9.7.1": "6.9.7.1 General  Customers’ equipment, including devices that consume or measure electricity, must  not be connected to any unmetered conductor. Details of the proposed meter positions,  unmetered submains and their circuit protective devices shall be submitted to the  distributor for approv al before their installation.  Where unmetered sub-mains are  intended to supply any additional meter position, then a lockable circuit breaker shall  be provided at the origin of the unmetered sub-mains.   Queensland Electricity Connection Manual   Page 72 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Exception: Approval is not required where the unmete red submains comply with  Clauses 6.9.4 to 6.9.5.  Voltage drop on unmetered submains shall not exceed 2.5% of the supply voltage  (voltage drop calculations must be included with the submission). (Refer to page 1 for  contact details).",
  "6.9.7.2": "6.9.7.2 Meter Positions – Multiple Metering Points  Installations with multiple metering points as detailed in Clauses 6.9.4 and 6.9.5 are to  have community metering (where required) located on the main switchboard.  Where there is a risk of incorrect identification of the occupancies supply arrangement,  including segregation between the electrical installations, occupancies unmetered  wiring and switchboard location and metering, supply arrangement diagrams shall be  installed and maintained.    Community (Strata) Title Developments  For reticulation in community title that is not owned by the distributor , in general the  distributor will provide one connection point  to the installation.  Unless otherwise  approved by the distributor, all community metering shall be located at one position.   Where additional Community Metering points are approved, each shall be treated as a  separate NMI (Refer to Drawing QECM 6.6).  Where a cluster or community title scheme development consists of a number of multi- tenanted buildings, additional meter position/s located on common property may be  permitted.  The following meter positions will also be acceptable:  (a) Overhead Reticulation  (i) The main switchboard located on common property  and all metering  equipment installed at this position.  (ii) The main switchboard and the first metering point located on common property  and subsequent metering points located on common property or as otherwise  approved by the metering provider.   (b) Underground Reticulation  (i) Arrangements described in either Section 6.9.7(a)(i) or (ii) above  (ii) The individual consumer mains  (for each unit) installed on common  property and connected to the distributor’s reticulation with the metering  equipment located at the unit.   Note: Where more than 3 sets of consumer mains are to be connected to  a distributor’s pillar, approval must be obtained from the distributor  (iii) Where multiple premises (unit cluster)  are constructed under Building  Format Plan, a 3-phase supply from distributors reticulation to supply one  metering point shall be installed on common property  Note: A general arrangement is for twelve customers or units per metering point or  as otherwise approved by the distributor.  The Energex Subdivision Standards - Developer Design & Construct Estates Manual   provides further information regarding Community Title and Cluster Developments in  the Energex distribution area. It is available for download on the Energex website.   Unsuitable Locations  The following locations are unsuitable for the installation of all metering equipment:  Queensland Electricity Connection Manual   Page 73 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (a) Within or at any height above any pool zone as defined in AS/NZS 3000 (Wiring  Rules).    (b)  Locations where the only point of access is through the fenced area around the  pool.  (c) Within any hazardous area defined in AS/NZS 3000 (Wiring Rules) or within a  gas emitting device (gas meter regulator) exclusion zone defined by AS 5601- 2004 (Australian Gas Code) and AS 4645.1.  In particular, electrical contractors   should be aware of the hazardous areas associated with exchange or in- situ fill  LPG gas  cylinders.  (Refer to AS/NZS 3000 (Wiring Rules) and AS/NZS",
  "2430.3.4": "2430.3.4).  (d) Over stairways or ramps, in narrow passageways, toilets or fire isolated stairways.  (e) In vehicle docks, driveways, factory walkways etc. where the equipment, or a  person working on the equipment would not be adequately protected.  (f) In close proximity to machinery.  (g) Locations where exposure to fumes, dust or dampness may result in unsatisfactory  working conditions.  (h) In positions where the ambient temperature exceeds 50 0 C (e.g. boiler rooms).  (i) In areas with insufficient light.  (j) In confined spaces.  (k) In areas where the integrity of a security system will be affected by entry of the  metering provider’s personnel, (refer to Section 6.14), or where access is normally  restricted for health or other reasons.  (l) In multiple installations, the meter position is not to be situated within any lockable  portion of an individual tenancy (i.e. shall only be located in a common area).  (m) Within enclosed carports or verandahs.  (n) In areas enclosing dogs.    Note: Area enclosing dogs defined by secondary fence not the road reserve  perimeter fence. Where only road reserve perimeter fence installed options for the  customer include installation of  secondary fence separating dogs from meter  position or providing restraint point.  (o) Behind a property perimeter fence without an adjacent gate.  (Refer to Clause 6.9.2  for meter positions on domestic properties).  (p) In areas subject to varying high intensity magnetic fields. ( Refer to QEMM for  current transformer meter panels in the vicinity of heavy current carrying  conductors).  (q) On the distributor’s works.  (For exception details refer to Section 5.10).  (r) Secured private areas.  (s) Where the noise level exceeds the LAeq.8h level of 85dB(A) as per the Qld Health  and Safety Regulation and the Standard AS/NZS 1269.1 Occupational noise  management - Measurement and assessment of noise immission and exposure.  (t) In areas where the distributor’s staff require inductions to access the site  (permanent sites only, building sites/builders temporary supplies are exempt from  this item). This item is a recommendation only and may not be possible in all  instances.  (u) Where access may require any additional provisions e.g. EWP or scissor lift to  perform a rescue of an injured worker.  Queensland Electricity Connection Manual   Page 74 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     Queensland Electricity Connection Manual   Page 75 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     Metering and Control Equipment - Housing                         Mechanical Protection   Where meters and control equipment are erected in a position exposed to the effects  of the weather, direct sunlight, corrosive atmosphere and the like they shall be enclosed  in a sui table meter enclosure.   Meter reading windows in meter enclosures are not  permitted.  Meters, control equipment and their enclosures shall be protected from mechanical  damage, by either their location or the manner of mounting.  Note: Where a meter enclosure is installed on a temporary structure, the supporting  structure shall be mechanically sound.  Where the temporary structure is used for building  purposes it shall comply with the requirements of AS/NZS 3012 (Electrical Installations- Construction and Demolition Sites) (e.g. includes the connection of permanent supply for  domestic building purposes in a URD estate).   Enclosure Mounting  Where meters and control equipment are accessible only from the outside of a building,  they shall be enclosed in a s uitable meter enclosure mounted on or recessed into the  outside wall of the building.  Meter enclosures shall not be installed where they protrude  or open across a property boundary.    Exception: Meter enclosures mounted on the front boundary may open towards  the footpath.  It is recommended that meter enclosures mounted in these positions be  locked.  (Refer to Section 6.14 for metering lock details).   Pole Mounted Enclosure  Where a meter enclosure used to house revenue metering equipment is erected on a  pole, it shall be constructed of an approved material (not timber), be adequately fixed  in position and where necessary, suitably treated against corrosion.   Earthing  All metallic meter enclosures shall be earthed. Where double insulation is maintained  throughout the meter enclosure (in accordance with the requirements of AS/NZS 3000  (Wiring Rules)), earthing is not required.    Metering and Control Equipment – Spacing Requirements  Item A.3 of the \"Specification for Metallic Enclosures for Meter s in Direct Connected  Installations\" in Appendix A, specifies minimum space requirements for metering equipment  on direct connected installations.   QEMM minimum space requirements for meter panels for low voltage current transformer  metering.  ASBESTOS WARNING  Older type switchboard and meter panels may contain asbestos.  Electrical workers  who are required to work on these panels need to identify if this hazard is present  and, if necessary, take appropriate action.  Old Zelemite (black) electrical  switchboards can contain up to 20% asbestos.  When working on an electrical  switchboard that is aged (pre 1987), assume the presence of asbestos , even if it is  not marked as such.  Asbestos information including codes of practice and legislative requirements is  available on the Workplace Health and Safety Queensland web site   www.asbestos.qld.gov.au under the heading “laws and prosecutions”.  Queensland Electricity Connection Manual   Page 76 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Minimum space requirements for mounting of meters and control equipment are shown in  TABLE 6.1.  TABLE 6.1   Meter and Network Device  Details  Height  (mm)  Width  (mm)  Depth  (mm)  Approx. Weight  (kg)  Network device 190 110 110 0.5  Metering Isolation Link 90 45      A minimum clearance of 25mm is required between any item of metering or control equipment.  The minimum clearance around the ends of metering isolation links shall be 40mm minimum.  All metering enclosures shall include provision for Installation of an Antenna/Aerial.  Exception:  Metering isolation links associated with each NMI can be mounted side by   side with no clearance between provided the minimum clearance around the   ends of metering isolation links is 40mm minimum.   Metering and Control Equipment - Mounting   Mounting Arrangement  All meters, network devices and metering isolation links must be mounted on a side  hinged panel so that the metering and control equipment always remains in the vertical  plane. Meters and network devices must be mounted vertically with cable connections  at the bottom.   Panel Fixings  (a) Meter panels shall be constructed of a durable, non-conducting, fire resistant  material with low water absorption properties and shall not contain asbestos.  Alterations requiring a replacement meter panel shall comply with the above.  Existing meter panels in good condition that do not contain asbestos do not  require replacement however insulated fire-retardant backing boards with low  water absorption properties and not containing asbestos must be installed behind  all new and retrofitted electronic equipment associated with the customers  metering and control equipment on existing panels that are not constructed of fire  resistant material.  (b) Bolts/screws used to mount and fix equipment on insulated meter panels shall be  fit for purpose. Where mounting bolts/screws protrude through the meter panel  and can be contacted, a non-conducting bolt/screw (e.g. nylon or plastic) shall be  used.   Note: Metal screws with needle points and self-drilling tips are not permitted. The  insulating of metal screws using silicone or other material is not permitted.  (c) The panel within the meter enclosure should be not more than 300 mm from the  front of the meter enclosure.  (d) The meter panel is dedicated for revenue metering equipment and network  devices. Customer owned equipment (including GPOs, Contactors etc) shall not  be installed on the meter panel (this excludes metering isolation links/CBs as this  equipment is part of the revenue metering). Customer owned metering neutral  and active links should also be mounted on the rear of the meter panel or meter  enclosure and shall not be mounted on the front of the meter panel (refer to  Section 6.6.6).    Note: Where a larger panel is used, it is permissible for customer owned equipment to be  installed on the same panel outside of an area dedicated for use for metering  equipment provided the meter panel area meets the minimum size specified in  Queensland Electricity Connection Manual   Page 77 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  Appendix A, is indelibly marked with a demarcation line and is labelled to indicate  the meter panel section is dedicated for metering equipment      Meter panels on temporary builder’s supplies do not need to be dedicated to revenue  metering equipment  unless they are intended to be installed in the permanent  position.   Metering and Control Equipment – Mounting Height  The top of any metering equipment shall have a maximum height of 2000mm above floor or  ground level.  The bottom of the meter, network device or item of metering equipment shall not  be less than 900 mm above floor or ground level when not installed in an enclosure or  dedicated switch room or meter room.   This height may be reduced to 700mm (500mm for  metering isolation links) above floor or ground level when installed within an enclosure or  dedicated switch room or meter room.  For clearances in front of the metering enclosure doors refer to AS/NZS 3000 (Wiring Rules)  (i.e. minimum clearances of 600mm).    Use of Platforms  Where the customer is required to provide a platform to access a meter installation, it shall be  designed to AS 1657 (Fixed Platforms, Walkways, Stairways and Ladders) , be certified by a  RPEQ that the structure is suitable for the application and be designed to support a minimum  load of 200kg.  A certificate of approval shall be submitted to the distributor prior to connection  of supply.    Where meters and switchboards are installed on service poles, the platform shall be self - supporting and permanently mounted.    The service pole shall not be used to support any platform structure, and any step-type ladder  access shall be clear of any fences or sharp objects that may be considered a fall hazard.   For clearances in front of the metering enclosure doors refer to AS/NZS 3000 (Wi ring Rules)  (i.e. minimum clearances of 600mm).   For existing installations where access is considered unsafe, the metering provider may refuse  to read the meters until the unsafe condition has been rectified by the customer or may repair  the access at the customer’s cost.  (Electricity Regulation 2006(Qld)).    Metering Locks  Where the distributor agrees to meters being erected in an enclosure within an area which may  be locked for security reasons, or where meters may be subject to vandalism, the distributor’s  metering lock must be purchased and installed to permit access.  (R efer to page 1 for  purchasing details and Drawing QECM 6.7 for lock types). The installation of “Private Locks” is  not permitted for providing access to metering equipment.   Where the distributor’s metering lock is installed, all tenants who require access to the meter  panel shall be provided with such access.    Note: If the distributor’s personnel are requested to open the metering lock for tenant access,  the customer will be charged a call out fee.   Metering locks shall not be used on a garage door, verandah door or similar doors that provide  access to private areas. (Refer to Section 6.9.9 and Drawing QECM 6.7).  The distributor may provide master metering lock keys to metering providers when requested  in accordance with their procedures. Metering providers  will keep master keys secure and  return them to the distributor when no longer required or when requested by the distributor.   Current Transformer Metering – Housing  (a) Each set of current transformers and meter voltage fuses are required to be  mounted in a separate dedicated metering chamber. This chamber is to enclose  only the metering provider’s equipment.   Queensland Electricity Connection Manual   Page 78 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (b) To allow commissioning and testing of current transformer metering installations to  be performed safely, all live low voltage parts within current transformer chambers  are to be individually insulated (insulation must completely cover all live parts).  Heat shrink insulation is acceptable for insulating busbars.  All bolted busbar or  cable connections are to be covered with non-adhesive insulation secured in place  by cable ties.  A non- conductive insulated barrier alone (removable cover over CT chamber) is not an  acceptable method of insulation.     Current Transformer Metering Installations  The distributor requires all LV current transformer metering installation designs to have prior  approval for the metering arrangement. Please submit form LV CT Advice Form available from  the distributor’s website, see page 1 for details. This form requires the submission of  Switchboard Layout and Single Line Diagra ms as early as possible to allow design  modifications to be carried out if necessary, prior to switchboards being built.    If this information is not provided the distributor  cannot guarantee supply will be connected if  the switchboard does not comply.    Early submission of drawings will assist in reducing the time and costs for all parties and avoid  late modifications of current transformer metering switchboards.    Queensland Electricity Connection Manual   Page 79 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   LV Direct Current Metering Guide  Electrical Contractor’s LV Direct Current Metering Check Sheet    Address Where DT Metering Installed:     National Metering Identifier (NMI) (If known):      Details of Electrical Mechanic Responsible for Testing of DC Installation:    Name: Licence No:    Clause  No.    Checklist    Checked    Comments   General Requirements",
  "3.1": "3.1 Supply Agreement – new installation or load change",
  "3.3": "3.3 Number of phases to be installed     Overhead Connection",
  "5.8": "5.8 Service Line does not cross neighbouring property  boundary",
  "5.5": "5.5 (c) POA or service line over or within pool zone",
  "5.8.4": "5.8.4-",
  "5.8.2": "5.8.2 Property pole connection RPEQ     Underground Connection",
  "5.9": "5.9 Confirm availability of supply",
  "5.9.3": "5.9.3 Pillar Connection",
  "5.11.2": "5.11.2 LV Striple in padmount connection     Meter Connection Requirements",
  "6.1": "6.1 No customer equipment before the metering",
  "6.2": "6.2 Metering Determination",
  "6.4": "6.4 Addition & Alternation Category of Works",
  "6.7": "6.7 Conductor Identification",
  "6.9.1": "6.9.1 Main Switch and MEN at meter position",
  "6.9.2": "6.9.2-",
  "6.9.9": "6.9.9  Meter Panel Location",
  "6.11": "6.11 Spacing Requirements",
  "6.12": "6.12 No exposed live parts within CT chamber:    QEMM Primary and secondary polarity is correct:    QEMM Removable bus bars allow CTs to be easily replaced:    QEMM CT secondary terminals are accessible:     Voltage Circuit Fuses    QEMM Fuses carriers are accessible and easily removable:    QEMM Fuses are connected to the line side of the CTs:    QEMM Cables from bus bars to fuses are ≤ 500mm and a  minimum. of 10mm2 SDI:     QEMM Correct marking of cables from bus bars to fuses (e.g.  trace or bell out cables):      Meter Neutral & Earthing    AS/NZS  3000  Test continuity to confirm that cabinets are earthed:    QEMM Meter neutral is connected to main neutral and meter  neutral label is attached:      Meter Panel Wiring & Test Block    Section  6  QECM  Meter panel located in suitable location    QEMM Meter panel size is minimum 600 x 600mm (or 460 x  600mm for single tariff CT installation):     QEMM Meters are mounted at correct height:    QEMM Meter panel is hinged:    QEMM Meters and wiring spaced from heavy current carrying  conductors:     QEMM Test block is mounted correctly:    QEMM Colour coding is correct:    QEMM Meter wiring is correct size for circuit length:    QEMM Secondary returns are starred and earthed:     Sealing    QEMM CT chamber, voltage circuit fuses and meter panel are  sealable:     Queensland Electricity Connection Manual   Page 81 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     Queensland Electricity Connection Manual   Page 82 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     Queensland Electricity Connection Manual   Page 83 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 84 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 85 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 86 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 87 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 88 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 89 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062        Queensland Electricity Connection Manual   Page 90 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK         Queensland Electricity Connection Manual   Page 91 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   CONTROLLED SUPPLIES - METHOD OF CONTROL   General  Network devices deemed to be necessary to control electricity consumption shall be supplied  and maintained by the distributor and shall remain their property. All meter and network device  terminals shall be connected directly to the Metering Isolation Link or Metering Active Link for  direct connected installations.   Where controlled loads are required, provision for a separate  network device shall be made.  Refer to drawing QECM 6.1 for cable access drilling details . The network device will only be  installed when the customer has requested controlled load  as part of the EWR for the  installation.   Two and three switch network devices will be utilised for the following situations:  (a) For single installations where a combination of water heating and other controlled loads are  connected. (Refer to Drawings QECM 7.1, 7.3, 7.5, 7.6 and 7.7).  (b) For multiple installations, such as flats and home units. (Refer to Drawing QECM 7.4)  The electrical contractor shall install all network device wiring.  The electrical contractor shall install all meter wiring unless an agreement has been negotiated  with the metering provider.  Equipment connected to a controlled supply is to be permanently connected however  specific equipment may be connected via a socket outlet at the distributor’s discretion.  Where a socket outlet is provided for this purpose, it shall be dedicated to the controlled  supply equipment (spare controlled supply outlets are not permitted). A permanent indelible  label shall be fixed on or adjacent to the socket outlet stating the following:         Network Devices  i. Connections  Where equipment other than water heating, is to be connected to a controlled  supply, this equipment is to be connected via a dedicated circuit and connected to  a dedicated switch in a multi-switch network device.    Note: On existing installations where submains are installed from the main  switchboard/metering point to a distribution switchboard other equipment can be  connected to the controlled supply, however, it will be switched at the same time as  the hot water supply. This shall only be permitted provided the main  switchboard/metering point and distribution switchboard are not located within  proximity (within 20 meters) or back to back with each other.    ii. Single-Phase  Single-phase installations with controlled supplies shall be connected in accordance  with Drawings QECM 7.1 - 7.3  iii. Multiple-Phases  Multiple installations where multi -switch network devices are utilised must be  provided with a network  device switch per customer  in accordance with Drawing  QECM 7.4. Switching of individual customer’s hot water using contactors is not  permitted.  Notes:  1. Connections to multi-switch network devices shall be clearly labelled to identify  the switch applicable to each customer.  Controlled Supply Only  Queensland Electricity Connection Manual   Page 92 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  2. A separate metering isolation link is to be used for supply to the network device(s).   Where more than one switch per customer is required then an individual network  device per customer shall be used as per Section 7.2.2.   iv. Poly phase installations with direct connected meters shall be connected in  accordance with Drawings QECM 7.5 – 7.8.   Note: Three phase loads (e.g. motors) shall be controlled via a network  device  switching a contactor. (Refer Drawing QECM 7.8).   Contactor for Control of Non-Continuous Load  Where the single-phase load to be controlled exceeds 30A resistive (e.g. electric water  heaters), 20A inductive (e.g. motors) or a combination of resistive and inductive load (e.g. air  conditioners), a contactor is required. Where a contactor is required it shall be supplied by the  customer, be of a type acceptable to the distributor  and shall be installed in an accessible  position within the Main Switchb oard, in a sealable fit for purpose enclosure (if required).   (Refer to Drawings QECM 7.2, 7.6, 7.8 and 7.9).    In the Energex distribution area, an additional switch of a multi switch network  device may be used in place of a contactor in domestic installations provided  the load on each switch complies with that given above.  Paralleling of  switches is not permitted.    Contactors with no external moving parts are suitable for use without further protection and  do not require provision for sealing.    Three phase installations requiring a contactor shall have the network  device connected in  accordance with Drawing QECM 7.8 for direct connected meters and Drawing QECM 7.9 for  current transformer metering.    The contactor shall not be used for automatic load control (e.g. it shall not have a humidistat,  a flow switch, a thermostat, a pressure switch or the like connected in its control circuit).   Size of Network Device Wiring  The wiring from a controlled supply meter to a network device (or controlled load main switch)  and all meter neutral wiring shall be PVC insulated stranded copper cable of no more than 7  strands, a minimum of 4mm2 and shall not exceed 6mm².   Aluminium cables are not permitted for connection directly into network device terminals.     Queensland Electricity Connection Manual   Page 93 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 94 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 95 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 96 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 97 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 98 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 99 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 100 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 101 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 102 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 103 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 104 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 105 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062       Queensland Electricity Connection Manual   Page 106 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062          THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK     Queensland Electricity Connection Manual   Page 107 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   EMBEDDED GENERATING (EG) SYSTEMS   An Embedded Generating (EG) System is agnostic to the Distributed Energy Resource that  connects to the distribution network via an inverter. Where there are multiple EG systems  connected at a premise through a connection point, the system capacity is the aggregate of all  generation (unless agreed otherwise with the distributor and documented in a connection  agreement). .    Explanation of Metering Schemes Available  Two metering schemes are available for the grid- connected Embedded Generating (EG)  systems, known as the “ Net Energy ” and the “ Gross Energy” schemes . All EG systems   installations must be compliant with the distributor’s connection standards.  The Queensland Government Solar Bonus Scheme or Regional Feed- in Tariff requires the  installation of a Net Energy metering solution.  The Net Energy metering scheme has a single import/export meter installed in the place of the  existing general supply energy consumption meter(s).  The Gross Energy metering scheme may require an additional import / export meter installed  on the meter panel to record the EG system supply energy generation only.   Agreements  All customers with an EG system must have a Connection Agreement for the EG system in place  with the distributor before the EG system can be connected to the distributor’s supply network.   This includes systems that are configured as  minimal-export or  non-export back to the  distribution network.  The customer or their agent shall nominate the metering scheme on the application form for  network connection of an EG system, and the electrical contractor shall nominate the metering  scheme on their Electrical Work Request sent to the distributor.  Customers wishing to be compensated for any electricity exported by the EG system to the  distributor’s supply network other than through the Queensland Government Solar Bonus  Scheme must also have a Power Purchase Agreement in place with their retailer.  Details on  how feed-in tariffs works and determining eligibility for the retention of Queensland Government  Solar Bonus Scheme can be found at the Queensland Government website  https://www.qld.gov.au/housing/buying-owning-home/feed-in-tariffs.   Approval of Equipment  Typical direct connected metering arrangements have been developed in line with EG system  requirements and retailer offered supply types however it is up to the meteri ng provider to  install suitable metering arrangement to meet site requirements   Notes:  1. Exceptions to the above standards may be approved upon receipt of a written application  in exceptional circumstances.  Applications shall be made in writing to the di stributor.   Standard charges will apply for such arrangements.  2. It must be noted that the “ Gross Scheme” may require an additional meter, and the end  user must be made aware that provision of this space is required at the current metering  location.  3. In a “Net Scheme”, if the principal metering has more than one phase, it is a requirement  that a polyphase meter must be used.     Queensland Electricity Connection Manual   Page 108 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Connection Requirements for EG Systems  Connection requirements associated with EG systems connected to the distribution network  shall be in accordance with:    Total Generator System Rating (kVA) Connection Standard  Up to and including 30kVA   (see Note 1)  STNW1170    Greater than 30 kVA to 1,500 kVA where  connection point with distributor is at low  voltage (LV)  (See Note 2)  STNW1174  Greater than 30 kVA and less than  5MVA where connection point  with  distributor is at high voltage (HV)  STNW1175    Note 1: Applies to Inverter Energy Systems only  Note 2: Applies to rotating machines 0 kVA to 1500 kVA   Electric Vehicle Chargers  Electric Vehicles that are only capable of charging from the grid are not considered a  Small IES but rather a load and the requirements are set out in Section 4.2   Electric Vehicles as IES  An electric vehicle shall be considered part of a Small IES EG Connection when it is  capable of exporting energy into the customers premises or the distribution network.  This is referred to Vehicle-to-Building and Vehicle-to-Grid and shall be connected  under the requirements set out in the Connection Standard STNW1170.    Labelling and signage  Labels and signs on the Small IES, including cables, shall meet the requirements of  AS/NZS4777.1, AS/NZS 30000, AS/NZS 5033 and AS/NZS 5139.     Queensland Electricity Connection Manual   Page 109 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Queensland Electricity Connection Manual   Page 110 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062     Queensland Electricity Connection Manual   Page 111 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   HIGH VOLTAGE METERING   General Requirements  The customer is required to supply, install and maintain all electrical equipment supplied by  the customer.  All high voltage equipment must be compatible with the distributor’s supply.   Relays, current transformers and other protectiv e equipment must have characteristics  compatible with the distributor’s existing protective system.  The design, construction and installation of all high voltage equipment shall comply with the  appropriate Australian Standards (e.g. AS/NZS 3000 (Wiring Rules) and AS 2067) or other  equivalent Standards (e.g. IEC Standards).  Plans, drawings and relevant details describing  the proposed installation and its operating conditions shall be provided.    The distributor will advise the customer  of the prospective fault level and the normal  fluctuations of supply voltage for which provisions should be made.   Testing Requirements  The customer shall meet the cost of any high voltage testing as required by AS 2067 and  auditing in accordance with the Electrical Safety Act 2002 (Qld).  The metering coordinator shall ensure that high voltage revenue metering instrument  transformers are tested and maintained in accordance with the National Electricity Rules.     Operation of High Voltage Equipment  The customer is responsible for ensuring that the high voltage installation is operated in  accordance with the requirements of the Electrical Safety Act 2002 (Qld), the Electrical Safety  Regulation 2013 (Qld) and the Code of Practice for Electrical Work.  The customer has an obligation to ensure all persons who are involved in the high voltage  isolation and access procedures have been trained and assessed as competent to perform the  roles for which they are responsible.  Testing, earthing and safety equipment suitable f or operation of the high voltage equipment  shall be readily available on site.  For high voltage installations consisting of more than one item of switchgear, an operating  diagram in the form of a single line schematic of the complete installation is to be permanently  displayed adjacent to the main switch or switches.  Where items of switchgear are remote from the main switchboard, it is recommended that the  operating diagram also be permanently displayed at these locations.   Maintenance and Repairs of High Voltage Equipment  A customer who takes supply at high voltage shall ensure that the high voltage installation is  maintained so that any malfunction will not create a hazard or cause interference to the  distributor’s supply.  All costs associated with the maintenance or repairs of the customer's high voltage installation  shall be met by the customer.  Note: The customer must be prepared for power interruptions during high voltage testing  procedures, maintenance or repairs.   Conversion from Low Voltage Supply to High Voltage Supply  A customer planning to convert from supply at low voltage to supply at high voltage shall  negotiate with the distributor before commencement of work.    Options to be considered may include the following:  (a) Replacement of the distributor’s substation and other assets or purchase of this   equipment from the distributor; and  Queensland Electricity Connection Manual   Page 112 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (b) Any costs associated with converting the installation for compliance with AS/NZS   3000 (Wiring Rules) and AS 2067.   Metering Requirements  The customer or customer’s representative (electrical contractor or consultant) must contact  the distributor prior to commencing any project that may require high voltage metering.  High  voltage metering is complex and the following may need to be considered:  (a) Specialised metering design (voltage change-over schemes etc.).   (b) Compliance with the National Electricity Rules.  (c) Equipment with long lead times (e.g. 6 to 12 months) may be required.  (d) Full or partial check metering requirements for large loads.  (e) Generator connections and import/export load flows.  (f) Test certificates for metering instrument transformers from an accredited laboratory.  The relevant metering requirements in previous chapters also apply to high voltage  installations.  Where there ar e differences between the information in Section 9 and the  remainder of the QECM,  the requirements of Chapter 9 prevail in relation to high voltage  metering.  The additional details contained in Chapter 9 are specific to high voltage metering  installations.  The distributor or metering provider can be contacted for additional information.     Establishing a Network Connection and NMI  For high voltage connections the process of metering the site, data collection and settlement  of energy requires the following steps:  1. The customer is required to engage an electricity  retailer licensed to operate in  Queensland.  2. The retailer is required to appoint a metering coordinator.    3. The metering coordinator  is required to appoint the metering data prov ider and the  provider.    4. The retailer (as the financially responsible Market Participant) is required to submit a SOR  to the distributor to make the network connection.  5. The Local Network Service Provider must then issue a unique NMI for each metering  installation on its network.  The above process will establish a NMI per connection point in line with the distributor’s policies  and the AEMO “National Metering Identifier Procedure”  (refer to Flowchart 7 – Initial  Connection – High Voltage Installation in Responsibilities Section).   Connection Offer and/or Network Connection Agreement  The distributor will negotiate a connection agreement detailing the conditions for the high  voltage supply.  This correspondence will include network requirements and the responsibility  for providing the high voltage metering.   Connection point  Refer to Section 5.2.2 for connection point arrangements.  The revenue metering point shall be located as close as practicable to the connection point.  Queensland Electricity Connection Manual   Page 113 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062   Revenue Metering  The arrangement for the high voltage revenue metering installation will be  determined during the connection enquiry and application process:   (a) A Type 1- 3 metering installation; as required for HV connections is an  unregulated distribution service in Queensland and the customer  is  responsible for supplying, installing, maintaining and testing the metering  installation including the instrument transformers.   (b) The metering installation contains the metering current transformers and the  metering voltage transformers (revenue metering instrument transformers).  Wherever practicable this equipment shall be located within the customer’s  installation and be accessible to the m etering provider. The metering  installation shall comply with the requirements outlined in the AEMO  Metrology Procedure Part A and the National Electricity Rules Chapter 7 and  be approved by the metering coordinator.   (c) The customer shall provid e revenue metering instrument transformers,  associated equipment and plant. The equipment must be ready for the  nominated metering provider  to connect metering and communication  equipment.   (d) Revenue metering instrument transformers will remain the custo mer’s  property, and the customer will be responsible for maintaining, servicing and  if failure occurs, replacing the metering instrument transformers in accordance  with the requirements of the National Electricity Rules.   Note: Any fault or defect is required to be rectified within 2 business days or  the metering coordinator must obtain an exemption from AEMO.   (e)  The revenue metering instrument transformers are to be specified, installed,  tested and maintained in accordance with the requirements of the National  Electricity Rules, relevant Australian Standards (AS/NZS 3000 (Wiring Rules),  AS 2067, AS 1243, AS 60044 series) and the QECM   (f)   Instrument Transformer test certificates in accordance with the requirements  of the National Electricity Rules Schedules 7.2 and 7.3 shall be provided to  the metering provider prior to installation of the equipment.          i)   Where revenue metering instrument transformers are tested in Australia,  endorsed reports from a laboratory accredited by NATA are required; or         ii)   Where revenue metering instrument transformers are tested overseas,  endorsed reports from a laboratory accredited by an organisation recognised  by ILAC (International Laboratory Accreditation Cooperation) are required.  (g)  Metering installation designs that are approved by a metering provider  or  metering coordinator  shall also be provided to the distributor  prior to  connection. The customer shall supply a single line diagram, HV switchboard  layout, and a schematic diagram showing the wiring details from the  instrument transformers (current and voltage transformers) to the metering  panel.   (h)  The customer is required to supply, install and test the secondary wiring and  meter enclosure/panel and terminate the secondary wiring at the meter panel  and the metering instrument transformers.   (i)   The customer is responsible for ensuring that all requirements  and steps in  the metering installation process are coordinated in an efficient and timely  manner to allow supply to be connected when required.   Queensland Electricity Connection Manual   Page 114 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (j)   The customer shall provide readily accessible high voltage test points on either  side of the metering in strument transformers, in the specification/design of  their switchgear. This will enable the metering provider to conduct the periodic  high voltage metering instrument transformer accuracy tests (e.g. primary  injection tests), required by the National Electricity Rules, with minimal power  outages and disruption to the customer and their equipment.   (k)  For metering installations greater than 1000 GWh pa per connection point, the  current transformer core and secondary wiring associated with the meter(s)  shall not be used for any other purpose unless otherwise agreed by AEMO.   (l)   For metering installations less than 1000 GWh pa per connection point the  current transformer core and secondary wiring associated with the meter(s)  may be used for other purposes (e.g. local metering or protection) provided  the metering coordinator demonstrates to the satisfaction of AEMO that the  accuracy of the metering installation is not compromised and suitable  procedures/measures are in place to protect the security of the metering  installation.   (m) The metering voltage instrument transformers may be used to supply  customers metering at the discretion and approval of the metering provider on  a case by case basis. The secondary voltage supply from the voltage  transformers will be separately fused with fuses located in an accessible  position as near as practicable to the voltage transformer secondary  connection. The revenue metering instrument transformers’ secondary wiring  is to be earthed at one point only in accordance with the metering provider’s  requirements.   (n)  The minimum spacing between the meter wiring and other current carrying  conductors shall comply with QEMM   (o)  Adequate and safe access must be provided for the installation, routine and  corrective maintenance of revenue metering equipment in accordance with  AEMO requirements   (p)  The revenue metering instrument transformers may be used to supply the  distributor’s power quality monitoring equipment at the discretion and  approval of the customer and metering provider on a case by case basis.   .   Meter Enclosure  The following requirements apply to high voltage metering enclosures:  (a) Unless otherwise detailed in the supply agreement the customer must supply a pre-wired  meter panel and enclosure to the requirements of the metering provider.  Wiring diagrams  can be obtained from the metering provider.  (b) Any metering enclosure mounted externally must have an appropriate IP rating and be  positioned so that adequate mechanical protection is provided.   (c) A hinged panel with minimum dimensions of 600mm x 600mm is required for the mounting  of meters and metering test block on the same vertical surface.  (d) A metering enclosure installed on a pole in association with a distributor owned metering  unit, will be supplied and maintained by the distributor.  (e) No customer owned equipment is to be installed within the metering provider’s dedicated  metering enclosure.  (f) The supply and wiring of the meter panel may be carried out by the metering provider as  part of a negotiated agreement.  Queensland Electricity Connection Manual   Page 115 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  (g) The customer is responsible for earthing of the metering enclosure in accordance with  relevant standards and practices including consideration for earth potential rise.  (h) The customer should consider providing lockable front meter doors in locations where  security may be an issue.   Secondary Wiring  The following requirements apply to metering units supplied by the metering provider  and  revenue metering instrument transformers owned and installed by the customer.   (a) The customer shall supply and install the secondary wiring between the revenue metering  instrument transformers and the test block or terminal strip.    (b) Revenue metering instrument transformer secondary wiring is to follow the most direct route  and the number of terminations and links must be kept to a minimum.  (c) Revenue metering instrument transformer secondary wiring is to be PVC insulated stranded  cable of no more than 7 strands.    (d) The secondary wiring shall be sized to ensure that the burden on the revenue metering  instrument transformers is not exceeded.  (e) All taps of multi-tap CTs to be brought out to the marshalling box or metering enclosure (in  the absence of a marshalling box).  (f) Any connection point in the revenue metering instrument transformers’ secondary circuit  (terminals, links, fuses etc.) that is accessible must be identified as “Revenue Metering” and  must be able to be covered and sealed.      Queensland Electricity Connection Manual   Page 116 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062    THIS PAGE HAS BEEN DELIBERATELY LEFT BLANK     Queensland Electricity Connection Manual   Page 117 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  APPENDIX A - SPECIFICATION FOR METALLIC ENCLOSURES FOR  METERS IN DIRECT CONNECTED INSTALLATIONS  Foreword  This specification provides for metallic enclosures only. The use of other materials, such as fibreglass  or plastic is subject to the approval of the distributor.  In such cases, the general requirements of this  specification may provide guidance.  A.1 Scope and General  A.1.1 Scope  This specification provides standard requirements for metallic enclosures for revenue  meters and control equipment used in Direct Connected installations.  A.1.2 Definitions  A.1.2.1 Approved - means approved by the metering provider.  A.1.2.2 Direct Connected Installation - means an installation that is metered by  Direct Connected meters.  A.1.2.3 Meter Enclosure - means an enclosure used for the purpose of housing  revenue metering equipment.  A.1.2.4 Meter Panel - means a panel to be mounted in the meter enclosure and  on which metering equipment is fixed.  A.1.2.5 Metering Equipment - means the equipment used for measuring or  controlling the supply of electrical energy.  A.1.2.6 Weatherproof - means so constructed and installed as to exclude rain, hail  and external splashing so that the safe and efficient operation of the  equipment contained therein shall not be impaired.  (e.g. IP23).  A.2 Design and Construction  A.2.1 Materials  The meter enclosure may be constructed from the following:    MATERIAL MINIMUM THICKNESS  (mm)  Mild Steel Enclosure Type A  1.0  Enclosure Type B  1.2  Aluminium To be equivalent in strength  and rigidity to the above mild  steel requirements  Other Materials To be approved       Queensland Electricity Connection Manual   Page 118 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  A.2.2 Construction  A.2.2.1 The enclosure should be constructed free of burrs at the opening.  A.2.2.2 The enclosure, if of steel construction, shall  be of galvanised or  zincalume material and shall comply with the requirements of AS 1397  “Steel sheet and strip - hot dip zinc-coated or aluminium/zinc-coated”.  A galvanised steel meter enclosure shall have all galvanised surfaces  repaired with a suitable zinc rich coating.  All exterior surfaces of the  enclosure should be painted with one coat of “etch primer”.  A.2.2.3 The use of aluminium shall be restricted to corrosion resistant alloys as  recommended for the exposure to be encountered in service (stainless  steel is an acceptable alternative).  A.2.2.4 Rivets shall be of a material that is compatible with the case material  and must not react to set up points of corrosion.  A.2.2.5 Where additional mechanical strength is required stiffening ribs may be  utilised.  Such ribs must not in any way reduce the minimum internal  dimensions.  A.2.3 Door  A.2.3.1 The meter enclosure is to be fitted with a hinged door of sufficient  strength to prevent buckling or warping.  A.2.3.2 The door shall be  side hinged, unless otherwise approved by the  metering provider, and fitted with a suitable non- corroding chain or  other approved means to limit the door travel to approximately 100  degrees.  The door may be hinged at either the left or right side of the  meter enclosure and shall be fitted with a simple self-latching device.   A.2.3.3 Hinges provided shall be of non-corroding material and so designed or  fitted with non-corroding pins as to prevent seizing.  A.2.4 Door Latch  The latching device provided shall engage automatically and hold the door firmly closed.  A.2.5 Entry of Wiring  Adequate provisions shall be made for knockouts or slots for the entry of wiring to the  meter enclosure.  (Refer to AS/NZS 3000 (Wiring Rules) for fire protection requirements).  Entries may be provided in the top of the enclosure but in this case the final assembly  should withstand the test in Item A.2.7 of Appendix A.  A.2.6 Earthing  To ensure an effective Earth of the Switchboard Surround an earthing stud or terminal  complying with the requirements of AS/NZS 3000 (Wiring Rules) shall be provided for the  connection of an earthing conductor within the enclosure.  The stud or terminal shall not  obstruct equipment within the enclosure.  A.2.7 Weatherproofing  The enclosure is to comply with AS/NZS 60529 \"Degrees of Protection Provided by  Enclosures\" to a minimum of IP23.  The enclosure shall provide adequate ventilation to minimise condensation and be capable  of draining any moisture that may collect within the enclosure.  A.2.8 Meter Panel  Queensland Electricity Connection Manual   Page 119 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062  A.2.8.1 Meter panels shall be constructed of durable, non- conducting, fire  resistant material with low water absorption properties  and shall not  contain asbestos.    A.2.8.2 The meter panel shall be side hinged on a vertical axis so that the  metering equipment always remains in the vertical plane.  A.2.8.3 Panel hinges should be of the double off -set type that allows for the  panel to be swung into the fully opened position and shall be of  adequate strength to support the meter panel and associated metering  equipment.  The hinges shall be constructed of a suitable non-corroding material.   When the meter panel is opened at an angle of 90 degrees, the design  of the enclosure and hinges should be such to withstand without undue  distortion a weight of 25kg suspended vertically at a position 25mm  from the outer edge of the panel.  A.3 Dimensions  A.3.1 General  Two basic types of meter enclosures are provided for, the dimensions of which are to be  suitable for recessing into brick, block or framed walls.  Other meter enclosures of  adequate size to house the meters with recommended clearances and suitable  construction may be used. The meter panel must meet the minimum size set out in the  table below. This table is indicative of the most commonly supplied metering enclosures  that comply with the QECM.      Metal  Enclosure    Minimum  Thickness  Mild Steel    Minimum  Space  Required For  Metering  Equipment    Clearance  From  Back of Meter  Panel to Back  of Enclosure    Clearance  From Back of  Meter Panel to  Inside of Door    Type A      Type B",
  "6.13": "6.13 Metering Height     Additional Requirements    AS/NZS  3000  Test continuity to confirm that cabinets are earthed:    QEMM All requirements of the QEMM met.         Queensland Electricity Connection Manual   Page 80 of 127 NA000403R509 Ver 3     Joint document between Energex and Ergon Energy    Energex Limited ABN 40 078 849 055      Ergon Energy Corporation Limited ABN 50 087 646 062      LV Current Transformer Metering Check Sheet  Electrical Contractor’s LV CT Metering Check Sheet    Address Where CT Metering Installed:     National Metering Identifier (NMI) (If known):      Details of Electrical Mechanic Responsible for Testing of CT Installation:    Name: Licence No:    Clause  No.    Checklist    Checked    Comments   Switchboard/CT Chamber",
  "6.6.3": "6.6.3 Lockable isolator on line side of CTs:    QEMM Dedicated CT chamber provided:    QEMM CT chamber correctly labelled:    QEMM Removable CT chamber cover fitted with 2 handles:     Current Transformers    QEMM CT ratio matches expected load:",
  "1.0": "1.0mm"
}